
&НаКлиенте
Процедура ba_ТоварыПроцентРучнойСкидкиПриИзмененииВместо(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Сумма = ТекущаяСтрока.ЦенаИнвойс * ТекущаяСтрока.Количество;
	ТекущаяСтрока.СуммаРучнойСкидки = Сумма * ТекущаяСтрока.ПроцентРучнойСкидки / 100;
	ТекущаяСтрока.СуммаИнвойс = Сумма  - ТекущаяСтрока.СуммаРучнойСкидки; 
	
	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
&ИзменениеИКонтроль("ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок")
Процедура ba_ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Форма)

	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Форма.Объект);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	УчетПрослеживаемыхТоваровКлиентСерверЛокализация.ДополнитьОписаниеНастроекПересчетаРеквизитовТабличнойЧасти(
	Форма.Объект,
	СтруктураДействий,
	"Склад",
	Истина);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму"); 
	#Удаление
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь)); 
	#КонецУдаления
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");

КонецПроцедуры

&НаСервере
&После("УстановитьВидимостьЭлементовПоОперацииСервер")
Процедура BG_УстановитьВидимостьЭлементовПоОперацииСервер()
	// Андрей Ринг
	Элементы.ДатаПриемки.ТолькоПросмотр 		= Объект.Статус=Перечисления.СтатусыПоступленийТоваров.Отгружено;
	Элементы.ДатаПоступленияФакт.ТолькоПросмотр = Объект.Статус=Перечисления.СтатусыПоступленийТоваров.Отгружено;
	// Андрей Ринг
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
&После("РассчитатьИтоговыеПоказателиПоступления")
Процедура BG_РассчитатьИтоговыеПоказателиПоступления(Форма)
	// Андрей Ринг
	Если Форма.УчетПоТоварнымКатегориям Тогда
		Форма.СуммаВсего 				= Форма.Объект.ТоварныеКатегории.Итог("СуммаСНДС");
	КонецЕсли;
	// Андрей Ринг
КонецПроцедуры

&НаКлиенте
&Вместо("ПоступлениеПоЗаказамПриИзмененииЗавершение")
Процедура BG_ПоступлениеПоЗаказамПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры)
	ЗаказПоставщику = ДополнительныеПараметры.ЗаказПоставщику;
	
	
	ОтветНаВопрос = РезультатВопроса;
	Если ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
		Объект.ПоступлениеПоЗаказам = Не Объект.ПоступлениеПоЗаказам;
		
		// Андрей Ринг. Если галка была установлена, значит это надо
		Если Не Объект.ПоступлениеПоЗаказам Тогда
			Объект.ПоступлениеПоЗаказам = Истина;
		КонецЕсли;
		// Андрей Ринг
		
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		Объект.ЗаказПоставщику = ЗаказПоставщику;
	КонецЕсли;
	ПоступлениеПоЗаказамПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
&Вместо("ПолучитьТоварыИзХранилища")
Процедура BG_ПолучитьТоварыИзХранилища(АдресТоваровВХранилище)
	baВсегдаДобавлятьНовыеСтроки=Ложь;
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтаФорма);
	СтруктураДействий.Удалить("ОчиститьСуммуВзаиморасчетов");
	СтруктураДействий.Удалить("ПересчитатьСуммуСверхЗаказа");
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",
		Новый Структура("НалогообложениеНДС, Дата", Объект.НалогообложениеНДС, Объект.Дата));
	КэшированныеЗначения = Неопределено;
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	СтруктураПоискаТоваровЗаказа = Новый Структура("КодСтроки,ЗаказПоставщику,Серия");
	СтруктураПоискаТоваровНакладной = Новый Структура("НомерСтроки");
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		
		Если СтрокаТоваров.КодСтроки<>0 И ЗначениеЗаполнено(СтрокаТоваров.ЗаказПоставщику) Тогда
			СтруктураПоискаТоваровЗаказа.КодСтроки = СтрокаТоваров.КодСтроки;
			СтруктураПоискаТоваровЗаказа.ЗаказПоставщику = СтрокаТоваров.ЗаказПоставщику;
			СтруктураПоискаТоваровЗаказа.Серия = СтрокаТоваров.Серия;
			МассивСтрокТЧТовары = Объект.Товары.НайтиСтроки(СтруктураПоискаТоваровЗаказа);
		Иначе
			СтруктураПоискаТоваровНакладной.НомерСтроки = СтрокаТоваров.НомерСтроки;
			МассивСтрокТЧТовары = Объект.Товары.НайтиСтроки(СтруктураПоискаТоваровНакладной);
		КонецЕсли;
		
		// Андрей Ринг
		Если baВсегдаДобавлятьНовыеСтроки Тогда
			
			СтрокаТЧТовары = Объект.Товары.Добавить();
		// Андрей Ринг
		ИначеЕсли МассивСтрокТЧТовары.Количество() = 0 Тогда
			
			СтрокаТЧТовары = Объект.Товары.Добавить();
			
		ИначеЕсли МассивСтрокТЧТовары.Количество() = 1 Тогда
			
			СтрокаТЧТовары = МассивСтрокТЧТовары[0];
			
		ИначеЕсли МассивСтрокТЧТовары.Количество() > 1 Тогда
			
			Для Каждого СтрокаКУдалению Из МассивСтрокТЧТовары Цикл
				
				Объект.Товары.Удалить(СтрокаКУдалению);
				
			КонецЦикла;
			
			СтрокаТЧТовары = Объект.Товары.Добавить();
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧТовары, СтрокаТоваров);
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧТовары, СтруктураДействий, КэшированныеЗначения);
		Если НЕ ИспользоватьПоступлениеПоНесколькимЗаказам 
			И ЗначениеЗаполнено(СтрокаТЧТовары.ЗаказПоставщику) 
			И Объект.ЗаказПоставщику <> СтрокаТЧТовары.ЗаказПоставщику Тогда
			
			Объект.ЗаказПоставщику = СтрокаТЧТовары.ЗаказПоставщику;
			
		КонецЕсли;
	КонецЦикла;
	
	// Андрей Ринг
	ЗаполнитьПолеПеремещаемИзЗаказа();
	// Андрей Ринг
	
	СтруктураНаименованийТабличныхЧастей = Новый Структура("Товары");
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(СтруктураНаименованийТабличныхЧастей);
	ЗаполнитьПризнакСписанияНаРасходыДляУслуг();
	ЗаполнитьСтатусыУказанияСерийСервер();
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	СтруктураДействий.Вставить("ПересчитатьСуммуСверхЗаказа", Новый Структура("РеализацияПоступлениеПоЗаказу, ТребуетсяЗалогЗаТару",
		Объект.ПоступлениеПоЗаказам, Объект.ТребуетсяЗалогЗаТару));
		
	// Андрей Ринг. Если меняют количество в подборе, не пересчитывется сумма?!
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Этаформа.Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	СтруктураДействий.Вставить("ПересчитатьСуммуСверхЗаказа", Новый Структура("РеализацияПоступлениеПоЗаказу, ТребуетсяЗалогЗаТару",
		Объект.ПоступлениеПоЗаказам, Объект.ТребуетсяЗалогЗаТару));
		
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	// Андрей Ринг
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, Неопределено);
	
	МногооборотнаяТараСервер.ОбновитьПризнакБезВозвратнойТары(Объект.Товары, Объект.ВернутьМногооборотнуюТару);
	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
	
	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
	ВзаиморасчетыКлиентСервер.ОбновитьТекстГиперссылкиВалюты(ЭтаФорма);
	
	ЗаполнитьЦеныНоменклатурыЗаказов();
	ПриИзмененииСкладаВТабличнойЧастиСервер();
	
	ОбновитьИнформациюПоЗаказам();
	Объект.ПоступлениеПоЗаказам = ЗначениеЗаполнено(Объект.ЗаказПоставщику) ИЛИ СписокЗаказов.Количество() > 0;
	ОбновитьОтклоненияОтЗаказа();
	
	ВзаиморасчетыСервер.ПриИзмененииПараметровМеханизма(ЭтотОбъект);
	УстановитьВидимостьКомандПоЗаказу();
	ВзаиморасчетыСервер.ФормаПриИзмененииРеквизитов(ЭтотОбъект, "ПоступлениеПоЗаказам");
КонецПроцедуры

&НаКлиенте
Процедура BG_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	
	// Андрей Ринг
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаТоварныеКатегории" Тогда
		ЗагрузитьТоварныеКатегории();
	КонецЕсли;
	// Андрей Ринг
	
	КоличествоРасхождений = Объект.Товары.Итог("РасхождениеЗаказ");
	Если КоличествоРасхождений > 0 Тогда  
		ПоказатьПредупреждение(,"В документе есть строки сверх заказа, запись невозможна!",,"BABOCHKA");
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура BG_ОбработкаВыбораПеред(ВыбранноеЗначение, ИсточникВыбора)
	// Андрей Ринг	
	Если ИсточникВыбора.ИмяФормы = "Документ.ПриобретениеТоваровУслуг.Форма.ФормаПодбораТоварныхКатегорииИзЗаказа" Тогда
		
		ПолучитьТоварныеКатегорииИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	КонецЕсли;	
	// Андрей Ринг
КонецПроцедуры

&НаКлиенте
Процедура BG_ГруппаСтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	// Андрей Ринг
	Если ТекущаяСтраница.Имя = "ГруппаТоварныеКатегории" Тогда
		ЗагрузитьТоварныеКатегории();
	КонецЕсли;
	// Андрей Ринг
КонецПроцедуры

Процедура ЗагрузитьТоварныеКатегории()
	ПредварительныеЗаказыСервер.ЗагрузитьТоварныеКатегории(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура BG_ЗаполнитьПеремещаемПосле(Команда)
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	Если Объект.Товары.Количество() = 0 Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'В список ""Товары"" не введено ни одной строки.'"));
		Возврат;
	конецесли;
		
	УстановитьПеремещаемЗавершение(ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПеремещаемЗавершение(МассивСтрок) экспорт //Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Перемещаем) Тогда
		
		Для Каждого НомерСтроки Из МассивСтрок Цикл
			СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
			СтрокаТЧ.Перемещаем  = Перемещаем; //ВыбранноеЗначение;
			СтрокаТЧ.Накладная  = Накладная; //ВыбранноеЗначение;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПолеПеремещаемИзЗаказа()
	
	ВсеЗаказы = Объект.Товары.Выгрузить();
	ВсеЗаказы.Свернуть("ЗаказПоставщику");
	
	ВсеЗаказы = ВсеЗаказы.ВыгрузитьКолонку("ЗаказПоставщику");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Ссылка КАК ЗаказПоставщику,
	|	ЗаказПоставщикуТовары.КодСтроки КАК КодСтроки,
	|	ЗаказПоставщикуТовары.Перемещаем КАК Перемещаем
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка В(&ВсеЗаказы)";
	
	Запрос.УстановитьПараметр("ВсеЗаказы", ВсеЗаказы);
	
	ТаблицаЗаказов = Запрос.Выполнить().Выгрузить();
	
	ТаблицаЗаказов.Индексы.Добавить("ЗаказПоставщику,КодСтроки");
	
	Для Каждого СтрокаТоваров ИЗ Объект.Товары Цикл
		
		НайденноеПеремещение = ТаблицаЗаказов.НайтиСтроки(Новый Структура("ЗаказПоставщику,КодСтроки", СтрокаТоваров.ЗаказПоставщику, СтрокаТоваров.КодСтроки));
		
		Если НайденноеПеремещение.Количество() Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТоваров, НайденноеПеремещение[0]);
		Конецесли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредплатуПоДокументу()
	
	Объект.ПоступлениеПоЗаказам = Истина;
	ПредварительныеЗаказыСервер.ЗаполнитьПредоплатуПоДокументу(Объект, СуммаВсего);
	Если Объект.ЭтапыГрафикаОплаты.Количество() = 0 Тогда
		Объект.ПоступлениеПоЗаказам = ложь;
		ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
		ЗначениеВДанныеФормы(ДокументОбъект,Объект);
		Объект.ПоступлениеПоЗаказам = Истина;
	КонецЕслИ;
КонецПроцедуры

&НаСервере
Функция ПолучитьТЗИсходныхСумм(СсылкаДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриобретениеТоваровУслугТовары.КодСтроки КАК КодСтроки,
		|	СУММА(ПриобретениеТоваровУслугТовары.Сумма) КАК Сумма,
		|	СУММА(ПриобретениеТоваровУслугТовары.Количество) КАК Количество,
		|	СУММА(ПриобретениеТоваровУслугТовары.СуммаИнвойс) КАК СуммаИнвойс,
		|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|ГДЕ
		|	ПриобретениеТоваровУслугТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриобретениеТоваровУслугТовары.КодСтроки,
		|	ПриобретениеТоваровУслугТовары.Номенклатура,
		|	ПриобретениеТоваровУслугТовары.Характеристика
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	999,
		|	СУММА(-1),
		|	СУММА(1),
		|	СУММА(-1),
		|	NULL,
		|	NULL";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаДокумент);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Индексы.Добавить("КодСтроки, Номенклатура, Характеристика");
		
	Возврат ТЗ;
	
КонецФункции

&НаКлиенте
Процедура BG_КоманднаяПанельТоварыРазмножитьСтрокиДляФотоПосле(Команда)
	
	Строки = объект.товары.НайтиСтроки(новый структура("Фотографируем",истина));
		для каждого стр из строки цикл
			если стр.количество > 1 тогда 
				НоваяСтрокаТовары=объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары,стр);			
				НоваяСтрокаТовары.Количество=1;
				НоваяСтрокаТовары.КоличествоУпаковок=1;
				Сообщить("Добавлена строка "+СокрЛП(НоваяСтрокаТовары.Номенклатура)+" "+СокрЛП(НоваяСтрокаТовары.Характеристика)+" "+
		             СокрЛП(НоваяСтрокаТовары.Количество));	
				СтруктураДействий = Новый Структура;
				ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтаФорма);
				
				ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НоваяСтрокаТовары, СтруктураДействий, Неопределено);
					
				РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
				//\\
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Номенклатура", стр.Номенклатура);
				ПараметрыОтбора.Вставить("Характеристика", стр.Характеристика);
				ПараметрыОтбора.Вставить("Количество", стр.Количество);
				НайденныеСтроки = объект.Товары.НайтиСтроки(ПараметрыОтбора);		
				
				Если НайденныеСтроки.Количество()>0 Тогда
				
					НайденныеСтроки[0].Количество=НайденныеСтроки[0].Количество-1;
					НайденныеСтроки[0].КоличествоУпаковок=НайденныеСтроки[0].КоличествоУпаковок-1;
					НайденныеСтроки[0].Фотографируем=Ложь;				
					
					СтруктураДействий = Новый Структура;
					ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтаФорма);
					
					ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НайденныеСтроки[0], СтруктураДействий, Неопределено);
					
					РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
                    
					Сообщить("В строке "+СокрЛП(НайденныеСтроки[0].Номенклатура)+" "+СокрЛП(НайденныеСтроки[0].Характеристика)+" изменено количество с "+
				             СокрЛП(НайденныеСтроки[0].Количество+1)+" на "+СокрЛП(НайденныеСтроки[0].Количество));		
					
				КонецЕсли;
			конецесли;
		конеццикла;

	BG_КоманднаяПанельТоварыРазмножитьСтрокиДляФотоПослеНаСервере();
	    

КонецПроцедуры

&НаСервере
Функция BG_КоманднаяПанельТоварыРазмножитьСтрокиДляФотоПослеНаСервере()
	
	ТЗИсходыеСуммы = ПолучитьТЗИсходныхСумм(Объект.Ссылка);

			
	Для каждого ТекущаяСтрока Из Объект.Товары Цикл
		
		Сумма = ТекущаяСтрока.ЦенаИнвойс * ТекущаяСтрока.Количество;
		ТекущаяСтрока.СуммаРучнойСкидки = Сумма * ТекущаяСтрока.ПроцентРучнойСкидки / 100;
		ТекущаяСтрока.СуммаИнвойс = Сумма  - ТекущаяСтрока.СуммаРучнойСкидки;  
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;	
		ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Сумма;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.КодСтроки) Тогда
			ИсходнаяСтрокаСуммы = ТЗИсходыеСуммы.Найти(ТекущаяСтрока.КодСтроки, "КодСтроки");	
		Иначе
			ИсходныеСтрокиСуммы = ТЗИсходыеСуммы.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Характеристика));
			Если ИсходныеСтрокиСуммы.Количество() Тогда
				ИсходнаяСтрокаСуммы	= ИсходныеСтрокиСуммы[0];
			КонецЕсли;
		КонецЕсли;
		Если ИсходнаяСтрокаСуммы <> Неопределено Тогда
			ИсходнаяСтрокаСуммы.Количество 	= ИсходнаяСтрокаСуммы.Количество - ТекущаяСтрока.Количество;
			ИсходнаяСтрокаСуммы.СуммаИнвойс = ИсходнаяСтрокаСуммы.СуммаИнвойс - ТекущаяСтрока.СуммаИнвойс;
			ИсходнаяСтрокаСуммы.Сумма 		= ИсходнаяСтрокаСуммы.Сумма - ТекущаяСтрока.Сумма;
			Если ИсходнаяСтрокаСуммы.Количество = 0 
				И ИсходнаяСтрокаСуммы.СуммаИнвойс <> 0 Тогда
				
				ТекущаяСтрока.СуммаРучнойСкидки = ТекущаяСтрока.СуммаРучнойСкидки - ИсходнаяСтрокаСуммы.СуммаИнвойс; //разница в копейках
				ТекущаяСтрока.СуммаИнвойс = Сумма  - ТекущаяСтрока.СуммаРучнойСкидки;  
				ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;	
				ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Сумма;
		
			КонецЕсли;
			
		КонецЕсли; 	
		
	КонецЦикла;
КонецФункции

// Андрей Ринг
&НаКлиенте
Процедура ОбработкаФормированияАссортимента(ВыбранноеЗначение) Экспорт
	BG_ПолучитьТоварыИзХранилищаЗагрузкаАрмани(ВыбранноеЗначение.АдресТоваровВХранилище);
КонецПроцедуры

&НаКлиенте
Процедура BG_ПересчетЦеныСУчетомСкидкиПосле(Команда)
	Режим = РежимДиалогаВопрос.ДаНет;
	СуммаСкидки = 0;
	Если ВвестиЧисло(СуммаСкидки, "Скидка- "+СокрЛП(Формат(СуммаСкидки,"ЧЦ=4; ЧДЦ=2"))+"%,"+Символы.ПС+
			"пересчитать цены номенклатуры?" , 10, 2) и СуммаСкидки <> 0 Тогда
			Ответ = Вопрос("Цены будут уменьшены на "+СокрЛП(Формат(СуммаСкидки,"ЧЦ=4; ЧДЦ=2"))+"%, продолжить?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;  
		модифицированность = истина;
	Иначе Возврат;	
	КонецЕсли;
	Для каждого Строка из объект.Товары Цикл
		Строка.Сумма=Строка.Сумма-Строка.Сумма*СуммаСкидки/100;
		//ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(Строка, ЭтотОбъект);
		//ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Строка, ЭтотОбъект);		
	    СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Этаформа.Объект);
	
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВЗакупках",  ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВЗакупкахВТЧ(Объект, Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПриемНаКомиссию")));
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
		СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
		СтруктураДействий.Вставить("ПересчитатьСуммуСверхЗаказа", Новый Структура("РеализацияПоступлениеПоЗаказу, ТребуетсяЗалогЗаТару",
			Объект.ПоступлениеПоЗаказам, Объект.ТребуетсяЗалогЗаТару));
			
		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Строка, СтруктураДействий, КэшированныеЗначения);
		ОбновитьОтклоненияОтЗаказаВСтроке(Строка, Объект.ПоступлениеПоЗаказам, Объект.ТребуетсяЗалогЗаТару);
		
		Строка.СуммаСНДС  = Строка.Сумма;

		РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
				
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодборКатегорийИзЗаказа()
	
	МассивКодовСтрок = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.ТоварныеКатегории Цикл
		
		Если СтрокаТЧ.КодСтроки <> 0 И ЗначениеЗаполнено(СтрокаТЧ.ЗаказПоставщику) Тогда
			МассивКодовСтрок.Добавить(Новый Структура("КодСтроки,ЗаказПоставщику", СтрокаТЧ.КодСтроки, СтрокаТЧ.ЗаказПоставщику));
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыПодбора = Новый Структура(
		"ЗаказПоставщику,
		|ВалютаДокумента,
		|ПоступлениеТоваровУслуг,
		|Склад,
		|МассивКодовСтрок,
		|Партнер,
		|Контрагент,
		|Договор,
		|Организация,
		|ХозяйственнаяОперация,
		|Соглашение,
		|ВалютаВзаиморасчетов,
		|НалогообложениеНДС,
		|ЦенаВключаетНДС,
		|ПорядокРасчетов,
		|ВернутьМногооборотнуюТару,
		|НаправлениеДеятельности",
		Объект.ЗаказПоставщику,
		Объект.Валюта,
		Объект.Ссылка,
		Объект.Склад,
		МассивКодовСтрок,
		Объект.Партнер,
		Объект.Контрагент,
		Объект.Договор,
		Объект.Организация,
		Объект.ХозяйственнаяОперация,
		Объект.Соглашение,
		Объект.ВалютаВзаиморасчетов,
		Объект.НалогообложениеНДС,
		Объект.ЦенаВключаетНДС,
		Объект.ПорядокРасчетов,
		Объект.ВернутьМногооборотнуюТару,
		Объект.НаправлениеДеятельности);
	
	ОткрытьФорму(
		"Документ.ПриобретениеТоваровУслуг.Форма.ФормаПодбораТоварныхКатегорииИзЗаказа",
		ПараметрыПодбора,
		ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	КонецПроцедуры

&НаКлиенте
Процедура BG_ПодобратьТоварныеКатегорииИзЗаказаПосле(Команда)
	ПодборКатегорийИзЗаказа()
КонецПроцедуры

&НаСервере
Процедура ПолучитьТоварныеКатегорииИзХранилища(АдресТоваровВХранилище)
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	СтруктураПоискаТоваров = Новый Структура("ЧастьКоллекции,Пол,ТоварнаяКатегория");
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		
		// Обработка ТЧ товары.
		//СтруктураПоискаТоваров.КодСтроки = СтрокаТоваров.КодСтроки;
		МассивСтрокТЧТовары = Объект.ТоварныеКатегории.НайтиСтроки(СтруктураПоискаТоваров);
		Если МассивСтрокТЧТовары.Количество() = 0 Тогда
			
			СтрокаТЧТовары = Объект.ТоварныеКатегории.Добавить();
			
		ИначеЕсли МассивСтрокТЧТовары.Количество() = 1 Тогда
			
			СтрокаТЧТовары = МассивСтрокТЧТовары[0];
			
		ИначеЕсли МассивСтрокТЧТовары.Количество() > 1 Тогда
			
			Для Каждого СтрокаКУдалению Из МассивСтрокТЧТовары Цикл
				
				Объект.ТоварныеКатегории.Удалить(СтрокаКУдалению);
				
			КонецЦикла;
			
			СтрокаТЧТовары = Объект.ТоварныеКатегории.Добавить();
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧТовары, СтрокаТоваров);
		
		СтрокаТЧТовары.СуммаБезСкидки = СтрокаТЧТовары.Цена * СтрокаТЧТовары.Количество;
		
	КонецЦикла;
	
	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
	ЗаполнитьПредплатуПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура BG_СтатусПриИзмененииПосле(Элемент)
	УстановитьВидимостьЭлементовПоОперацииСервер();
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварныеКатегорииКоличествоУпаковокПриИзмененииПосле(Элемент)
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Этаформа.Объект);
	
	ТекущаяСтрока = Элементы.ТоварныеКатегории.ТекущиеДанные;
	СтруктураДействий = Новый Структура;	
	
	ТекущаяСтрока.Количество = ТекущаяСтрока.КоличествоУпаковок;
	ТекущаяСтрока.Цена 		 = ?(ТекущаяСтрока.Количество=0, ТекущаяСтрока.СуммаБезСкидки, ТекущаяСтрока.СуммаБезСкидки/ТекущаяСтрока.Количество);
	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	ТекущаяСтрока.СуммаРучнойСкидки = ТекущаяСтрока.СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки / 100;
    ТекущаяСтрока.СуммаИнвойс = ТекущаяСтрока.СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
	ТекущаяСтрока.ЦенаИнвойс = ?(ТекущаяСтрока.Количество=0, ТекущаяСтрока.СуммаИнвойс, ТекущаяСтрока.СуммаИнвойс/ТекущаяСтрока.Количество);
	ТекущаяСтрока.Цена  = ?(ТекущаяСтрока.Количество=0, ТекущаяСтрока.Сумма, ТекущаяСтрока.Сумма/ТекущаяСтрока.Количество);
    
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	ТекущаяСтрока.СуммаСНДС  = ТекущаяСтрока.Сумма;

	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварныеКатегорииПослеУдаленияПосле(Элемент)
	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварныеКатегорииПриИзмененииПосле(Элемент)
	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
	
	Для Каждого СтрокаКатегорий ИЗ Объект.ТоварныеКатегории Цикл
		
		СуммаТоваров = 0;
		ДанныеВТоварах = ТоварныеКатегорииТоваров.НайтиСтроки(Новый Структура("ТоварнаяКатегория, ЧастьКоллекции", СтрокаКатегорий.ТоварнаяКатегория, СтрокаКатегорий.ЧастьКоллекции));
		
		Для Каждого СтрокаТовара ИЗ ДанныеВТоварах Цикл
			СуммаТоваров = СуммаТоваров + СтрокаТовара.Сумма;
		КонецЦикла;
		
		Если НЕ СтрокаКатегорий.Отменено Тогда
			СтрокаКатегорий.СуммаТоваров = СуммаТоваров;
			СтрокаКатегорий.Разница 	 = СтрокаКатегорий.Сумма - СуммаТоваров;
		КонецЕсли;
		
		
	КонецЦикла;
	
	ЗаполнитьПредплатуПоДокументу();
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварныеКатегорииПриНачалеРедактированияПосле(Элемент, НоваяСтрока, Копирование)
	ТекущаяСтрока = Элементы.ТоварныеКатегории.ТекущиеДанные;
	ТекущаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварныеКатегорииПроцентРучнойСкидкиПриИзмененииПосле(Элемент)
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Этаформа.Объект);
	ТекущаяСтрока = Элементы.ТоварныеКатегории.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	
	ТекущаяСтрока.СуммаРучнойСкидки = ТекущаяСтрока.СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки / 100;
	ТекущаяСтрока.СуммаИнвойс = ТекущаяСтрока.СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки; 
	ТекущаяСтрока.ЦенаИнвойс = ТекущаяСтрока.СуммаИнвойс / ТекущаяСтрока.Количество;
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	ТекущаяСтрока.СуммаСНДС  = ТекущаяСтрока.Сумма;

	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварныеКатегорииСуммаБезСкидкиПриИзмененииПосле(Элемент)
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Этаформа.Объект);
	ТекущаяСтрока 			= Элементы.ТоварныеКатегории.ТекущиеДанные;
	
	//ТекущаяСтрока.Цена 		= ?(ТекущаяСтрока.Количество=0, ТекущаяСтрока.СуммаБезСкидки, ТекущаяСтрока.СуммаБезСкидки/ТекущаяСтрока.Количество);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	
	ТекущаяСтрока.СуммаРучнойСкидки = ТекущаяСтрока.СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки / 100;
    ТекущаяСтрока.СуммаИнвойс = ТекущаяСтрока.СуммаБезСкидки  - ТекущаяСтрока.СуммаРучнойСкидки;
	ТекущаяСтрока.ЦенаИнвойс = ТекущаяСтрока.СуммаИнвойс  / ТекущаяСтрока.Количество;
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

	ТекущаяСтрока.СуммаСНДС  = ТекущаяСтрока.Сумма;

	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварныеКатегорииСуммаПриИзмененииПосле(Элемент)
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Этаформа.Объект);
	ТекущаяСтрока = Элементы.ТоварныеКатегории.ТекущиеДанные;
	
	СтруктураЗаполненияЦены = Новый Структура;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВЗакупках", СтруктураЗаполненияЦены);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварныеКатегорииСуммаРучнойСкидкиПриИзмененииПосле(Элемент)
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Этаформа.Объект);
	ТекущаяСтрока = Элементы.ТоварныеКатегории.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	Если ТекущаяСтрока.СуммаБезСкидки <> 0 Тогда
		ТекущаяСтрока.ПроцентРучнойСкидки =  ТекущаяСтрока.СуммаРучнойСкидки * 100 / ТекущаяСтрока.СуммаБезСкидки;	
	КонецЕсли;
	ТекущаяСтрока.СуммаИнвойс = ТекущаяСтрока.СуммаБезСкидки  - ТекущаяСтрока.СуммаРучнойСкидки;
	ТекущаяСтрока.ЦенаИнвойс = ТекущаяСтрока.СуммаИнвойс  / ТекущаяСтрока.Количество;

    ТекущаяСтрока.СуммаСНДС  = ТекущаяСтрока.Сумма;

	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварныеКатегорииЦенаПриИзмененииПосле(Элемент)
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Этаформа.Объект);
	ТекущаяСтрока = Элементы.ТоварныеКатегории.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура BG_ФотоПослеНаСервере()
	Запрос = Новый запрос();
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ВложенныйЗапрос.ЗначениеРазмер,
	               |	ВложенныйЗапрос.ЗначениеДляСортировки КАК ЗначениеДляСортировки,
	               |	ВложенныйЗапрос.Характеристика,
	               |	ВложенныйЗапрос.ЗначениеЦвет КАК ЗначениеЦвет
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |		ВложенныйЗапрос.ЗначениеРазмер КАК ЗначениеРазмер,
	               |		ЕСТЬNULL(ВложенныйЗапрос.ЗначениеДляСортировки, 0) КАК ЗначениеДляСортировки,
	               |		ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	               |		ВложенныйЗапрос1.Значение КАК ЗначениеЦвет
	               |	ИЗ
	               |		Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |				ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	               |				ВЫБОР
	               |					КОГДА Пол.Значение = &Жен
	               |							И НомГруппа.Значение В ИЕРАРХИИ (&ОбувьРодитель)
	               |						ТОГДА Размер.Значение.ДляСортировкиЖен
	               |					ИНАЧЕ Размер.Значение.ДляСортировки
	               |				КОНЕЦ КАК ЗначениеДляСортировки,
	               |				Размер.Значение КАК ЗначениеРазмер
	               |			ИЗ
	               |				Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	               |					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |						НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка,
	               |						НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |					ИЗ
	               |						Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |					ГДЕ
	               |						НоменклатураДополнительныеРеквизиты.Свойство = &СвойствоПол) КАК Пол
	               |					ПО ПриобретениеТоваровУслугТовары.Номенклатура = Пол.Ссылка
	               |					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |						ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК Ссылка,
	               |						ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение КАК Значение
	               |					ИЗ
	               |						Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	               |					ГДЕ
	               |						ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &СвойствоРазмер) КАК Размер
	               |					ПО ПриобретениеТоваровУслугТовары.Характеристика = Размер.Ссылка
	               |					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |						НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка,
	               |						НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |					ИЗ
	               |						Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |					ГДЕ
	               |						НоменклатураДополнительныеРеквизиты.Свойство = &СвойствоНомГруппа) КАК НомГруппа
	               |					ПО ПриобретениеТоваровУслугТовары.Номенклатура = НомГруппа.Ссылка
	               |			ГДЕ
	               |				ПриобретениеТоваровУслугТовары.Ссылка = &ПоступлениеСсылка) КАК ВложенныйЗапрос
	               |			ПО ПриобретениеТоваровУслугТовары.Номенклатура = ВложенныйЗапрос.Номенклатура
	               |				И ПриобретениеТоваровУслугТовары.Характеристика = ВложенныйЗапрос.Характеристика
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |				ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	               |				Цвет.Значение КАК Значение
	               |			ИЗ
	               |				Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	               |					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |						ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК Ссылка,
	               |						ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение КАК Значение
	               |					ИЗ
	               |						Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	               |					ГДЕ
	               |						ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &СвойствоЦвет) КАК Цвет
	               |					ПО ПриобретениеТоваровУслугТовары.Характеристика = Цвет.Ссылка
	               |			ГДЕ
	               |				ПриобретениеТоваровУслугТовары.Ссылка = &ПоступлениеСсылка) КАК ВложенныйЗапрос1
	               |			ПО ПриобретениеТоваровУслугТовары.Номенклатура = ВложенныйЗапрос1.Номенклатура
	               |				И ПриобретениеТоваровУслугТовары.Характеристика = ВложенныйЗапрос1.Характеристика
	               |	ГДЕ
	               |		ПриобретениеТоваровУслугТовары.Ссылка = &ПоступлениеСсылка) КАК ВложенныйЗапрос
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура,
	               |	ЗначениеЦвет,
	               |	ЗначениеДляСортировки";
	Запрос.УстановитьПараметр("СвойствоЦвет"  , ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Цвет"));
	Запрос.УстановитьПараметр("СвойствоНомГруппа"  , ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Номенклатурная группа"));
	Запрос.УстановитьПараметр("СвойствоРазмер", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Размер1"));			 				
	Запрос.УстановитьПараметр("СвойствоПол"   , ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Пол"));			 					
	Запрос.УстановитьПараметр("Жен"   , Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Женский"));	
	Запрос.УстановитьПараметр("ОбувьРодитель"   , Справочники.НоменклатурныеГруппыБабочка.НайтиПоНаименованию("Женская обувь (Woman shoes)"));		
	Запрос.УстановитьПараметр("ПоступлениеСсылка", объект.Ссылка);
	Результат=	Запрос.Выполнить().Выбрать();
	ТекущаяНоменклатура=Неопределено;
	ТекущийЦветНоменклатуры=Неопределено;	
	
	ПоискФлаг=Ложь;
	Пока Результат.Следующий() Цикл

		Если не (ТекущаяНоменклатура=Результат.номенклатура и ТекущийЦветНоменклатуры=Результат.ЗначениеЦвет) тогда
			
			ТекущаяНоменклатура=Результат.номенклатура;	
	        ТекущийЦветНоменклатуры=Результат.ЗначениеЦвет;				
			
			ПараметрыОтбора = Новый Структура;		
			ПараметрыОтбора.Вставить("Номенклатура", Результат.Номенклатура);
			ПараметрыОтбора.Вставить("Характеристика", Результат.Характеристика);		
			НайденныеСтроки = объект.Товары.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество()>0 Тогда
				НайденныеСтроки[0].Фотографируем=Истина;
				ПоискФлаг=Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если не	ПоискФлаг тогда
	     сообщить("Ничего не найдено!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура BG_ФотоПосле(Команда)
	BG_ФотоПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура BG_СортироватьПослеНаСервере()
	Для Каждого стр Из Объект.Товары Цикл
		Цвет1 = стр.Характеристика.ДополнительныеРеквизиты.Найти(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Цвет"),"Свойство");
		Если Цвет1 <> Неопределено Тогда 
			стр.Цвет = Цвет1.Значение;
		Иначе
			стр.Цвет = "";
		КонецЕсли;
		Размер1 = стр.Характеристика.ДополнительныеРеквизиты.Найти(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Размер1"),"Свойство");
		Если Размер1 <> Неопределено Тогда
			стр.Размер = Размер1.Значение;
		Иначе
			стр.Размер = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура BG_СортироватьПосле(Команда)
	
	BG_СортироватьПослеНаСервере();
	Объект.Товары.Сортировать("Номенклатура,Цвет,Размер");
КонецПроцедуры

&НаКлиенте
Процедура BG_ДатаCMRПриИзмененииПосле(Элемент)
	Для Каждого стр Из Объект.ЭтапыГрафикаОплаты Цикл
		стр.ДатаПлатежа = Объект.ДатаCMR;
	КонецЦикла;
	Объект.Дата = Объект.ДатаCMR;
	//Объект.ДатаПлатежа = Объект.ДатаCMR;
КонецПроцедуры

&НаКлиенте
Процедура BG_ЗаполнитьДополнительныеРеквизитыПосле(Команда)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьДополнительныеРеквизитыЗавершение", ЭтотОбъект), "Для вызова обработки необходимо записать документ. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьДополнительныеРеквизитыФрагмент();
	Конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДополнительныеРеквизитыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	Если Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
		ЗаполнитьДополнительныеРеквизитыФрагмент();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДополнительныеРеквизитыФрагмент()
	
	ПараметрыОбработки = Новый Структура("Документ", Объект.Ссылка);
	
	ОткрытьФорму("Обработка.ЗаполнениеДополнительныхРеквизитовНовый.Форма", ПараметрыОбработки, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура BG_ПолучитьТоварыИзХранилищаЗагрузкаАрмани(АдресТоваровВХранилище)
	baВсегдаДобавлятьНовыеСтроки=Истина;
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтаФорма);
	СтруктураДействий.Удалить("ОчиститьСуммуВзаиморасчетов");
	СтруктураДействий.Удалить("ПересчитатьСуммуСверхЗаказа");
	КэшированныеЗначения = Неопределено;
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	СтруктураПоискаТоваровЗаказа = Новый Структура("КодСтроки,ЗаказПоставщику,Серия");
	СтруктураПоискаТоваровНакладной = Новый Структура("НомерСтроки");
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		
		Если СтрокаТоваров.КодСтроки<>0 И ЗначениеЗаполнено(СтрокаТоваров.ЗаказПоставщику) Тогда
			СтруктураПоискаТоваровЗаказа.КодСтроки = СтрокаТоваров.КодСтроки;
			СтруктураПоискаТоваровЗаказа.ЗаказПоставщику = СтрокаТоваров.ЗаказПоставщику;
			СтруктураПоискаТоваровЗаказа.Серия = СтрокаТоваров.Серия;
			МассивСтрокТЧТовары = Объект.Товары.НайтиСтроки(СтруктураПоискаТоваровЗаказа);
		Иначе
			СтруктураПоискаТоваровНакладной.НомерСтроки = СтрокаТоваров.НомерСтроки;
			МассивСтрокТЧТовары = Объект.Товары.НайтиСтроки(СтруктураПоискаТоваровНакладной);
		КонецЕсли;
		
		// Андрей Ринг
		Если baВсегдаДобавлятьНовыеСтроки Тогда
			
			СтрокаТЧТовары = Объект.Товары.Добавить();
		// Андрей Ринг
		ИначеЕсли МассивСтрокТЧТовары.Количество() = 0 Тогда
			
			СтрокаТЧТовары = Объект.Товары.Добавить();
			
		ИначеЕсли МассивСтрокТЧТовары.Количество() = 1 Тогда
			
			СтрокаТЧТовары = МассивСтрокТЧТовары[0];
			
		ИначеЕсли МассивСтрокТЧТовары.Количество() > 1 Тогда
			
			Для Каждого СтрокаКУдалению Из МассивСтрокТЧТовары Цикл
				
				Объект.Товары.Удалить(СтрокаКУдалению);
				
			КонецЦикла;
			
			СтрокаТЧТовары = Объект.Товары.Добавить();
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧТовары, СтрокаТоваров);
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧТовары, СтруктураДействий, КэшированныеЗначения);
		Если НЕ ИспользоватьПоступлениеПоНесколькимЗаказам 
			И ЗначениеЗаполнено(СтрокаТЧТовары.ЗаказПоставщику) 
			И Объект.ЗаказПоставщику <> СтрокаТЧТовары.ЗаказПоставщику Тогда
			
			Объект.ЗаказПоставщику = СтрокаТЧТовары.ЗаказПоставщику;
			
		КонецЕсли;
	КонецЦикла;
	
	// Андрей Ринг
	ЗаполнитьПолеПеремещаемИзЗаказа();
	// Андрей Ринг
	
	СтруктураНаименованийТабличныхЧастей = Новый Структура("Товары");
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(СтруктураНаименованийТабличныхЧастей);
	ЗаполнитьПризнакСписанияНаРасходыДляУслуг();
	ЗаполнитьСтатусыУказанияСерийСервер();
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	СтруктураДействий.Вставить("ПересчитатьСуммуСверхЗаказа", Новый Структура("РеализацияПоступлениеПоЗаказу, ТребуетсяЗалогЗаТару",
		Объект.ПоступлениеПоЗаказам, Объект.ТребуетсяЗалогЗаТару));
		
	// Андрей Ринг. Если меняют количество в подборе, не пересчитывется сумма?!
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Этаформа.Объект);
	
	СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	СтруктураДействий.Вставить("ПересчитатьСуммуСверхЗаказа", Новый Структура("РеализацияПоступлениеПоЗаказу, ТребуетсяЗалогЗаТару",
		Объект.ПоступлениеПоЗаказам, Объект.ТребуетсяЗалогЗаТару));
		
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	// Андрей Ринг
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, Неопределено);
	
	МногооборотнаяТараСервер.ОбновитьПризнакБезВозвратнойТары(Объект.Товары, Объект.ВернутьМногооборотнуюТару);
	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
	
	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
	ВзаиморасчетыКлиентСервер.ОбновитьТекстГиперссылкиВалюты(ЭтаФорма);
	
	ЗаполнитьЦеныНоменклатурыЗаказов();
	ПриИзмененииСкладаВТабличнойЧастиСервер();
	
	ОбновитьИнформациюПоЗаказам();
	Объект.ПоступлениеПоЗаказам = ЗначениеЗаполнено(Объект.ЗаказПоставщику) ИЛИ СписокЗаказов.Количество() > 0;
	ОбновитьОтклоненияОтЗаказа();
	
	ВзаиморасчетыСервер.ПриИзмененииПараметровМеханизма(ЭтотОбъект);
	УстановитьВидимостьКомандПоЗаказу();
	ВзаиморасчетыСервер.ФормаПриИзмененииРеквизитов(ЭтотОбъект, "ПоступлениеПоЗаказам");
	
КонецПроцедуры


&НаКлиенте
&Вместо("ПодборТоваровИзЗаказа")
Процедура BG_ПодборТоваровИзЗаказа()
	
	Попытка
		ЗаблокироватьДанныеФормыДляРедактирования();
		Модифицированность = Истина;
	Исключение
		ПоказатьПредупреждение(,КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	МассивКодовСтрок = Новый Массив;
	АдресТоваров = "";
	
	ПередПодборомТоваровИзЗаказаСервер(МассивКодовСтрок, АдресТоваров);

	ПараметрыПодбора = Новый Структура();
	ПараметрыПодбора.Вставить("ЗаказПоставщику", Объект.ЗаказПоставщику);
	ПараметрыПодбора.Вставить("ВалютаДокумента", Объект.Валюта);
	ПараметрыПодбора.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыПодбора.Вставить("Дата", Объект.Дата);
	ПараметрыПодбора.Вставить("Склад", Объект.Склад);
	ПараметрыПодбора.Вставить("МассивКодовСтрок", МассивКодовСтрок);
	ПараметрыПодбора.Вставить("Партнер", Объект.Партнер);
	ПараметрыПодбора.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыПодбора.Вставить("Договор", Объект.Договор);
	ПараметрыПодбора.Вставить("Организация", Объект.Организация);
	ПараметрыПодбора.Вставить("ХозяйственнаяОперация", Объект.ХозяйственнаяОперация);
	ПараметрыПодбора.Вставить("Соглашение", Объект.Соглашение);
	ПараметрыПодбора.Вставить("ВалютаВзаиморасчетов", Объект.ВалютаВзаиморасчетов);
	
	//В ПТиУ с хоз операцией "Импорт" не проставляется налогообложение НДС
	Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка") Тогда
		ПараметрыПодбора.Вставить("НалогообложениеНДС", ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС"));
	Иначе
		ПараметрыПодбора.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
	ПараметрыПодбора.Вставить("ПорядокРасчетов", Объект.ПорядокРасчетов);
	ПараметрыПодбора.Вставить("ВернутьМногооборотнуюТару", Объект.ВернутьМногооборотнуюТару);
	ПараметрыПодбора.Вставить("ТребуетсяЗалогЗаТару", Объект.ТребуетсяЗалогЗаТару);
	ПараметрыПодбора.Вставить("НаправлениеДеятельности", Объект.НаправлениеДеятельности);
	ПараметрыПодбора.Вставить("АдресТоварыНакладнойВоВременномХранилище", АдресТоваров);
	ПараметрыПодбора.Вставить("ОрдернаяСхемаПриПриемке", ОрдернаяСхемаПриПриемке);
	ПараметрыПодбора.Вставить("ПоступлениеПоЗаказам", Объект.ПоступлениеПоЗаказам);
	ПараметрыПодбора.Вставить("ВариантПриемкиТоваров", Объект.ВариантПриемкиТоваров);
	ПараметрыПодбора.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыПодбора.Вставить("ГруппаФинансовогоУчета", Объект.ГруппаФинансовогоУчета);
	
	ОткрытьФорму(
		"Обработка.ЖурналДокументовЗакупки.Форма.ФормаПодбораТоваровИзЗаказа",
		ПараметрыПодбора,
		ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры


&НаКлиенте
&Перед("ПоступлениеПоЗаказамПриИзменении")
Процедура BG_ПоступлениеПоЗаказамПриИзменении(Элемент)
	
	//В ПТиУ с хоз операцией "Импорт" не проставляется налогообложение НДС
	Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка") Тогда
		Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС");
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура BG_УстановитьНомерНакладнойПослеНаСервере(МассивСтрок)
    
    	
    Для Каждого НомерСтроки Из МассивСтрок Цикл
        СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
        СтрокаТЧ.Накладная  = Накладная; 
    КонецЦикла;
			
КонецПроцедуры


&НаКлиенте
Процедура BG_УстановитьНомерНакладнойПосле(Команда)
    
    ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	Если Объект.Товары.Количество() = 0 Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'В списке ""Товары"" не выделено ни одной строки.'"));
		Возврат;
	конецесли;
		
	BG_УстановитьНомерНакладнойПослеНаСервере(ВыделенныеСтроки); 
    
    Модифицированность = Истина;
    
КонецПроцедуры


&НаКлиенте
Процедура BG_СоздатьПоступление_ПереопределениеПосле(Команда)
	
	ИмяФормыПоступление = "Документ.ПоступлениеТоваровНаСклад.ФормаОбъекта";
	ПараметрыЗаполнения = Новый Структура("Основание", ПолучитьДанные(ЭтотОбъект.Объект.Ссылка));
	ОткрытьФорму(ИмяФормыПоступление, ПараметрыЗаполнения, ЭтаФорма);
	
КонецПроцедуры

Функция ПолучитьДанные(ПараметрКоманды)
	
	Основание = Новый Структура;
	Основание.Вставить("ДокументОснование", ПараметрКоманды);
	Основание.Вставить("СкладПоступления", ПараметрКоманды.Склад);
	Основание.Вставить("ХозяйственнаяОперацияПриемки", Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути);
	
	Основание.Вставить("ЗаполнятьПоНакладной", Истина);
	
	Возврат Основание;
КонецФункции


&НаСервере
&После("ЗаполнитьСлужебныеРеквизитыПоНоменклатуре")
Процедура BG_ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(СтруктураНаименованийТабличныхЧастей)
	
	Если СтруктураНаименованийТабличныхЧастей.Свойство("Товары") Тогда
		Для Каждого СтрокаТЧ Из Объект.Товары Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.Характеристика) Тогда
				СтрокаТЧ.КодЦвета = ПолучитьКодЦвета(СтрокаТЧ.Характеристика);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКодЦвета(Характеристика)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение КАК Значение
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
		|ГДЕ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка = &Характеристика
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Имя = &Имя";
	
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Имя", "КодЦвета");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции


&НаСервере
Процедура BG_ЗаполнитьСуммуИнвойсПоЗакакуПослеНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Количество КАК Количество,
		|	Товары.КодСтроки КАК КодСтроки,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.ЗаказПоставщику КАК ЗаказПоставщику
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.КодСтроки КАК КодСтроки,
		|	ЕСТЬNULL(ЗаказПоставщикуТовары.ЦенаИнвойс, 0) КАК ЦенаИнвойс,
		|	ЕСТЬNULL(ЗаказПоставщикуТовары.ЦенаИнвойс, 0) * ВТТовары.Количество КАК СуммаИнвойс
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|		ПО ВТТовары.Номенклатура = ЗаказПоставщикуТовары.Номенклатура
		|			И ВТТовары.Характеристика = ЗаказПоставщикуТовары.Характеристика
		|			И ВТТовары.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить(,"Номенклатура,Характеристика,ЗаказПоставщику,Количество,КодСтроки"));
	
	ТЗЦеныПредЗаказа = Запрос.Выполнить().Выгрузить();
	ТЗЦеныПредЗаказа.Индексы.Добавить("КодСтроки");
	
	Для каждого СтрокаТЧ Из Объект.Товары Цикл   
		
		НайденнаяСтрока = ТЗЦеныПредЗаказа.Найти(СтрокаТЧ.КодСтроки, "КодСтроки");
		Если НайденнаяСтрока <> Неопределено Тогда
			СтрокаТЧ.ЦенаИнвойс  = НайденнаяСтрока.ЦенаИнвойс;		
			СтрокаТЧ.СуммаИнвойс = НайденнаяСтрока.СуммаИнвойс;
		КонецЕсли;
			
	КонецЦикла; 
КонецПроцедуры


&НаКлиенте
Процедура BG_ЗаполнитьСуммуИнвойсПоЗакакуПосле(Команда)
	BG_ЗаполнитьСуммуИнвойсПоЗакакуПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварыЦенаИнвойсПриИзмененииПосле(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;  
	Сумма = ТекущаяСтрока.ЦенаИнвойс * ТекущаяСтрока.Количество;
	ТекущаяСтрока.СуммаРучнойСкидки = Сумма * ТекущаяСтрока.ПроцентРучнойСкидки / 100;
	ТекущаяСтрока.СуммаИнвойс = Сумма - ТекущаяСтрока.СуммаРучнойСкидки;
	
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Сумма = ТекущаяСтрока.ЦенаИнвойс * ТекущаяСтрока.Количество;
	ТекущаяСтрока.СуммаРучнойСкидки = Сумма * ТекущаяСтрока.ПроцентРучнойСкидки / 100;
	ТекущаяСтрока.СуммаИнвойс = Сумма - ТекущаяСтрока.СуммаРучнойСкидки; 

КонецПроцедуры

&НаКлиенте
Процедура НазначитьРучнуюСкидкуДляВыделенныхСтрокИнвойс(Команда)

	Если Не СкидкиНаценкиКлиент.ВозможноНазначениеРучнойСкидкиНаценки(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		Возврат;
	КонецЕсли;

	АдресВоВременномХранилище = АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилищеИнвойс(Истина);
	
	Оповещение = Новый ОписаниеОповещения(
		"НазначитьРучнуюСкидкуДляВыделенныхСтрокЗавершениеИнвойс", 
		ЭтотОбъект, 
		Новый Структура("АдресВоВременномХранилище", АдресВоВременномХранилище));
	
	СкидкиНаценкиКлиент.ОткрытьФормуНазначенияРучныхСкидок(
		АдресВоВременномХранилище,
		Объект.Валюта,
		Оповещение,
		Истина);
		
		Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Функция АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилищеИнвойс(ТолькоВыделенныеСтроки)
	
	Возврат Б_РегламентныеЗаданияСервер.АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилищеЗакупкиИнвойс(ЭтаФорма, "Товары", УникальныйИдентификатор, ТолькоВыделенныеСтроки);
	
КонецФункции

&НаКлиенте
Процедура НазначитьРучнуюСкидкуДляВыделенныхСтрокЗавершениеИнвойс(СуммаРучнойСкидкиНаценки, ДополнительныеПараметры) Экспорт 
	
	АдресВоВременномХранилище = ДополнительныеПараметры.АдресВоВременномХранилище;
	
	Если СуммаРучнойСкидкиНаценки <> Неопределено Тогда
		
		НазначитьРучнуюСкидкуНаСервереИнвойс(СуммаРучнойСкидкиНаценки, Элементы.Товары.ВыделенныеСтроки, АдресВоВременномХранилище);
		
        СкидкиНаценкиКлиент.ОповеститьОбОкончанииНазначенияРучныхСкидокНаценок(СуммаРучнойСкидкиНаценки, Объект.Валюта);
		
		ВзаиморасчетыКлиентСервер.ОбновитьТекстГиперссылкиВалюты(ЭтаФорма);
				
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НазначитьРучнуюСкидкуНаСервереИнвойс(СуммаСкидкиНаценки, Знач ВыделенныеСтроки, АдресВоВременномХранилище)
	
	ПараметрыСкидки = Новый Структура();
	ПараметрыСкидки.Вставить("ИспользуютсяАвтоматическиеСкидки", Ложь);
	ПараметрыСкидки.Вставить("РассчитыватьСуммуСНДС", Истина);
	ПараметрыСкидки.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	ПараметрыСкидки.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
	
	Б_РегламентныеЗаданияСервер.НазначитьРучнуюСкидкуИнвойс(Объект, "Товары", СуммаСкидкиНаценки, ПараметрыСкидки);
	
КонецПроцедуры


&НаКлиенте
Процедура BG_ОтменитьРучныеСкидкиИнвойсПосле(Команда)
	
	Если Не СкидкиНаценкиКлиент.ВозможнаОтменаРучныхСкидокНаценок(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		
		СтрокаТЧ.ПроцентРучнойСкидки = 0;
		СтрокаТЧ.СуммаРучнойСкидки = 0;
		СтрокаТЧ.СуммаИнвойс = СтрокаТЧ.ЦенаИнвойс * СтрокаТЧ.Количество;
		
	КонецЦикла; 
	
	СкидкиНаценкиКлиент.ОповеститьОбОкончанииНазначенияРучныхСкидокНаценок();
	
	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
	ВзаиморасчетыКлиентСервер.ОбновитьТекстГиперссылкиВалюты(ЭтаФорма);
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура BG_СкопироватьНезаполненныеСуммыИнвойсПоПрайсЛистуПосле(Команда)
	
	Для каждого СтрокаТЧ Из Объект.Товары Цикл   
		Если СтрокаТЧ.СуммаИнвойс = 0 
			ИЛИ СтрокаТЧ.ЦенаИнвойс = 0 Тогда
			СтрокаТЧ.ЦенаИнвойс = СтрокаТЧ.Цена;
			СтрокаТЧ.СуммаРучнойСкидки = СтрокаТЧ.Цена * СтрокаТЧ.Количество * СтрокаТЧ.ПроцентРучнойСкидки / 100;
			СтрокаТЧ.СуммаИнвойс = СтрокаТЧ.Цена * СтрокаТЧ.Количество - СтрокаТЧ.СуммаРучнойСкидки;
	    КонецЕсли;
	КонецЦикла;  
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаСервере
Процедура BG_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ЗаполнитьКолонкуСуммаБЕЗНДС();
КонецПроцедуры

Процедура ЗаполнитьКолонкуСуммаБЕЗНДС() 
	
	НДСВключен = Объект.ЦенаВключаетНДС;
	
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		//СтрокаТЧ.СуммаБезНДС = ?(НДСВключен, СтрокаТЧ.СуммаСНДС - СтрокаТЧ.СуммаНДС, СтрокаТЧ.СуммаСНДС + СтрокаТЧ.СуммаНДС); 		
		СтрокаТЧ.СуммаБезНДС = СтрокаТЧ.СуммаСНДС - СтрокаТЧ.СуммаНДС; 		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("РазбитьСтрокуФактЗавершение")
Процедура ba_РазбитьСтрокуФактЗавершение(НоваяСтрока, ДополнительныеПараметры)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	Если НоваяСтрока <> Неопределено Тогда

		СтруктураДействий = Новый Структура;
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтаФорма);

		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);

		РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
		#Вставка
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество; 
		ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Сумма; 
		НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
		НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма; 
		
		Сумма = ТекущаяСтрока.ЦенаИнвойс * ТекущаяСтрока.Количество;
		ТекущаяСтрока.СуммаРучнойСкидки = Сумма * ТекущаяСтрока.ПроцентРучнойСкидки / 100;
		ТекущаяСтрока.СуммаИнвойс = Сумма - ТекущаяСтрока.СуммаРучнойСкидки;
		
		Сумма = ТекущаяСтрока.ЦенаИнвойс * НоваяСтрока.Количество;
		НоваяСтрока.СуммаРучнойСкидки = Сумма * НоваяСтрока.ПроцентРучнойСкидки / 100;
		НоваяСтрока.СуммаИнвойс = Сумма - НоваяСтрока.СуммаРучнойСкидки;
        #КонецВставки
	КонецЕсли;

	УчетПрослеживаемыхТоваровКлиентСерверЛокализация.РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры);

	ОбновитьЗависимыеРеквизитыФормыПоЗаказу(
	Объект.Товары,
	НадписьРасхождениеЗаказ, 
	Элементы.КартинкаРасхождениеЗаказ,
	Элементы.КартинкаРасхождениеЗаказы);

КонецПроцедуры

&НаКлиенте
Процедура ba_ТоварыСуммаПриИзмененииВместо(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ТекущаяСтрока.Цена = ?(ТекущаяСтрока.КоличествоУпаковок <> 0, ТекущаяСтрока.Сумма / ТекущаяСтрока.КоличествоУпаковок, 0); 
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	ОбновитьОтклоненияОтЗаказаВСтроке(ТекущаяСтрока, Объект.ПоступлениеПоЗаказам, Объект.ТребуетсяЗалогЗаТару);
	
	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ba_ТоварыСуммаРучнойСкидкиПриИзмененииВместо(Элемент) 
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма); 
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	Сумма = ТекущаяСтрока.ЦенаИнвойс * ТекущаяСтрока.Количество;
	
	ТекущаяСтрока.СуммаИнвойс = Сумма - ТекущаяСтрока.СуммаРучнойСкидки;
	Если Сумма <> 0 Тогда
		ТекущаяСтрока.ПроцентРучнойСкидки =  ТекущаяСтрока.СуммаРучнойСкидки * 100 / Сумма;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ba_ТоварыЦенаПриИзмененииВместо(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	ОбновитьОтклоненияОтЗаказаВСтроке(ТекущаяСтрока, Объект.ПоступлениеПоЗаказам, Объект.ТребуетсяЗалогЗаТару);
	
	РассчитатьИтоговыеПоказателиПоступления(ЭтаФорма);
	
	Если Объект.ПоступлениеПоЗаказам Тогда
		ОбновитьНадписьОтклоненийОтЦенЗаказа();
	КонецЕсли;

КонецПроцедуры



