
Функция ОсновнаяЧастьОтчета(ТабДок,Макет,НачалоПериода, КонецПериода, Знач Подразделение, рисунокБ = ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	         
	со = ?(подразделение.ДополнительныеРеквизиты.Найти(планывидовхарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СО оплата"),"Свойство")=неопределено, ложь, 
	подразделение.ДополнительныеРеквизиты.Найти(планывидовхарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СО оплата"),"Свойство").значение);
	ПС = ?(подразделение.ДополнительныеРеквизиты.Найти(планывидовхарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ПС"),"Свойство")=неопределено, ложь,
	подразделение.ДополнительныеРеквизиты.Найти(планывидовхарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ПС"),"Свойство").значение);
	Предоплата = ?(подразделение.ДополнительныеРеквизиты.Найти(планывидовхарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Предоплата"),"Свойство")=неопределено, ложь, 
	подразделение.ДополнительныеРеквизиты.Найти(планывидовхарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Предоплата"),"Свойство").значение);
	Постоплата = ?(подразделение.ДополнительныеРеквизиты.Найти(планывидовхарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Постоплата"),"Свойство")=неопределено, ложь, 
	подразделение.ДополнительныеРеквизиты.Найти(планывидовхарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Постоплата"),"Свойство").значение);
	Банк = ?(подразделение.ДополнительныеРеквизиты.Найти(планывидовхарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Банк"),"Свойство")=неопределено, ложь, 
	подразделение.ДополнительныеРеквизиты.Найти(планывидовхарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Банк"),"Свойство").значение);
	БанкИМ = ?(подразделение.ДополнительныеРеквизиты.Найти(планывидовхарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Банк ИМ"),"Свойство")=неопределено, ложь, 
	подразделение.ДополнительныеРеквизиты.Найти(планывидовхарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Банк ИМ"),"Свойство").значение);
	
	ВидЗаказаМТМ = перечисления.ВидыЗаказов.МТМ;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктураПредприятия.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|	СтруктураПредприятия.Ссылка В ИЕРАРХИИ(&Подразделение)";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	ВсеГруппы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	//ВсеГруппы.Добавить(Подразделение);
	
	Подразделение = ВсеГруппы;	
	
	КассыККМСО = новый СписокЗначений();
	КассыККМ = новый СписокЗначений();
	КассыСО = новый списокзначений();
	КассыККМСО = новый СписокЗначений();
	КассыККМ = новый СписокЗначений();
	запросК = Новый ЗАпрос();
	запроск.Текст = "ВЫБРАТЬ разрешенные
	                |	КассыККМ.Ссылка
	                |ИЗ
	                |	Справочник.КассыККМ КАК КассыККМ
	                |ГДЕ
	                |	КассыККМ.Подразделение в (&Подразделение)
	                |	И НЕ КассыККМ.Ссылка В (&Ссылка)";
	ЗАпроск.УстановитьПараметр("Подразделение", подразделение);
	ЗАпроск.УстановитьПараметр("Ссылка", КассыККМСО);
	выбк = запроск.Выполнить().Выбрать();
	пока выбк.Следующий() цикл
		КассыККМ.Добавить(выбк.Ссылка);	
	конеццикла;

    запросК = Новый ЗАпрос();
    запроск.Текст = "ВЫБРАТЬ
                    |	ДополнительныеСведения.Объект КАК Объект
                    |ИЗ
                    |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
                    |ГДЕ
                    |	ДополнительныеСведения.Свойство = &Свойство
                    |	И ДополнительныеСведения.Значение = истина
                    |	";
    ЗАпроск.УстановитьПараметр("Подразделение", подразделение);
    ЗАпроск.УстановитьПараметр("Свойство", планывидовхарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Касса СО"));
    выбк = запроск.Выполнить().Выбрать();
    пока выбк.Следующий() цикл
    	КассыСО.Добавить(выбк.объект);	
    конеццикла;
    
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассыККМ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КассыККМ КАК КассыККМ
		|ГДЕ
		|	НЕ КассыККМ.СО
		|	И КассыККМ.Подразделение В ИЕРАРХИИ(&Подразделение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КассыККМ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КассыККМ КАК КассыККМ
		|ГДЕ
		|	КассыККМ.СО
		|	И КассыККМ.Подразделение В ИЕРАРХИИ(&Подразделение)";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Пакет = Запрос.ВыполнитьПакет();
	
	Если Пакет.Количество() > 0 Тогда
		КассыККМ.ЗагрузитьЗначения(Пакет[0].Выгрузить().ВыгрузитьКолонку("Ссылка"));
		КассыККМСО.ЗагрузитьЗначения(Пакет[1].Выгрузить().ВыгрузитьКолонку("Ссылка"));
	КонецЕсли;

	если ПС тогда
		Шапка1 = Макет.ПолучитьОбласть("Шапка1|пс");
		Табдок.Присоединить(Шапка1);
	конецесли;

	если со тогда	
		Шапка1 = Макет.ПолучитьОбласть("Шапка1|со");
		Табдок.Присоединить(Шапка1);
	конецесли;
		если Предоплата тогда
		Шапка1 = Макет.ПолучитьОбласть("Шапка1|пред");
		Табдок.Присоединить(Шапка1);
	конецесли;
	если Постоплата тогда
		Шапка1 = Макет.ПолучитьОбласть("Шапка1|пост");
		Табдок.Присоединить(Шапка1);
	конецесли;
	если банк тогда
		Шапка1 = Макет.ПолучитьОбласть("Шапка1|банк");
		Табдок.Присоединить(Шапка1);
	конецесли;
	если банким тогда
		Шапка1 = Макет.ПолучитьОбласть("Шапка1|банким");
		Табдок.Присоединить(Шапка1);
	конецесли;
	
	СтрокаДокументУвсех = Макет.ПолучитьОбласть("СтрокаДокумент|Увсех");
	СтрокаДокументсо = Макет.ПолучитьОбласть("СтрокаДокумент|со");
	СтрокаДокументпс = Макет.ПолучитьОбласть("СтрокаДокумент|пс");
	СтрокаДокументпред = Макет.ПолучитьОбласть("СтрокаДокумент|пред");
	СтрокаДокументпост = Макет.ПолучитьОбласть("СтрокаДокумент|пост");
	СтрокаДокументбанк = Макет.ПолучитьОбласть("СтрокаДокумент|банк");
	СтрокаДокументбанким = Макет.ПолучитьОбласть("СтрокаДокумент|банким");
	СтрокаДетали = Макет.ПолучитьОбласть("СтрокаДетали|Увсех");	
	продажи = Макет.получитьобласть("Продажи|Увсех");
	Возвраты1 = Макет.получитьобласть("Возвраты|Увсех");
	Заказы1 = Макет.получитьобласть("Заказы|Увсех");
	предоплаты = Макет.получитьобласть("предоплаты|Увсех");
	постоплаты= Макет.получитьобласть("постоплаты|Увсех");
	реализации = Макет.получитьобласть("реализации|Увсех");
	возвратысумма = Макет.получитьобласть("ВозвратыОплат|Увсех");
	Сертификаты = Макет.получитьобласть("Сертификаты|Увсех");
	ЗаказыМТМ = Макет.получитьобласть("ЗаказыМТМ|Увсех");
	предоплатыМТМ = Макет.получитьобласть("предоплатыМТМ|Увсех");
	реализацииМТМ = Макет.получитьобласть("реализацииМТМ|Увсех");
	ВозвратПС = Макет.получитьобласть("ВозвратПС|Увсех");
	
	Итогувсех = Макет.ПолучитьОбласть("Итого|Увсех");
	Итогсо = Макет.ПолучитьОбласть("Итого|со");
	Итогпс = Макет.ПолучитьОбласть("Итого|пс");
	Итогпред = Макет.ПолучитьОбласть("Итого|пред");
	Итогпост = Макет.ПолучитьОбласть("Итого|пост");	
	Итогбанк = Макет.ПолучитьОбласть("Итого|банк");
	Итогбанким = Макет.ПолучитьОбласть("Итого|банким");
	
	ИтогПодрувсех = Макет.ПолучитьОбласть("ИтогоПодр|Увсех");
	ИтогПодрсо = Макет.ПолучитьОбласть("ИтогоПодр|со");
	ИтогПодрпс = Макет.ПолучитьОбласть("ИтогоПодр|пс");
	ИтогПодрпред = Макет.ПолучитьОбласть("ИтогоПодр|пред");
	ИтогПодрпост = Макет.ПолучитьОбласть("ИтогоПодр|пост");	
	ИтогПодрбанк = Макет.ПолучитьОбласть("ИтогоПодр|банк");
	ИтогПодрбанким = Макет.ПолучитьОбласть("ИтогоПодр|банким");
	
	ИтогПодрувсех.параметры.итогколво = 0;
	ИтогПодрувсех.параметры.итогсумма = 0;
	ИтогПодрувсех.параметры.итогскидка = 0;
	ИтогПодрувсех.параметры.итогккм = 0;
	ИтогПодрувсех.параметры.итогкк = 0;
	ИтогПодрсо.параметры.итогсо = 0;
	ИтогПодрсо.параметры.итогсоруб = 0;
	ИтогПодрсо.параметры.итогсоевро = 0;
	ИтогПодрсо.параметры.итогсодоллар = 0;
	ИтогПодрпс.параметры.итогпс = 0;
	ИтогПодрпред.параметры.итогпред = 0;
	ИтогПодрпост.параметры.итогпост = 0;
	ИтогПодрувсех.параметры.итогколво = 0;
	ИтогПодрбанк.параметры.итогбанк1 = 0;
	ИтогПодрбанкИМ.параметры.итогбанк= 0;
	ИтогПодрбанкИМ.параметры.итогбанксчет= 0;
	ИтогПодрбанкИМ.параметры.итогбанконлайн= 0;
	ИтогПодрбанкИМ.параметры.итогбанкпони= 0;
	ИтогПодрбанкИМ.параметры.итогбанкпп= 0;
	ИтогПодрувсех.параметры.итогбонус = 0;
	
	
	#Область Чеки
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекККМ.Ссылка КАК Ссылка,
	|	ЧекККМ.Партнер КАК Партнер,
	|	ЧекККМ.СуммаДокумента КАК СуммаДокумента,
	|	0 КАК ПостОплата,
	|	ЧекККМ.ПолученоНаличными КАК ПолученоНаличными,
	|	ЧекККМ.Дата КАК Дата,
	|	ЧекККМ.Ссылка КАК ЧекККМОплата
	|ПОМЕСТИТЬ ЧекККМ
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЧекККМ.КассаККМ В(&КассаККМ)
	|	И ЧекККМ.Статус = &Статус
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМВозврат.Ссылка,
	|	ЧекККМВозврат.Партнер,
	|	-ЧекККМВозврат.СуммаДокумента,
	|	0,
	|	-ЧекККМВозврат.ВыданоНаличными,
	|	ЧекККМВозврат.Дата,
	|	ЧекККМВозврат.ЧекККМ
	|ИЗ
	|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
	|ГДЕ
	|	ЧекККМВозврат.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЧекККМВозврат.КассаККМ В(&КассаККМ)
	|	И ЧекККМВозврат.Статус = &Статус
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекККМТовары.Ссылка КАК Ссылка,
	|	СУММА(ЧекККМТовары.ПроцентРучнойСкидки + ЧекККМТовары.ПроцентАвтоматическойСкидки) КАК скидка,
	|	СУММА(ЧекККМТовары.Количество) КАК Количество,
	|	СУММА(ЧекККМТовары.СуммаБонусныхБалловКСписаниюВВалюте) КАК СуммаБонусныхБалловКСписанию
	|ПОМЕСТИТЬ Тов
	|ИЗ
	|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЧекККМ КАК ЧекККМ
	|		ПО ЧекККМТовары.Ссылка = ЧекККМ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМТовары.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМВозвратТовары.Ссылка,
	|	0,
	|	СУММА(-ЧекККМВозвратТовары.Количество),
	|	СУММА(-ЧекККМВозвратТовары.СуммаБонусныхБалловКСписаниюВВалюте)
	|ИЗ
	|	Документ.ЧекККМВозврат.Товары КАК ЧекККМВозвратТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЧекККМ КАК ЧекККМ
	|		ПО ЧекККМВозвратТовары.Ссылка = ЧекККМ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМВозвратТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекККМПодарочныеСертификаты.Ссылка КАК Ссылка,
	|	СУММА(ЧекККМПодарочныеСертификаты.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ПС
	|ИЗ
	|	Документ.ЧекККМ.ПодарочныеСертификаты КАК ЧекККМПодарочныеСертификаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЧекККМ КАК ЧекККМ
	|		ПО ЧекККМПодарочныеСертификаты.Ссылка = ЧекККМ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМПодарочныеСертификаты.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМВозвратПодарочныеСертификаты.Ссылка,
	|	СУММА(-ЧекККМВозвратПодарочныеСертификаты.Сумма)
	|ИЗ
	|	Документ.ЧекККМВозврат.ПодарочныеСертификаты КАК ЧекККМВозвратПодарочныеСертификаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЧекККМ КАК ЧекККМ
	|		ПО ЧекККМВозвратПодарочныеСертификаты.Ссылка = ЧекККМ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМВозвратПодарочныеСертификаты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекККМОплатаПлатежнымиКартами.Ссылка КАК Ссылка,
	|	СУММА(ЧекККМОплатаПлатежнымиКартами.Сумма) КАК Сумма
	|ПОМЕСТИТЬ КК
	|ИЗ
	|	Документ.ЧекККМ.ОплатаПлатежнымиКартами КАК ЧекККМОплатаПлатежнымиКартами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЧекККМ КАК ЧекККМ
	|		ПО ЧекККМОплатаПлатежнымиКартами.Ссылка = ЧекККМ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМОплатаПлатежнымиКартами.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМВозвратПодарочныеСертификаты.Ссылка,
	|	СУММА(-ЧекККМВозвратПодарочныеСертификаты.Сумма)
	|ИЗ
	|	Документ.ЧекККМВозврат.ОплатаПлатежнымиКартами КАК ЧекККМВозвратПодарочныеСертификаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЧекККМ КАК ЧекККМ
	|		ПО ЧекККМВозвратПодарочныеСертификаты.Ссылка = ЧекККМ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМВозвратПодарочныеСертификаты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекККМВалютнаяОплата.Ссылка КАК Ссылка,
	|	СУММА(ЧекККМВалютнаяОплата.СуммаРуб) КАК СуммаРуб
	|ПОМЕСТИТЬ СОруб
	|ИЗ
	|	Документ.ЧекККМ.ВалютнаяОплата КАК ЧекККМВалютнаяОплата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЧекККМ КАК ЧекККМ
	|		ПО ЧекККМВалютнаяОплата.Ссылка = ЧекККМ.Ссылка
	|ГДЕ
	|	ЧекККМВалютнаяОплата.Валюта = &ВалютаРуб
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМВалютнаяОплата.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМВозвратВалютнаяОплата.Ссылка,
	|	СУММА(-ЧекККМВозвратВалютнаяОплата.СуммаРуб)
	|ИЗ
	|	Документ.ЧекККМВозврат.ВалютнаяОплата КАК ЧекККМВозвратВалютнаяОплата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЧекККМ КАК ЧекККМ
	|		ПО ЧекККМВозвратВалютнаяОплата.Ссылка = ЧекККМ.Ссылка
	|ГДЕ
	|	ЧекККМВозвратВалютнаяОплата.Валюта = &ВалютаРуб
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМВозвратВалютнаяОплата.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекККМВалютнаяОплата.Ссылка КАК Ссылка,
	|	СУММА(ЧекККМВалютнаяОплата.СуммаРуб) КАК СуммаРуб,
	|	СУММА(ЧекККМВалютнаяОплата.СуммаВал) КАК СуммаВал
	|ПОМЕСТИТЬ СОевро
	|ИЗ
	|	Документ.ЧекККМ.ВалютнаяОплата КАК ЧекККМВалютнаяОплата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЧекККМ КАК ЧекККМ
	|		ПО ЧекККМВалютнаяОплата.Ссылка = ЧекККМ.Ссылка
	|ГДЕ
	|	ЧекККМВалютнаяОплата.Валюта = &ВалютаЕвро
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМВалютнаяОплата.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМВозвратВалютнаяОплата.Ссылка,
	|	СУММА(-ЧекККМВозвратВалютнаяОплата.СуммаРуб),
	|	СУММА(-ЧекККМВозвратВалютнаяОплата.СуммаВал)
	|ИЗ
	|	Документ.ЧекККМВозврат.ВалютнаяОплата КАК ЧекККМВозвратВалютнаяОплата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЧекККМ КАК ЧекККМ
	|		ПО ЧекККМВозвратВалютнаяОплата.Ссылка = ЧекККМ.Ссылка
	|ГДЕ
	|	ЧекККМВозвратВалютнаяОплата.Валюта = &ВалютаЕвро
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМВозвратВалютнаяОплата.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекККМВалютнаяОплата.Ссылка КАК Ссылка,
	|	СУММА(ЧекККМВалютнаяОплата.СуммаРуб) КАК СуммаРуб,
	|	СУММА(ЧекККМВалютнаяОплата.СуммаВал) КАК СуммаВал
	|ПОМЕСТИТЬ СОдоллар
	|ИЗ
	|	Документ.ЧекККМ.ВалютнаяОплата КАК ЧекККМВалютнаяОплата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЧекККМ КАК ЧекККМ
	|		ПО ЧекККМВалютнаяОплата.Ссылка = ЧекККМ.Ссылка
	|ГДЕ
	|	ЧекККМВалютнаяОплата.Валюта = &ВалютаДоллар
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМВалютнаяОплата.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМВозвратВалютнаяОплата.Ссылка,
	|	СУММА(-ЧекККМВозвратВалютнаяОплата.СуммаРуб),
	|	СУММА(-ЧекККМВозвратВалютнаяОплата.СуммаВал)
	|ИЗ
	|	Документ.ЧекККМВозврат.ВалютнаяОплата КАК ЧекККМВозвратВалютнаяОплата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЧекККМ КАК ЧекККМ
	|		ПО ЧекККМВозвратВалютнаяОплата.Ссылка = ЧекККМ.Ссылка
	|ГДЕ
	|	ЧекККМВозвратВалютнаяОплата.Валюта = &ВалютаДоллар
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМВозвратВалютнаяОплата.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЕСТЬNULL(КК.Сумма, 0)) КАК СуммаЭТ,
	|	ЧекККМ.Ссылка КАК Ссылка,
	|	СУММА(ЕСТЬNULL(СОруб.СуммаРуб, 0)) КАК СуммаСОруб,
	|	СУММА(ЕСТЬNULL(ПС.Сумма, 0)) КАК СуммаПС,
	|	СУММА(ЕСТЬNULL(Тов.Количество, 0)) КАК Количество,
	|	ЕСТЬNULL(Тов.скидка, 0) КАК Поле1,
	|	СУММА(ЕСТЬNULL(СОевро.СуммаРуб, 0)) КАК СуммаСОевро,
	|	СУММА(ЕСТЬNULL(СОдоллар.СуммаРуб, 0)) КАК СуммаСОдоллар,
	|	СУММА(ЕСТЬNULL(СОевро.СуммаВал, 0)) КАК СуммаВалЕвро,
	|	СУММА(ЕСТЬNULL(СОдоллар.СуммаВал, 0)) КАК СуммаВалДоллар,
	|	СУММА(ЕСТЬNULL(Тов.СуммаБонусныхБалловКСписанию, 0)) КАК СуммаБонусныхБалловКСписанию,
	|	ЧекККМ.Дата КАК Дата
	|ИЗ
	|	ЧекККМ КАК ЧекККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СОруб КАК СОруб
	|		ПО ЧекККМ.Ссылка = СОруб.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СОевро КАК СОевро
	|		ПО ЧекККМ.Ссылка = СОевро.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СОдоллар КАК СОдоллар
	|		ПО ЧекККМ.Ссылка = СОдоллар.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПС КАК ПС
	|		ПО ЧекККМ.Ссылка = ПС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Тов КАК Тов
	|		ПО ЧекККМ.Ссылка = Тов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ КК КАК КК
	|		ПО ЧекККМ.Ссылка = КК.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМ.Ссылка,
	|	ЕСТЬNULL(Тов.скидка, 0),
	|	ЧекККМ.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекККМТовары.Номенклатура КАК Номенклатура,
	|	ЧекККМТовары.Характеристика КАК Характеристика,
	|	СУММА(ЧекККМТовары.Количество) КАК Количество,
	|	СУММА(ЧекККМТовары.Сумма) КАК Сумма,
	|	СРЕДНЕЕ(ЧекККМТовары.ПроцентРучнойСкидки + ЧекККМТовары.ПроцентАвтоматическойСкидки) КАК Поле1,
	|	ЧекККМ.Дата КАК Дата,
	|	ЧекККМ.Ссылка КАК Ссылка,
	|	СУММА(ЧекККМТовары.СуммаБонусныхБалловКСписанию) КАК СуммаБонусныхБалловКСписанию
	|ИЗ
	|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЧекККМ КАК ЧекККМ
	|		ПО (ЧекККМТовары.Ссылка = ЧекККМ.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМТовары.Номенклатура,
	|	ЧекККМТовары.Характеристика,
	|	ЧекККМ.Дата,
	|	ЧекККМ.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЧекККМВозвратТовары.Номенклатура,
	|	ЧекККМВозвратТовары.Характеристика,
	|	СУММА(-ЧекККМВозвратТовары.Количество),
	|	СУММА(-ЧекККМВозвратТовары.Сумма),
	|	СУММА(0),
	|	ЧекККМ.Дата,
	|	ЧекККМ.Ссылка,
	|	СУММА(-ЧекККМВозвратТовары.СуммаБонусныхБалловКСписаниюВВалюте)
	|ИЗ
	|	Документ.ЧекККМВозврат.Товары КАК ЧекККМВозвратТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЧекККМ КАК ЧекККМ
	|		ПО (ЧекККМВозвратТовары.Ссылка = ЧекККМ.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМВозвратТовары.Номенклатура,
	|	ЧекККМВозвратТовары.Характеристика,
	|	ЧекККМ.Ссылка,
	|	ЧекККМ.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументЧекККМ.Ссылка КАК Ссылка,
	|	ДокументЧекККМ.Партнер КАК Партнер,
	|	ДокументЧекККМ.СуммаДокумента КАК СуммаДокумента,
	|	ДокументЧекККМ.ПолученоНаличными КАК ПолученоНаличными,
	|	ДокументЧекККМ.Дата КАК Дата,
	|	ДокументЧекККМ.ЧекККМОплата КАК ЧекККМ
	|ИЗ
	|	ЧекККМ КАК ДокументЧекККМ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	//ЗАпрос.УстановитьПараметр("Склад", Подразделение);
	Запрос.УстановитьПараметр("КассаККМ", КассыККМ);
	Запрос.УстановитьПараметр("НачалоПериода", началодня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", конецдня(конецпериода));
	Запрос.УстановитьПараметр("Статус", перечисления.СтатусыЧековККМ.Пробит);
	Запрос.УстановитьПараметр("ВалютаДоллар", справочники.Валюты.НайтиПоКоду("840"));
	Запрос.УстановитьПараметр("Валютаевро", справочники.Валюты.НайтиПоКоду("978"));
	Запрос.УстановитьПараметр("Валютаруб", справочники.Валюты.НайтиПоКоду("643"));
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	чеки 		= ПакетЗапросов[ПакетЗапросов.ВГраница()].Выбрать();
	детали  	= ПакетЗапросов[ПакетЗапросов.ВГраница()-1].Выбрать();
	чекисуммы  	= ПакетЗапросов[ПакетЗапросов.ВГраница()-2].Выбрать();
	
	Табдок.Вывести(Продажи,1);
	Итогувсех.параметры.итогколво = 0;
	Итогувсех.параметры.итогсумма = 0;
	Итогувсех.параметры.итогскидка = 0;
	Итогувсех.параметры.итогккм = 0;
	Итогувсех.параметры.итогкк = 0;
	Итогсо.параметры.итогсо = 0;
	Итогсо.параметры.итогсоруб = 0;
	Итогсо.параметры.итогсоевро = 0;
	Итогсо.параметры.итогсодоллар = 0;
	Итогпс.параметры.итогпс = 0;
	Итогпред.параметры.итогпред = 0;
	Итогпост.параметры.итогпост = 0;
	Итогувсех.параметры.итогколво = 0;
	Итогбанк.параметры.итогбанк1 = 0;
	ИтогбанкИМ.параметры.итогбанк= 0;
	ИтогбанкИМ.параметры.итогбанксчет= 0;
	ИтогбанкИМ.параметры.итогбанконлайн= 0;
	ИтогбанкИМ.параметры.итогбанкпони= 0;
	ИтогбанкИМ.параметры.итогбанкпп= 0;
	Итогувсех.параметры.итогбонус = 0;
	
	пока чеки.Следующий() цикл
		СтрокаДокументувсех.параметры.документ = чеки.ссылка;//чеки.ссылка;
		СтрокаДокументувсех.параметры.Расшифровка1 = чеки.ссылка;
		СтрокаДокументувсех.параметры.Клиент = чеки.Партнер;
		СтрокаДокументувсех.параметры.сумма = чеки.суммадокумента;
		    сдачасо = ?(чеки.ПолученоНаличными = 0,чеки.ссылка.СуммаДокумента - чеки.ссылка.ВалютнаяОплата.Итог("СуммаРуб")-чеки.ссылка.ОплатаПлатежнымиКартами.Итог("Сумма")-чеки.ссылка.ПодарочныеСертификаты.Итог("Сумма"),0);
			СтрокаДокументувсех.параметры.ккм = чеки.ПолученоНаличными - (чеки.ссылка.ОплатаПлатежнымиКартами.Итог("Сумма") + чеки.ссылка.ПодарочныеСертификаты.Итог("Сумма") 
				+ ?(чеки.ПолученоНаличными < 0, -чеки.ПолученоНаличными, чеки.ПолученоНаличными) + чеки.ссылка.ВалютнаяОплата.Итог("СуммаРуб") - чеки.ссылка.СуммаДокумента)-сдачаСО;
						
		
		Итогувсех.параметры.итогсумма = Итогувсех.параметры.итогсумма + чеки.суммадокумента;
		Итогувсех.параметры.итогккм = Итогувсех.параметры.итогккм + СтрокаДокументувсех.параметры.ккм;
		
		чекисуммы.Сбросить();
		Если чекисуммы.НайтиСледующий(Новый Структура("Ссылка", чеки.ссылка)) тогда
			
			СтрокаДокументувсех.параметры.колво = чекисуммы.количество;
			СтрокаДокументувсех.параметры.кк = чекисуммы.СуммаЭТ;
			СтрокаДокументувсех.параметры.бонус = чекисуммы.СуммаБонусныхБалловКСписанию;
			СтрокаДокументсо.параметры.соруб = ?(сдачасо <>0, строка(чекисуммы.СуммаСОруб+сдачасо) +" (сдача "+ строка(сдачасо)+")", чекисуммы.СуммаСОруб);
			СтрокаДокументсо.параметры.соевро = чекисуммы.СуммаВалЕвро;
			СтрокаДокументсо.параметры.содоллар = чекисуммы.СуммаВалДоллар;
			
			СтрокаДокументпс.параметры.пс = чекисуммы.СуммаПС;
			СтрокаДокументпред.параметры.пред = 0;
			
			СтрокаДокументбанк.параметры.банк1 = 0;
			СтрокаДокументбанким.параметры.банксчет = 0;
			СтрокаДокументбанким.параметры.банконлайн = 0;
			СтрокаДокументбанким.параметры.банкпони = 0;
			СтрокаДокументбанким.параметры.банкпп = 0;
		
			Итогувсех.параметры.итогбонус = Итогувсех.параметры.итогбонус + СтрокаДокументувсех.параметры.бонус;
			Итогувсех.параметры.итогкк = Итогувсех.параметры.итогкк + СтрокаДокументувсех.параметры.кк;
			Итогсо.параметры.итогсоруб = Итогсо.параметры.итогсоруб + чекисуммы.СуммаСОруб+сдачасо;
			Итогсо.параметры.итогсоевро = Итогсо.параметры.итогсоевро + СтрокаДокументсо.параметры.соевро;
			Итогсо.параметры.итогсодоллар = Итогсо.параметры.итогсодоллар + СтрокаДокументсо.параметры.содоллар;
			Итогсо.параметры.итогсо = Итогсо.параметры.итогсо + чекисуммы.СуммаСОруб+сдачасо + чекисуммы.СуммаСОевро + чекисуммы.СуммаСОдоллар;
			Итогпс.параметры.итогпс = Итогпс.параметры.итогпс + СтрокаДокументпс.параметры.пс;
			Итогпред.параметры.итогпред = Итогпред.параметры.итогпред + СтрокаДокументпред.параметры.пред;
			Итогувсех.параметры.итогколво = Итогувсех.параметры.итогколво + чекисуммы.количество;
		конецесли;
		Табдок.Вывести(СтрокаДокументувсех,2);
		если ПС тогда
			Табдок.Присоединить(СтрокаДокументпс);
		конецесли;
		если со тогда	
			Табдок.Присоединить(СтрокаДокументсо);
		конецесли;
		если Предоплата тогда
			Табдок.Присоединить(СтрокаДокументпред);
		конецесли;
		если Постоплата тогда
			Табдок.Присоединить(СтрокаДокументпост);
		конецесли;
		если банк тогда
			Табдок.Присоединить(СтрокаДокументбанк);
		конецесли;
		если банким тогда
			Табдок.Присоединить(СтрокаДокументбанким);
		конецесли;
		детали.Сбросить();
		пока детали.НайтиСледующий(Новый Структура("Ссылка", чеки.ссылка)) цикл
			СтрокаДетали.параметры.номенклатура = строка(детали.номенклатура) + " (" + строка(детали.характеристика) + ")";
			СтрокаДетали.параметры.колво = детали.количество;
			Строкадетали.параметры.сумма = детали.сумма;
		    Строкадетали.параметры.скидка = детали.поле1;
			Строкадетали.параметры.бонус = детали.СуммаБонусныхБалловКСписанию;
			//рисунок
			Верх = СтрокаДетали.ВысотаТаблицы;
			если рисунокБ тогда 
				//СтрокаДетали.ВысотаТаблицы = 20;
				ОбластьРисунка = СтрокаДетали.Область(верх,2,верх,2);
				
				Рисунок = СтрокаДетали.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
				попытка
					Рисунок.Картинка = Новый Картинка(ПолучитьИзВременногоХранилища(РаботаСФайлами.ПолучитьДанныеФайла(детали.Номенклатура.ФайлКартинки).СсылкаНаДвоичныеДанныеФайла));// Картинка;
					ОбластьРисунка.высотастроки = 70;
					//Рисунок.
					//СтрокаДетали.Картинка   = Новый Картинка(ПолучитьИзВременногоХранилища(ПрисоединенныеФайлы.ПолучитьДанныеФайла(детали.Номенклатура.ФайлКартинки).СсылкаНаДвоичныеДанныеФайла));// Картинка;
				исключение
					Рисунок.Картинка = Новый Картинка;
					//СтрокаДетали.параметры.рисунок =Новый Картинка;
				конецпопытки;
				Рисунок.ГраницаСверху = ложь;
				Рисунок.ГраницаСлева = ложь;
				Рисунок.ГраницаСправа = ложь;
				Рисунок.ГраницаСнизу = ложь;
				Рисунок.РазмерКартинки = РазмерКартинки.Пропорционально;
				Рисунок.Расположить(ОбластьРисунка);
			иначе
				ОбластьНомен = СтрокаДетали.Область(верх,1,верх,2);
				ОбластьНомен.Объединить();
			конецесли;
			//\\
			Табдок.Вывести(Строкадетали,3,,ложь);
		конеццикла;			
	конеццикла;
	Табдок.Вывести(Итогувсех,1);
	если ПС тогда
		Табдок.Присоединить(Итогпс);
	конецесли;
	если со тогда	
		Табдок.Присоединить(Итогсо);
	конецесли;
	если Предоплата тогда
		Табдок.Присоединить(Итогпред);
	конецесли;
	если Постоплата тогда
		Табдок.Присоединить(Итогпост);
	конецесли;
	если банк тогда
		Табдок.Присоединить(Итогбанк);
	конецесли;
	если банким тогда
		Табдок.Присоединить(Итогбанким,1);
	конецесли;
	ИтогПодрувсех.параметры.итогбонус = ИтогПодрувсех.параметры.итогбонус + Итогувсех.параметры.итогбонус;
	ИтогПодрувсех.параметры.итогколво = ИтогПодрувсех.параметры.итогколво + Итогувсех.параметры.итогколво;
	ИтогПодрувсех.параметры.итогсумма = ИтогПодрувсех.параметры.итогсумма + Итогувсех.параметры.итогсумма;
	ИтогПодрувсех.параметры.итогскидка = ИтогПодрувсех.параметры.итогскидка + Итогувсех.параметры.итогскидка;
	ИтогПодрувсех.параметры.итогккм = ИтогПодрувсех.параметры.итогккм + Итогувсех.параметры.итогккм;
	ИтогПодрувсех.параметры.итогкк = ИтогПодрувсех.параметры.итогкк + Итогувсех.параметры.итогкк;
	ИтогПодрсо.параметры.итогсо = ИтогПодрсо.параметры.итогсо + Итогсо.параметры.итогсо;
	ИтогПодрсо.параметры.итогсоруб = ИтогПодрсо.параметры.итогсоруб + Итогсо.параметры.итогсоруб;
	ИтогПодрсо.параметры.итогсоевро = ИтогПодрсо.параметры.итогсоевро + Итогсо.параметры.итогсоевро;
	ИтогПодрсо.параметры.итогсодоллар = ИтогПодрсо.параметры.итогсодоллар + Итогсо.параметры.итогсодоллар;
	ИтогПодрпс.параметры.итогпс = ИтогПодрпс.параметры.итогпс + Итогпс.параметры.итогпс;
	ИтогПодрпред.параметры.итогпред = ИтогПодрпред.параметры.итогпред + Итогпред.параметры.итогпред;
	ИтогПодрпост.параметры.итогпост = ИтогПодрпост.параметры.итогпост + Итогпост.параметры.итогпост;
	ИтогПодрбанк.параметры.итогбанк1 = ИтогПодрбанк.параметры.итогбанк1 + Итогбанк.параметры.итогбанк1;
	ИтогПодрбанкИМ.параметры.итогбанк = ИтогПодрбанкИМ.параметры.итогбанк + ИтогбанкИМ.параметры.итогбанк;
	ИтогПодрбанкИМ.параметры.итогбанксчет = ИтогПодрбанкИМ.параметры.итогбанксчет + ИтогбанкИМ.параметры.итогбанксчет;
	ИтогПодрбанкИМ.параметры.итогбанконлайн = ИтогПодрбанкИМ.параметры.итогбанконлайн + ИтогбанкИМ.параметры.итогбанконлайн;
	ИтогПодрбанкИМ.параметры.итогбанкпони = ИтогПодрбанкИМ.параметры.итогбанкпони + ИтогбанкИМ.параметры.итогбанкпони;
	ИтогПодрбанкИМ.параметры.итогбанкпп = ИтогПодрбанкИМ.параметры.итогбанкпп + ИтогбанкИМ.параметры.итогбанкпп;
# конецобласти

#Область Возвраты
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВозвратТоваровОтКлиента.Ссылка,
	               |	ВозвратТоваровОтКлиента.Партнер,
	               |	ВозвратТоваровОтКлиента.СуммаДокумента,
	               |	ВозвратТоваровОтКлиента.Дата
	               |ИЗ
	               |	Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
	               |ГДЕ
	               |	ВозвратТоваровОтКлиента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ВозвратТоваровОтКлиента.Проведен
	               |	И ВозвратТоваровОтКлиента.Подразделение в иерархии (&Склад)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВозвратТоваровОтКлиента.Дата";
	ЗАпрос.УстановитьПараметр("Склад", Подразделение);
	//ЗАпрос.УстановитьПараметр("Склад", КассаККМ);
	Запрос.УстановитьПараметр("НачалоПериода", началодня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", конецдня(конецпериода));
	Запрос.УстановитьПараметр("Статус", перечисления.СтатусыЧековККМ.Пробит);
	возвраты = Запрос.Выполнить().Выбрать();
	Табдок.Вывести(Возвраты1,1);
	Итогувсех.параметры.итогколво = 0;
	Итогувсех.параметры.итогсумма = 0;
	Итогувсех.параметры.итогскидка = 0;
	Итогувсех.параметры.итогккм = 0;
	Итогувсех.параметры.итогкк = 0;
	Итогсо.параметры.итогсо = 0;
	Итогсо.параметры.итогсоруб = 0;
	Итогсо.параметры.итогсоевро = 0;
	Итогсо.параметры.итогсодоллар = 0;
	Итогпс.параметры.итогпс = 0;
	Итогпред.параметры.итогпред = 0;
	Итогпост.параметры.итогпост = 0;
	Итогувсех.параметры.итогколво = 0;
	Итогбанк.параметры.итогбанк1 = 0;
	ИтогбанкИМ.параметры.итогбанк= 0;
	ИтогбанкИМ.параметры.итогбанксчет= 0;
	ИтогбанкИМ.параметры.итогбанконлайн= 0;
	ИтогбанкИМ.параметры.итогбанкпони= 0;
	ИтогбанкИМ.параметры.итогбанкпп= 0;
	Итогувсех.параметры.итогбонус = 0;		
	пока возвраты.Следующий() цикл
		СтрокаДокументувсех.параметры.документ = возвраты.ссылка;
		СтрокаДокументувсех.параметры.Расшифровка1 = возвраты.ссылка;
		СтрокаДокументувсех.параметры.Клиент = возвраты.Партнер;
		СтрокаДокументувсех.параметры.сумма = возвраты.суммадокумента;
		СтрокаДокументувсех.параметры.ккм = 0;
		СтрокаДокументувсех.параметры.кк = 0;
		СтрокаДокументувсех.параметры.бонус = 0;
		СтрокаДокументсо.параметры.соруб = 0;
		СтрокаДокументсо.параметры.соевро = 0;
		СтрокаДокументсо.параметры.содоллар = 0;
		
		
		СтрокаДокументпс.параметры.пс = 0;
		СтрокаДокументпред.параметры.пред = 0;
		СтрокаДокументпост.параметры.пост = 0;
		Итогувсех.параметры.итогсумма = Итогувсех.параметры.итогсумма + возвраты.суммадокумента;
		СтрокаДокументувсех.параметры.колво = возвраты.ссылка.товары.итог("КоличествоУпаковок");
		СтрокаДокументбанк.параметры.банк1 = 0;
		СтрокаДокументбанким.параметры.банксчет = 0;
		СтрокаДокументбанким.параметры.банконлайн = 0;
		СтрокаДокументбанким.параметры.банкпони = 0;
		СтрокаДокументбанким.параметры.банкпп = 0;
		Итогувсех.параметры.итогколво = Итогувсех.параметры.итогколво + возвраты.ссылка.товары.итог("КоличествоУпаковок");

		Табдок.Вывести(СтрокаДокументувсех,2);
		если ПС тогда
			Табдок.Присоединить(СтрокаДокументпс);
		конецесли;
		если со тогда	
			Табдок.Присоединить(СтрокаДокументсо);
		конецесли;
		если Предоплата тогда
			Табдок.Присоединить(СтрокаДокументпред);
		конецесли;
		если Постоплата тогда
			Табдок.Присоединить(СтрокаДокументпост);
		конецесли;
		если банк тогда
			Табдок.Присоединить(СтрокаДокументбанк);
		конецесли;
		если банким тогда
			Табдок.Присоединить(СтрокаДокументбанким);
		конецесли;
		
		запрос = новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВозвратТоваровОтКлиентаТовары.Номенклатура,
		               |	ВозвратТоваровОтКлиентаТовары.Характеристика,
		               |	ВозвратТоваровОтКлиентаТовары.Количество,
		               |	ВозвратТоваровОтКлиентаТовары.Сумма
		               |ИЗ
		               |	Документ.ВозвратТоваровОтКлиента.Товары КАК ВозвратТоваровОтКлиентаТовары
		               |ГДЕ
		               |	ВозвратТоваровОтКлиентаТовары.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", возвраты.ссылка);
		детали = запрос.Выполнить().Выбрать();
		пока детали.Следующий() цикл
			СтрокаДетали.параметры.номенклатура = строка(детали.номенклатура) + " (" + строка(детали.характеристика) + ")";
			СтрокаДетали.параметры.колво = детали.количество;
			Строкадетали.параметры.сумма = детали.сумма;
			Строкадетали.параметры.скидка = 0;
			Строкадетали.параметры.бонус = 0;
			//рисунок
			Верх = СтрокаДетали.ВысотаТаблицы;
			если рисунокБ тогда 
				//СтрокаДетали.ВысотаТаблицы = 20;
				ОбластьРисунка = СтрокаДетали.Область(верх,2,верх,2);
				
				Рисунок = СтрокаДетали.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
				попытка
					Рисунок.Картинка = Новый Картинка(ПолучитьИзВременногоХранилища(РаботаСФайлами.ПолучитьДанныеФайла(детали.Номенклатура.ФайлКартинки).СсылкаНаДвоичныеДанныеФайла));// Картинка;
					ОбластьРисунка.высотастроки = 70;
					//Рисунок.
					//СтрокаДетали.Картинка   = Новый Картинка(ПолучитьИзВременногоХранилища(ПрисоединенныеФайлы.ПолучитьДанныеФайла(детали.Номенклатура.ФайлКартинки).СсылкаНаДвоичныеДанныеФайла));// Картинка;
				исключение
					Рисунок.Картинка = Новый Картинка;
					//СтрокаДетали.параметры.рисунок =Новый Картинка;
				конецпопытки;
				Рисунок.ГраницаСверху = ложь;
				Рисунок.ГраницаСлева = ложь;
				Рисунок.ГраницаСправа = ложь;
				Рисунок.ГраницаСнизу = ложь;
				Рисунок.РазмерКартинки = РазмерКартинки.Пропорционально;
				Рисунок.Расположить(ОбластьРисунка);
			иначе
				ОбластьНомен = СтрокаДетали.Область(верх,1,верх,2);
				ОбластьНомен.Объединить();
			конецесли;
			//\\
			Табдок.Вывести(Строкадетали,3,,ложь);
		конеццикла;			
	конеццикла;
	Табдок.Вывести(Итогувсех,1);
	если ПС тогда
		Табдок.Присоединить(Итогпс);
	конецесли;
	если со тогда	
		Табдок.Присоединить(Итогсо);
	конецесли;
	если Предоплата тогда
		Табдок.Присоединить(Итогпред);
	конецесли;
	если Постоплата тогда
		Табдок.Присоединить(Итогпост);
	конецесли;
	если банк тогда
		Табдок.Присоединить(Итогбанк);
	конецесли;
	если банким тогда
		Табдок.Присоединить(Итогбанким);
	конецесли;
	
	//ИтогПодрувсех.параметры.итогколво = ИтогПодрувсех.параметры.итогколво - Итогувсех.параметры.итогколво;
	//ИтогПодрувсех.параметры.итогсумма = ИтогПодрувсех.параметры.итогсумма - Итогувсех.параметры.итогсумма;
	//ИтогПодрувсех.параметры.итогскидка = ИтогПодрувсех.параметры.итогскидка - Итогувсех.параметры.итогскидка;
	//ИтогПодрувсех.параметры.итогккм = ИтогПодрувсех.параметры.итогккм - Итогувсех.параметры.итогккм;
	//ИтогПодрувсех.параметры.итогкк = ИтогПодрувсех.параметры.итогкк - Итогувсех.параметры.итогкк;
	//ИтогПодрсо.параметры.итогсо = ИтогПодрсо.параметры.итогсо - Итогсо.параметры.итогсо;
	//ИтогПодрсо.параметры.итогсоруб = ИтогПодрсо.параметры.итогсоруб - Итогсо.параметры.итогсоруб;
	//ИтогПодрсо.параметры.итогсоевро = ИтогПодрсо.параметры.итогсоевро - Итогсо.параметры.итогсоевро;
	//ИтогПодрсо.параметры.итогсодоллар = ИтогПодрсо.параметры.итогсодоллар - Итогсо.параметры.итогсодоллар;
	//ИтогПодрпс.параметры.итогпс = ИтогПодрпс.параметры.итогпс - Итогпс.параметры.итогпс;
	//ИтогПодрпред.параметры.итогпред = ИтогПодрпред.параметры.итогпред - Итогпред.параметры.итогпред;
	//ИтогПодрпост.параметры.итогпост = ИтогПодрпост.параметры.итогпост - Итогпост.параметры.итогпост;
	//ИтогПодрбанк.параметры.итогбанк1 = ИтогПодрбанк.параметры.итогбанк1 - Итогбанк.параметры.итогбанк1;
	//ИтогПодрбанкИМ.параметры.итогбанк = ИтогПодрбанкИМ.параметры.итогбанк - ИтогбанкИМ.параметры.итогбанк;
	//ИтогПодрбанкИМ.параметры.итогбанксчет = ИтогПодрбанкИМ.параметры.итогбанксчет - ИтогбанкИМ.параметры.итогбанксчет;
	//ИтогПодрбанкИМ.параметры.итогбанконлайн = ИтогПодрбанкИМ.параметры.итогбанконлайн - ИтогбанкИМ.параметры.итогбанконлайн;
	//ИтогПодрбанкИМ.параметры.итогбанкпони = ИтогПодрбанкИМ.параметры.итогбанкпони - ИтогбанкИМ.параметры.итогбанкпони;
	//ИтогПодрбанкИМ.параметры.итогбанкпп = ИтогПодрбанкИМ.параметры.итогбанкпп - ИтогбанкИМ.параметры.итогбанкпп;
# конецобласти
	
#Область Заказы
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗаказКлиента.Ссылка,
	               |	ЗаказКлиента.Партнер,
	               |	ЗаказКлиента.СуммаДокумента,
	               |	ЗаказКлиента.Дата КАК Дата,
	               |	ЗаказКлиента.Валюта
	               |ИЗ
	               |	Документ.ЗаказКлиента КАК ЗаказКлиента
	               |ГДЕ
	               |	ЗаказКлиента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЗаказКлиента.Подразделение В иерархии (&Склад)
	               |	И ЗаказКлиента.Проведен
	               |	И ЗаказКлиента.ВидЗаказа не в (&ВидЗаказа)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	ВЗ = новый списокзначений();
	вз.Добавить(перечисления.ВидыЗаказов.МТМ);
	вз.Добавить(перечисления.ВидыЗаказов.ИМ);
	ЗАпрос.УстановитьПараметр("ВидЗаказа", ВЗ);
	ЗАпрос.УстановитьПараметр("Склад", Подразделение);
	//Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	Запрос.УстановитьПараметр("НачалоПериода", началодня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", конецдня(конецпериода));
	//Запрос.УстановитьПараметр("Статус", перечисления.СтатусыЧековККМ.Пробит);
	заказы = Запрос.Выполнить().Выбрать();
	Табдок.Вывести(Заказы1,1);
		Итогувсех.параметры.итогколво = 0;
	Итогувсех.параметры.итогсумма = 0;
	Итогувсех.параметры.итогскидка = 0;
	Итогувсех.параметры.итогккм = 0;
	Итогувсех.параметры.итогкк = 0;
	Итогсо.параметры.итогсо = 0;
	Итогсо.параметры.итогсоруб = 0;
	Итогсо.параметры.итогсоевро = 0;
	Итогсо.параметры.итогсодоллар = 0;
	Итогпс.параметры.итогпс = 0;
	Итогпред.параметры.итогпред = 0;
	Итогпост.параметры.итогпост = 0;
	Итогувсех.параметры.итогколво = 0;
	Итогбанк.параметры.итогбанк1 = 0;
	ИтогбанкИМ.параметры.итогбанк= 0;
	ИтогбанкИМ.параметры.итогбанксчет= 0;
	ИтогбанкИМ.параметры.итогбанконлайн= 0;
	ИтогбанкИМ.параметры.итогбанкпони= 0;
	ИтогбанкИМ.параметры.итогбанкпп= 0;
	
	пока заказы.Следующий() цикл
		Коэффициенты = РаботаСКурсамивалютУТ.ПолучитьКоэффициентыПересчетаВалюты(заказы.Валюта, Неопределено, заказы.дата);
		СтрокаДокументувсех.параметры.документ = заказы.ссылка;
		СтрокаДокументувсех.параметры.Расшифровка1 = заказы.ссылка;
		СтрокаДокументувсех.параметры.Клиент = заказы.Партнер;
		СтрокаДокументувсех.параметры.сумма = заказы.суммадокумента * Коэффициенты.КоэффициентПересчетаВВалютуРегл;
		СтрокаДокументувсех.параметры.бонус = 0;
		СтрокаДокументувсех.параметры.колво = заказы.ссылка.товары.итог("КоличествоУпаковок");
		
		СтрокаДокументувсех.параметры.ккм = 0;
	
		СтрокаДокументсо.параметры.соруб = 0;
		СтрокаДокументсо.параметры.соевро = 0;
		СтрокаДокументсо.параметры.содоллар = 0;
		СтрокаДокументувсех.параметры.кк = 0;
		СтрокаДокументпс.параметры.пс = 0;
		СтрокаДокументпред.параметры.пред = 0;
		СтрокаДокументбанк.параметры.банк1 = 0;
		СтрокаДокументбанким.параметры.банксчет = 0;
		СтрокаДокументбанким.параметры.банконлайн = 0;
		СтрокаДокументбанким.параметры.банкпони = 0;
		СтрокаДокументбанким.параметры.банкпп = 0;
		СтрокаДокументпост.параметры.пост = 0;
		
		Итогувсех.параметры.итогсумма = Итогувсех.параметры.итогсумма + заказы.суммадокумента*Коэффициенты.КоэффициентПересчетаВВалютуРегл;			
		Итогувсех.параметры.итогколво = Итогувсех.параметры.итогколво + заказы.ссылка.товары.итог("КоличествоУпаковок");
	
		Табдок.Вывести(СтрокаДокументувсех,2);
		если ПС тогда
			Табдок.Присоединить(СтрокаДокументпс);
		конецесли;
		если со тогда	
			Табдок.Присоединить(СтрокаДокументсо);
		конецесли;
		если Предоплата тогда
			Табдок.Присоединить(СтрокаДокументпред);
		конецесли;
		если Постоплата тогда
			Табдок.Присоединить(СтрокаДокументпост);
		конецесли;
		если банк тогда
			Табдок.Присоединить(СтрокаДокументбанк);
		конецесли;
		если банким тогда
			Табдок.Присоединить(СтрокаДокументбанким);
		конецесли;
		
		запрос = новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЗаказКлиентаТовары.Номенклатура,
		               |	ЗаказКлиентаТовары.Характеристика,
		               |	ЗаказКлиентаТовары.Количество,
		               |	ЗаказКлиентаТовары.Сумма,
		               |	ЗаказКлиентаТовары.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
					   |	ЗаказКлиентаТовары.ПроцентРучнойСкидки + ЗаказКлиентаТовары.ПроцентАвтоматическойСкидки КАК Поле1
		               |ИЗ
		               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		               |ГДЕ
		               |	ЗаказКлиентаТовары.Ссылка = &Ссылка
		               |	И ЗаказКлиентаТовары.Отменено = ЛОЖЬ";
		Запрос.УстановитьПараметр("Ссылка", заказы.ссылка);
		детали = запрос.Выполнить().Выбрать();
		пока детали.Следующий() цикл
			СтрокаДетали.параметры.номенклатура = строка(детали.номенклатура) + " (" + строка(детали.характеристика) + ")";
			СтрокаДетали.параметры.колво = детали.количество;
			Строкадетали.параметры.сумма = детали.сумма*Коэффициенты.КоэффициентПересчетаВВалютуРегл;
		    Строкадетали.параметры.скидка = детали.поле1;
			Строкадетали.параметры.бонус = детали.СуммаБонусныхБалловКСписаниюВВалюте;
			//рисунок
			Верх = СтрокаДетали.ВысотаТаблицы;
			если рисунокБ тогда 
				//СтрокаДетали.ВысотаТаблицы = 20;
				ОбластьРисунка = СтрокаДетали.Область(верх,2,верх,2);
				
				Рисунок = СтрокаДетали.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
				попытка
					Рисунок.Картинка = Новый Картинка(ПолучитьИзВременногоХранилища(РаботаСФайлами.ПолучитьДанныеФайла(детали.Номенклатура.ФайлКартинки).СсылкаНаДвоичныеДанныеФайла));// Картинка;
					ОбластьРисунка.высотастроки = 70;
					//Рисунок.
					//СтрокаДетали.Картинка   = Новый Картинка(ПолучитьИзВременногоХранилища(ПрисоединенныеФайлы.ПолучитьДанныеФайла(детали.Номенклатура.ФайлКартинки).СсылкаНаДвоичныеДанныеФайла));// Картинка;
				исключение
					Рисунок.Картинка = Новый Картинка;
					//СтрокаДетали.параметры.рисунок =Новый Картинка;
				конецпопытки;
				Рисунок.ГраницаСверху = ложь;
				Рисунок.ГраницаСлева = ложь;
				Рисунок.ГраницаСправа = ложь;
				Рисунок.ГраницаСнизу = ложь;
				Рисунок.РазмерКартинки = РазмерКартинки.Пропорционально;
				Рисунок.Расположить(ОбластьРисунка);
			иначе
				ОбластьНомен = СтрокаДетали.Область(верх,1,верх,2);
				ОбластьНомен.Объединить();
			конецесли;
			//\\
			Табдок.Вывести(Строкадетали,3,,ложь);
		конеццикла;			
	конеццикла;
	Табдок.Вывести(Итогувсех,1);
	если ПС тогда
		Табдок.Присоединить(Итогпс);
	конецесли;
	если со тогда	
		Табдок.Присоединить(Итогсо);
	конецесли;
	если Предоплата тогда
		Табдок.Присоединить(Итогпред);
	конецесли;
	если Постоплата тогда
		Табдок.Присоединить(Итогпост);
	конецесли;
	если банк тогда
		Табдок.Присоединить(Итогбанк);
	конецесли;
	если банким тогда
		Табдок.Присоединить(Итогбанким);
	конецесли;
# конецобласти

#Область Реализации
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	               |	РеализацияТоваровУслуг.Партнер КАК Партнер,
	               |	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	               |	РеализацияТоваровУслуг.Дата КАК Дата,
	               |	РеализацияТоваровУслуг.Валюта КАК Валюта,
	               |	РеализацияТоваровУслуг.ЗаказКлиента КАК заказ
	               |ПОМЕСТИТЬ Реализации
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РеализацияТоваровУслуг.Подразделение В ИЕРАРХИИ(&Склад)
	               |	И РеализацияТоваровУслуг.Проведен
	               |	И РеализацияТоваровУслуг.ЗаказКлиента.ВидЗаказа <> &ВидЗаказа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	               |	СУММА(РеализацияТоваровУслугТовары.ПроцентАвтоматическойСкидки + РеализацияТоваровУслугТовары.ПроцентРучнойСкидки) КАК Поле1,
	               |	СУММА(РеализацияТоваровУслугТовары.КоличествоУпаковок) КАК КоличествоУпаковок
	               |ПОМЕСТИТЬ Тов
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реализации КАК Реализации
	               |		ПО РеализацияТоваровУслугТовары.Ссылка = Реализации.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Заказ КАК Заказ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &Оплата
	               |				ТОГДА 1
	               |			ИНАЧЕ -1
	               |		КОНЕЦ * ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ПС
	               |ИЗ
	               |	Документ.ОплатаПодарочнымСертификатом.РасшифровкаПлатежа КАК ОплатаПодарочнымСертификатомРасшифровкаПлатежа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реализации КАК Реализации
	               |		ПО ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Заказ = Реализации.заказ
	               |ГДЕ
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	               |	И ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ КАК Заказ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &Оплата
	               |				ТОГДА 1
	               |			ИНАЧЕ -1
	               |		КОНЕЦ * ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ КК
	               |ИЗ
	               |	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реализации КАК Реализации
	               |		ПО ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ = Реализации.заказ
	               |ГДЕ
	               |	НЕ ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ЭквайринговыйТерминал В (&ЭквайринговыйТерминал)
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Валюта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ КАК Заказ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &Оплата
	               |				ТОГДА 1
	               |			ИНАЧЕ -1
	               |		КОНЕЦ * ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ККОнлайн
	               |ИЗ
	               |	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реализации КАК Реализации
	               |		ПО ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ = Реализации.заказ
	               |ГДЕ
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ЭквайринговыйТерминал В(&ЭквайринговыйТерминал)
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &Оплата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Валюта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Заказ,
	               |	СУММА(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма - ЕСТЬNULL(РасходныйКассовыйОрдерРасшифровкаПлатежа.Сумма, 0)) КАК Сумма,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта КАК Валюта
	               |ПОМЕСТИТЬ Касса
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реализации КАК Реализации
	               |		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ = Реализации.заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
	               |		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ = РасходныйКассовыйОрдерРасшифровкаПлатежа.Заказ
	               |			И (РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В (&КассаККМ))
	               |			И (РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА)
	               |			И (РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассаККМ)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Заказ,
	               |	СУММА(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма - ЕСТЬNULL(РасходныйКассовыйОрдерРасшифровкаПлатежа.Сумма, 0)) КАК Сумма,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта КАК Валюта
	               |ПОМЕСТИТЬ СОруб
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реализации КАК Реализации
	               |		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ = Реализации.заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
	               |		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ = РасходныйКассовыйОрдерРасшифровкаПлатежа.Заказ
	               |			И (РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В (&КассыККМСО))
	               |			И (РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта = &ВалютаРУБ)
	               |			И (РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА)
	               |			И (РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассыККМСО)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта = &ВалютаРУБ
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Заказ,
	               |	СУММА(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма - ЕСТЬNULL(РасходныйКассовыйОрдерРасшифровкаПлатежа.Сумма, 0)) КАК Сумма,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта КАК Валюта
	               |ПОМЕСТИТЬ СОевро
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реализации КАК Реализации
	               |		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ = Реализации.заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
	               |		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ = РасходныйКассовыйОрдерРасшифровкаПлатежа.Заказ
	               |			И (РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В (&КассыККМСО))
	               |			И (РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта = &ВалютаЕвро)
	               |			И (РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА)
	               |			И (РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассыККМСО)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта = &ВалютаЕвро
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Заказ,
	               |	СУММА(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма - ЕСТЬNULL(РасходныйКассовыйОрдерРасшифровкаПлатежа.Сумма, 0)) КАК Сумма,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта КАК Валюта
	               |ПОМЕСТИТЬ СОдоллар
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реализации КАК Реализации
	               |		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ = Реализации.заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
	               |		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ = РасходныйКассовыйОрдерРасшифровкаПлатежа.Заказ
	               |			И (РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В (&КассыККМСО))
	               |			И (РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта = &ВалютаЕвро)
	               |			И (РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА)
	               |			И (РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассыККМСО)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта = &ВалютаДоллар
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Заказ,
	               |	СУММА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ Банк
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реализации КАК Реализации
	               |		ПО ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ = Реализации.заказ
	               |ГДЕ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ОплатаИМ = ЛОЖЬ
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Заказ,
	               |	СУММА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ БанкСчет
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реализации КАК Реализации
	               |		ПО ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ = Реализации.заказ
	               |ГДЕ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &счет
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Заказ,
	               |	СУММА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ БанкПони
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реализации КАК Реализации
	               |		ПО ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ = Реализации.заказ
	               |ГДЕ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	               |	И (ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &пони
	               |			ИЛИ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &СДЭК
	               |			ИЛИ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &Яндекс
	               |			ИЛИ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &Лабиринт
	               |			ИЛИ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &Dalli
	               |			ИЛИ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &ARSexpress
	               |			ИЛИ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &DPD)
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Заказ,
	               |	СУММА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ БанкПП
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реализации КАК Реализации
	               |		ПО ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ = Реализации.заказ
	               |ГДЕ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &ПП
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Реализации.Ссылка КАК Ссылка,
	               |	СУММА(ЕСТЬNULL(Касса.Сумма, 0)) КАК ККМ,
	               |	СУММА(ЕСТЬNULL(КК.Сумма, 0)) КАК КК,
	               |	СУММА(ЕСТЬNULL(ПС.Сумма, 0)) КАК ПС,
	               |	СУММА(ЕСТЬNULL(СОдоллар.Сумма, 0)) КАК СОдоллар,
	               |	СУММА(ЕСТЬNULL(СОевро.Сумма, 0)) КАК СОевро,
	               |	СУММА(ЕСТЬNULL(СОруб.Сумма, 0)) КАК СОруб,
	               |	ЕСТЬNULL(Тов.Поле1, 0) КАК Поле1,
	               |	СУММА(ЕСТЬNULL(Тов.КоличествоУпаковок, 0)) КАК Количество,
	               |	Реализации.Дата КАК Дата,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ККОнлайн.Сумма, 0) > Реализации.СуммаДокумента
	               |				ТОГДА Реализации.СуммаДокумента
	               |			ИНАЧЕ ЕСТЬNULL(ККОнлайн.Сумма, 0)
	               |		КОНЕЦ) КАК ККОнлайн,
	               |	СУММА(ЕСТЬNULL(Банк.Сумма, 0)) КАК Банк,
	               |	СУММА(ЕСТЬNULL(БанкПони.Сумма, 0)) КАК БанкПони,
	               |	СУММА(ЕСТЬNULL(БанкСчет.Сумма, 0)) КАК БанкСчет,
	               |	СУММА(ЕСТЬNULL(БанкПП.Сумма, 0)) КАК БанкПП
	               |ИЗ
	               |	Реализации КАК Реализации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Тов КАК Тов
	               |		ПО Реализации.Ссылка = Тов.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПС КАК ПС
	               |		ПО Реализации.заказ = ПС.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КК КАК КК
	               |		ПО Реализации.заказ = КК.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Касса КАК Касса
	               |		ПО Реализации.заказ = Касса.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СОруб КАК СОруб
	               |		ПО Реализации.заказ = СОруб.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СОевро КАК СОевро
	               |		ПО Реализации.заказ = СОевро.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СОдоллар КАК СОдоллар
	               |		ПО Реализации.заказ = СОдоллар.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ККОнлайн КАК ККОнлайн
	               |		ПО Реализации.заказ = ККОнлайн.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Банк КАК Банк
	               |		ПО Реализации.заказ = Банк.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ БанкСчет КАК БанкСчет
	               |		ПО Реализации.заказ = БанкСчет.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ БанкПони КАК БанкПони
	               |		ПО Реализации.заказ = БанкПони.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ БанкПП КАК БанкПП
	               |		ПО Реализации.заказ = БанкПП.Заказ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Реализации.Ссылка,
	               |	Реализации.Дата,
	               |	ЕСТЬNULL(Тов.Поле1, 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	               |	РеализацияТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	РеализацияТоваровУслугТовары.СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	               |	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	               |	РеализацияТоваровУслугТовары.ПроцентРучнойСкидки + РеализацияТоваровУслугТовары.ПроцентАвтоматическойСкидки КАК Поле1,
	               |	Реализации.Дата КАК Дата,
	               |	Реализации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реализации КАК Реализации
	               |		ПО (Реализации.Ссылка = РеализацияТоваровУслугТовары.Ссылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Реализации.Ссылка КАК Ссылка,
	               |	Реализации.Партнер КАК Партнер,
	               |	Реализации.СуммаДокумента КАК СуммаДокумента,
	               |	Реализации.Дата КАК Дата,
	               |	Реализации.заказ КАК заказ
	               |ИЗ
	               |	Реализации КАК Реализации
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";

	Запрос.УстановитьПараметр("Склад", Подразделение);
	//Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	Запрос.УстановитьПараметр("НачалоПериода", началодня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", конецдня(конецпериода));
	Запрос.УстановитьПараметр("ВидЗаказа", ВидЗаказаМТМ);
	Запрос.УстановитьПараметр("КассаККМ", КассыККМ);
	Запрос.УстановитьПараметр("КассыККМСО", КассыККМСО);
	Запрос.УстановитьПараметр("ВалютаДоллар", справочники.Валюты.НайтиПоКоду("840"));
	Запрос.УстановитьПараметр("Валютаевро", справочники.Валюты.НайтиПоКоду("978"));
	Запрос.УстановитьПараметр("Валютаруб", справочники.Валюты.НайтиПоКоду("643"));
	Запрос.УстановитьПараметр("пони", перечисления.ТипОплатыИМ.пони);
	ЭквайринговыйТерминал = Новый Массив;
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("online"));
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("babochka.ru"));
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("ИМБарниус"));
	
	Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
	Запрос.УстановитьПараметр("счет", перечисления.ТипОплатыИМ.Счет);
	Запрос.УстановитьПараметр("СДЭК", перечисления.ТипОплатыИМ.СДЭК);
	Запрос.УстановитьПараметр("Лабиринт", перечисления.ТипОплатыИМ.ЛабиринтПост);
	Запрос.УстановитьПараметр("Яндекс", перечисления.ТипОплатыИМ.Яндекс);
	Запрос.УстановитьПараметр("Dalli", перечисления.ТипОплатыИМ.Dalli);
	Запрос.УстановитьПараметр("ARSexpress", перечисления.ТипОплатыИМ.ARSexpress);
	Запрос.УстановитьПараметр("DPD", перечисления.ТипОплатыИМ.DPD);
	Запрос.УстановитьПараметр("ПП", перечисления.ТипОплатыИМ.ОнлайнPayPal);
	Запрос.УстановитьПараметр("Оплата", перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	Табдок.Вывести(реализации,1);
	Итогувсех.параметры.итогколво = 0;
	Итогувсех.параметры.итогсумма = 0;
	Итогувсех.параметры.итогскидка = 0;
	Итогувсех.параметры.итогккм = 0;
	Итогувсех.параметры.итогкк = 0;
	Итогсо.параметры.итогсо = 0;
	Итогсо.параметры.итогсоруб = 0;
	Итогсо.параметры.итогсоевро = 0;
	Итогсо.параметры.итогсодоллар = 0;
	Итогпс.параметры.итогпс = 0;
	Итогпред.параметры.итогпред = 0;
	Итогпост.параметры.итогпост = 0;
	Итогувсех.параметры.итогколво = 0;
	Итогбанк.параметры.итогбанк1 = 0;
	ИтогбанкИМ.параметры.итогбанк= 0;
	ИтогбанкИМ.параметры.итогбанксчет= 0;
	ИтогбанкИМ.параметры.итогбанконлайн= 0;
	ИтогбанкИМ.параметры.итогбанкпони= 0;
	ИтогбанкИМ.параметры.итогбанкпп= 0;
	заказы 		= ПакетЗапросов[ПакетЗапросов.ВГраница()].Выбрать();
	детали  	= ПакетЗапросов[ПакетЗапросов.ВГраница()-1].Выбрать();
	заказысуммы  	= ПакетЗапросов[ПакетЗапросов.ВГраница()-2].Выбрать();
	
	пока заказы.Следующий() цикл
		СтрокаДокументсо.параметры.соруб = 0;
		СтрокаДокументсо.параметры.соевро = 0;
		СтрокаДокументсо.параметры.содоллар = 0;

		Коэффициенты = РаботаСКурсамивалютУТ.ПолучитьКоэффициентыПересчетаВалюты(заказы.ссылка.Валюта, Неопределено, заказы.дата);
		СтрокаДокументувсех.параметры.документ = заказы.ссылка;
		СтрокаДокументувсех.параметры.Расшифровка1 = заказы.ссылка;
		СтрокаДокументувсех.параметры.Клиент = заказы.Партнер;
		СтрокаДокументувсех.параметры.сумма = заказы.суммадокумента * Коэффициенты.КоэффициентПересчетаВВалютуРегл;
		СтрокаДокументувсех.параметры.бонус = 0;
		//сообщить(Коэффициенты.КоэффициентПересчетаВВалютуРегл);
		//СтрокаДокументувсех.параметры.колво = заказы.ссылка.товары.итог("КоличествоУпаковок");
		
		заказысуммы.Сбросить();
		Если заказысуммы.НайтиСледующий(заказы.ссылка, "Ссылка") тогда
			
			СтрокаДокументувсех.параметры.колво = заказысуммы.количество;
			СтрокаДокументувсех.параметры.кк = заказысуммы.кк;
			СтрокаДокументувсех.параметры.бонус = 0;
			СтрокаДокументсо.параметры.соруб = заказысуммы.СОруб;
			СтрокаДокументсо.параметры.соевро = заказысуммы.СОевро;
			СтрокаДокументсо.параметры.содоллар = заказысуммы.СОдоллар;
			СтрокаДокументувсех.параметры.ккм = заказысуммы.ккм;
			СтрокаДокументпс.параметры.пс = заказысуммы.ПС;
			
			запросПред = новый Запрос();
			ЗапросПред.Текст = "ВЫБРАТЬ
			                   |	РасчетыСКлиентамиОстатки.СуммаОстаток КАК СуммаОстаток
			                   |ПОМЕСТИТЬ ВТ
			                   |ИЗ
			                   |	РегистрНакопления.РасчетыСКлиентами.Остатки(&период, ЗаказКлиента = &ЗаказКлиента) КАК РасчетыСКлиентамиОстатки
			                   |
			                   |ОБЪЕДИНИТЬ ВСЕ
			                   |
			                   |ВЫБРАТЬ
			                   |	-ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Сумма
			                   |ИЗ
			                   |	Документ.ВозвратТоваровОтКлиента.РасшифровкаПлатежа КАК ВозвратТоваровОтКлиентаРасшифровкаПлатежа
			                   |ГДЕ
			                   |	ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &Период И &КонецПериода
			                   |	И ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка.Проведен
			                   |	И ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Заказ.дата > ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка.Дата
							   |	И ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Заказ = &ЗаказКлиента
			                   |;
			                   |
			                   |////////////////////////////////////////////////////////////////////////////////
			                   |ВЫБРАТЬ
			                   |	СУММА(ВТ.СуммаОстаток) КАК СуммаОстаток
			                   |ИЗ
			                   |	ВТ КАК ВТ";
			ЗапросПред.УстановитьПараметр("Период", НачалоДня(НачалоПериода));
			ЗапросПред.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
			ЗапросПред.УстановитьПараметр("ЗаказКлиента", Заказы.Заказ);
			выб = ЗапросПред.Выполнить().Выбрать();
			Если выб.Следующий() Тогда 
				ПредоплатаСумма = ?(- выб.СуммаОстаток > Заказы.СуммаДокумента, Заказы.СуммаДокумента, - выб.СуммаОстаток);
				СтрокаДокументпред.параметры.пред = ПредоплатаСумма;
			иначе
				СтрокаДокументпред.параметры.пред = 0;
			КонецЕсли;
			
			//РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(ВалютаПриобретения, &Валюта, ДатаПриобретения)
			
			
			СтрокаДокументбанк.параметры.банк1 = заказысуммы.Банк;
			СтрокаДокументбанким.параметры.банксчет = заказысуммы.БанкСчет;
			СтрокаДокументбанким.параметры.банконлайн = заказысуммы.ККОнлайн;
			СтрокаДокументбанким.параметры.банкпони = заказысуммы.БанкПони;
			СтрокаДокументбанким.параметры.банкпп = заказысуммы.БанкПП;
			
			ЗапросПред.УстановитьПараметр("Период", конецдня(конецпериода) + 1);
			выб = ЗапросПред.Выполнить().Выбрать();
			Если выб.Следующий() Тогда
				СтрокаДокументпост.параметры.пост = ?(выб.СуммаОстаток < 0, 0, выб.СуммаОстаток);
			Иначе
				СтрокаДокументпост.параметры.пост = 0;
			КонецЕсли;
			
			Итогувсех.параметры.итогбонус = Итогувсех.параметры.итогбонус + СтрокаДокументувсех.параметры.бонус;
			Итогувсех.параметры.итогкк = Итогувсех.параметры.итогкк + СтрокаДокументувсех.параметры.кк;
			Итогсо.параметры.итогсоруб = Итогсо.параметры.итогсоруб + заказысуммы.СОруб;
			Итогсо.параметры.итогсоевро = Итогсо.параметры.итогсоевро + СтрокаДокументсо.параметры.соевро;
			Итогсо.параметры.итогсодоллар = Итогсо.параметры.итогсодоллар + СтрокаДокументсо.параметры.содоллар;
			Итогсо.параметры.итогсо = Итогсо.параметры.итогсо + заказысуммы.СОруб 
			+ заказысуммы.СОевро *РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("978"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата)	
			+ заказысуммы.СОдоллар*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("840"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата);
			Итогпс.параметры.итогпс = Итогпс.параметры.итогпс + СтрокаДокументпс.параметры.пс;
			Итогпред.параметры.итогпред = Итогпред.параметры.итогпред + СтрокаДокументпред.параметры.пред;
			Итогпост.параметры.итогпост = Итогпост.параметры.итогпост + число(СтрокаДокументпост.параметры.пост);
			Итогувсех.параметры.итогколво = Итогувсех.параметры.итогколво + заказысуммы.количество;
			Итогбанк.параметры.итогбанк1 = Итогбанк.параметры.итогбанк1 + заказысуммы.Банк;
			ИтогбанкИМ.параметры.итогбанк=ИтогбанкИМ.параметры.итогбанк+СтрокаДокументбанким.параметры.банксчет+СтрокаДокументбанким.параметры.банконлайн+СтрокаДокументбанким.параметры.банкпони+СтрокаДокументбанким.параметры.банкпп;
			ИтогбанкИМ.параметры.итогбанксчет= ИтогбанкИМ.параметры.итогбанксчет+СтрокаДокументбанким.параметры.банксчет;
			ИтогбанкИМ.параметры.итогбанконлайн= ИтогбанкИМ.параметры.итогбанконлайн+СтрокаДокументбанким.параметры.банконлайн;
			ИтогбанкИМ.параметры.итогбанкпони=ИтогбанкИМ.параметры.итогбанкпони+СтрокаДокументбанким.параметры.банкпони;
			ИтогбанкИМ.параметры.итогбанкпп=ИтогбанкИМ.параметры.итогбанкпп+СтрокаДокументбанким.параметры.банкпп;
			Итогувсех.параметры.итогсумма = Итогувсех.параметры.итогсумма + заказы.суммадокумента*Коэффициенты.КоэффициентПересчетаВВалютуРегл;			
		
			Итогувсех.параметры.итогккм = Итогувсех.параметры.итогккм + число(СтрокаДокументувсех.параметры.ккм);
		конецесли;
		
		
		
		
		//Итогувсех.параметры.итогкк = Итогувсех.параметры.итогкк + число(СтрокаДокументувсех.параметры.кк);
		////Итог.параметры.итогсо = Итог.параметры.итогсо + число(СтрокаДокумент.параметры.со) ;
		//Итогпс.параметры.итогпс = Итогпс.параметры.итогпс + число(СтрокаДокументпс.параметры.пс) ;
		//Итогпред.параметры.итогпред = Итогпред.параметры.итогпред + число(СтрокаДокументпред.параметры.пред);
		//Итогпост.параметры.итогпост = Итогпост.параметры.итогпост + число(СтрокаДокументпост.параметры.пост);
		
		
	
		Табдок.Вывести(СтрокаДокументувсех,2);
		если ПС тогда
			Табдок.Присоединить(СтрокаДокументпс);
		конецесли;
		если со тогда	
			Табдок.Присоединить(СтрокаДокументсо);
		конецесли;
		если Предоплата тогда
			Табдок.Присоединить(СтрокаДокументпред);
		конецесли;
		если Постоплата тогда
			Табдок.Присоединить(СтрокаДокументпост);
		конецесли;
		если банк тогда
			Табдок.Присоединить(СтрокаДокументбанк);
		конецесли;
		если банким тогда
			Табдок.Присоединить(СтрокаДокументбанким);
		конецесли;
		
		
		детали.Сбросить();
		пока детали.НайтиСледующий(Новый Структура("Ссылка", заказы.ссылка)) цикл
			СтрокаДетали.параметры.номенклатура = строка(детали.номенклатура) + " (" + строка(детали.характеристика) + ")";
			СтрокаДетали.параметры.колво = детали.КоличествоУпаковок;
			Строкадетали.параметры.сумма = детали.сумма*Коэффициенты.КоэффициентПересчетаВВалютуРегл;
		    Строкадетали.параметры.скидка = детали.поле1;
			Строкадетали.параметры.Бонус = детали.СуммаБонусныхБалловКСписаниюВВалюте;   
			//рисунок
			Верх = СтрокаДетали.ВысотаТаблицы;
			если рисунокБ тогда 
				//СтрокаДетали.ВысотаТаблицы = 20;
				ОбластьРисунка = СтрокаДетали.Область(верх,2,верх,2);
				
				Рисунок = СтрокаДетали.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
				попытка
					Рисунок.Картинка = Новый Картинка(ПолучитьИзВременногоХранилища(РаботаСФайлами.ПолучитьДанныеФайла(детали.Номенклатура.ФайлКартинки).СсылкаНаДвоичныеДанныеФайла));// Картинка;
					ОбластьРисунка.высотастроки = 70;
					//Рисунок.
					//СтрокаДетали.Картинка   = Новый Картинка(ПолучитьИзВременногоХранилища(ПрисоединенныеФайлы.ПолучитьДанныеФайла(детали.Номенклатура.ФайлКартинки).СсылкаНаДвоичныеДанныеФайла));// Картинка;
				исключение
					Рисунок.Картинка = Новый Картинка;
					//СтрокаДетали.параметры.рисунок =Новый Картинка;
				конецпопытки;
				Рисунок.ГраницаСверху = ложь;
				Рисунок.ГраницаСлева = ложь;
				Рисунок.ГраницаСправа = ложь;
				Рисунок.ГраницаСнизу = ложь;
				Рисунок.РазмерКартинки = РазмерКартинки.Пропорционально;
				Рисунок.Расположить(ОбластьРисунка);
			иначе
				ОбластьНомен = СтрокаДетали.Область(верх,1,верх,2);
				ОбластьНомен.Объединить();
			конецесли;
			//\\
			Табдок.Вывести(Строкадетали,3,,ложь);
		конеццикла;			
	конеццикла;
	Табдок.Вывести(Итогувсех,1);
	если ПС тогда
		Табдок.Присоединить(Итогпс);
	конецесли;
	если со тогда	
		Табдок.Присоединить(Итогсо);
	конецесли;
	если Предоплата тогда
		Табдок.Присоединить(Итогпред);
	конецесли;
	если Постоплата тогда
		Табдок.Присоединить(Итогпост);
	конецесли;
	если банк тогда
		Табдок.Присоединить(Итогбанк);
	конецесли;
	если банким тогда
		Табдок.Присоединить(Итогбанким);
	конецесли;
	
	ИтогПодрувсех.параметры.итогколво = ИтогПодрувсех.параметры.итогколво + Итогувсех.параметры.итогколво;
	ИтогПодрувсех.параметры.итогсумма = ИтогПодрувсех.параметры.итогсумма + Итогувсех.параметры.итогсумма;
	ИтогПодрувсех.параметры.итогскидка = ИтогПодрувсех.параметры.итогскидка + Итогувсех.параметры.итогскидка;
	ИтогПодрувсех.параметры.итогккм = ИтогПодрувсех.параметры.итогккм + Итогувсех.параметры.итогккм;
	ИтогПодрувсех.параметры.итогкк = ИтогПодрувсех.параметры.итогкк + Итогувсех.параметры.итогкк;
	ИтогПодрсо.параметры.итогсо = ИтогПодрсо.параметры.итогсо + Итогсо.параметры.итогсо;
	ИтогПодрсо.параметры.итогсоруб = ИтогПодрсо.параметры.итогсоруб + Итогсо.параметры.итогсоруб;
	ИтогПодрсо.параметры.итогсоевро = ИтогПодрсо.параметры.итогсоевро + Итогсо.параметры.итогсоевро;
	ИтогПодрсо.параметры.итогсодоллар = ИтогПодрсо.параметры.итогсодоллар + Итогсо.параметры.итогсодоллар;
	ИтогПодрпс.параметры.итогпс = ИтогПодрпс.параметры.итогпс + Итогпс.параметры.итогпс;
	ИтогПодрпред.параметры.итогпред = ИтогПодрпред.параметры.итогпред + Итогпред.параметры.итогпред;
	ИтогПодрпост.параметры.итогпост = ИтогПодрпост.параметры.итогпост + Итогпост.параметры.итогпост;
	ИтогПодрбанк.параметры.итогбанк1 = ИтогПодрбанк.параметры.итогбанк1 + Итогбанк.параметры.итогбанк1;
	ИтогПодрбанкИМ.параметры.итогбанк = ИтогПодрбанкИМ.параметры.итогбанк + ИтогбанкИМ.параметры.итогбанк;
	ИтогПодрбанкИМ.параметры.итогбанксчет = ИтогПодрбанкИМ.параметры.итогбанксчет + ИтогбанкИМ.параметры.итогбанксчет;
	ИтогПодрбанкИМ.параметры.итогбанконлайн = ИтогПодрбанкИМ.параметры.итогбанконлайн + ИтогбанкИМ.параметры.итогбанконлайн;
	ИтогПодрбанкИМ.параметры.итогбанкпони = ИтогПодрбанкИМ.параметры.итогбанкпони + ИтогбанкИМ.параметры.итогбанкпони;
	ИтогПодрбанкИМ.параметры.итогбанкпп = ИтогПодрбанкИМ.параметры.итогбанкпп + ИтогбанкИМ.параметры.итогбанкпп;
#КонецОбласти	

#Область Предоплата
	Итогувсех.параметры.итогколво = 0;
	Итогувсех.параметры.итогсумма = 0;
	Итогувсех.параметры.итогскидка = 0;
	Итогувсех.параметры.итогккм = 0;
	Итогувсех.параметры.итогкк = 0;
	Итогсо.параметры.итогсо = 0;
	Итогсо.параметры.итогсоруб = 0;
	Итогсо.параметры.итогсоевро = 0;
	Итогсо.параметры.итогсодоллар = 0;
	Итогпс.параметры.итогпс = 0;
	Итогпред.параметры.итогпред = 0;
	Итогпост.параметры.итогпост = 0;
	Итогувсех.параметры.итогколво = 0;
	Итогбанк.параметры.итогбанк1 = 0;
	ИтогбанкИМ.параметры.итогбанк= 0;
	ИтогбанкИМ.параметры.итогбанксчет= 0;
	ИтогбанкИМ.параметры.итогбанконлайн= 0;
	ИтогбанкИМ.параметры.итогбанкпони= 0;
	ИтогбанкИМ.параметры.итогбанкпп= 0;

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма КАК Сумма,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка КАК Ссылка,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент КАК партнер,
	               |	0 КАК СУммаКК,
	               |	0 КАК СуммаСОруб,
	               |	0 КАК СуммаСОевро,
	               |	0 КАК СуммаСОдоллар,
	               |	0 КАК СуммаВалевро,
	               |	0 КАК СуммаВалдоллар,
	               |	0 КАК Суммабезнал,
	               |	0 КАК СуммаПС,
	               |	0 КАК СуммаОнлайн
	               |ПОМЕСТИТЬ ОплатыЗаПериод
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассаККМ1)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Сумма,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
	               |ГДЕ
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен
	               |	И НЕ ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ЭквайринговыйТерминал В (&ЭквайринговыйТерминал)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассаККМ2)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта = &Валютаруб
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов,
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассаККМ2)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта = &Валютаевро
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов,
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассаККМ2)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта = &Валютадоллар
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	               |ГДЕ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И НЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ОплатаИМ
	               |	И ВЫРАЗИТЬ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).Подразделение В ИЕРАРХИИ (&Склад)
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Заказ,
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка,
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Сумма,
	               |	0
	               |ИЗ
	               |	Документ.ОплатаПодарочнымСертификатом.РасшифровкаПлатежа КАК ОплатаПодарочнымСертификатомРасшифровкаПлатежа
	               |ГДЕ
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ВЫРАЗИТЬ(ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).Подразделение В ИЕРАРХИИ (&Склад)
	               |	И ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
	               |	И ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Проведен
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Сумма
	               |ИЗ
	               |	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
	               |ГДЕ
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ЭквайринговыйТерминал В(&ЭквайринговыйТерминал)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОплатыЗаПериод.Сумма КАК Сумма,
	               |	ОплатыЗаПериод.Заказ КАК Заказ,
	               |	ОплатыЗаПериод.Ссылка КАК Ссылка,
	               |	ОплатыЗаПериод.партнер КАК партнер,
	               |	ОплатыЗаПериод.СУммаКК КАК СУммаКК,
	               |	ОплатыЗаПериод.СуммаСОруб КАК СуммаСОруб,
	               |	ОплатыЗаПериод.СуммаСОевро КАК СуммаСОевро,
	               |	ОплатыЗаПериод.СуммаСОдоллар КАК СуммаСОдоллар,
	               |	ОплатыЗаПериод.СуммаВалевро КАК СуммаВалевро,
	               |	ОплатыЗаПериод.СуммаВалдоллар КАК СуммаВалдоллар,
	               |	ОплатыЗаПериод.Суммабезнал КАК Суммабезнал,
	               |	ОплатыЗаПериод.СуммаПС КАК СуммаПС,
	               |	ОплатыЗаПериод.СуммаОнлайн КАК СуммаОнлайн
	               |ИЗ
	               |	ОплатыЗаПериод КАК ОплатыЗаПериод
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |			ОплатыЗаПериод.Заказ КАК ЗаказКлиента
	               |		ИЗ
	               |			ОплатыЗаПериод КАК ОплатыЗаПериод
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |				ПО ОплатыЗаПериод.Заказ = РеализацияТоваровУслуг.ЗаказКлиента
	               |					И (РеализацияТоваровУслуг.Проведен)
	               |		ГДЕ
	               |			(РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
	               |					ИЛИ НАЧАЛОПЕРИОДА(ОплатыЗаПериод.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Ссылка.Дата, ДЕНЬ))) КАК СписокЗаказовКлиентов
	               |		ПО ОплатыЗаПериод.Заказ = СписокЗаказовКлиентов.ЗаказКлиента";	
	Запрос.УстановитьПараметр("НачалоПериода", началодня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", конецдня(конецпериода));			   
	Запрос.УстановитьПараметр("КассаККМ1", КассыККМ);
	Запрос.УстановитьПараметр("КассаККМ2", КассыККМСО);
	Запрос.УстановитьПараметр("Склад", подразделение);
	Запрос.УстановитьПараметр("ВалютаДоллар", справочники.Валюты.НайтиПоКоду("840"));
	Запрос.УстановитьПараметр("Валютаевро", справочники.Валюты.НайтиПоКоду("978"));
	Запрос.УстановитьПараметр("Валютаруб", справочники.Валюты.НайтиПоКоду("643"));
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
	ЭквайринговыйТерминал = Новый Массив;
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("online"));
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("babochka.ru"));
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("ИМБарниус"));
	
	Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
	Запрос.УстановитьПараметр("ВидЗаказаМТМ", ВидЗаказаМТМ);
	
	
	Табдок.Вывести(предоплаты,1);
	выборка = Запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл
		попытка
			видз = (выборка.заказ.ВидЗаказа <> ВидЗаказаМТМ);
			если строка(выборка.заказ) <> "" тогда
				запрос = новый запрос();
				запрос.Текст = "ВЫБРАТЬ
				               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
				               |	РеализацияТоваровУслуг.Дата КАК Дата
				               |ИЗ
				               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				               |ГДЕ
				               |	РеализацияТоваровУслуг.ЗаказКлиента = &ЗаказКлиента
				               |	И РеализацияТоваровУслуг.Дата МЕЖДУ &Дата И &Дата1
				               |	И РеализацияТоваровУслуг.Проведен";      //(РеализацияТоваровУслуг.Дата <= &Дата и 
				запрос.УстановитьПараметр("ЗаказКлиента", выборка.заказ);
				запрос.УстановитьПараметр("Дата", началодня(НачалоПериода));
				запрос.УстановитьПараметр("Дата1", конецдня(КонецПериода));
				выбо = запрос.Выполнить().Выбрать();
				если выбо.Следующий() тогда
					видз = ложь;
				конецесли;
			конецесли;	
				
		исключение 
			видз = истина; 
		конецпопытки;
		
		если   видз тогда
			СтрокаДокументувсех.параметры.документ = строка(выборка.ссылка);
			СтрокаДокументувсех.параметры.Расшифровка1 = выборка.ссылка;
			СтрокаДокументувсех.параметры.Клиент = выборка.партнер;
			СтрокаДокументувсех.параметры.бонус = 0;
			СтрокаДокументувсех.параметры.сумма = выборка.сумма + выборка.суммакк + выборка.суммасоруб +выборка.СуммаПС
			+ выборка.СуммаВалевро*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("978"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата) 
			+ выборка.СуммаВалдоллар*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("840"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата)  
			+ выборка.суммаБезнал;
			СтрокаДокументувсех.параметры.ккм = выборка.сумма;
			СтрокаДокументувсех.параметры.кк = выборка.суммакк;	
			СтрокаДокументсо.параметры.соруб = выборка.суммасоруб;
			СтрокаДокументсо.параметры.соевро = выборка.СуммаВалевро;
			СтрокаДокументсо.параметры.содоллар = выборка.СуммаВалдоллар;
			СтрокаДокументпс.параметры.пс = выборка.суммаПС;
			СтрокаДокументпред.параметры.пред = 0;
			СтрокаДокументпост.параметры.пост = 0;
			СтрокаДокументувсех.параметры.колво = 0;
			СтрокаДокументбанк.параметры.банк1 = выборка.суммабезнал;
			СтрокаДокументбанким.параметры.банксчет = 0;
			СтрокаДокументбанким.параметры.банконлайн = выборка.СуммаОнлайн;
			СтрокаДокументбанким.параметры.банкпони = 0;
			СтрокаДокументбанким.параметры.банкпп = 0;
			
			Итогпс.параметры.итогпс = Итогпс.параметры.итогпс + выборка.суммаПС;
			Итогувсех.параметры.итогсумма = Итогувсех.параметры.итогсумма + выборка.сумма + выборка.суммакк + выборка.суммасоруб  + выборка.суммаБезнал
			+ выборка.СуммаВалевро*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("978"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата)
			+ выборка.СуммаВалдоллар*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("840"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата);
			Итогсо.параметры.итогсоруб = Итогсо.параметры.итогсоруб + выборка.СуммаСОруб;
			Итогсо.параметры.итогсоевро = Итогсо.параметры.итогсоевро + выборка.СуммаВалевро;
			Итогсо.параметры.итогсодоллар = Итогсо.параметры.итогсодоллар + выборка.СуммаВалдоллар;
			Итогсо.параметры.итогсо = Итогсо.параметры.итогсо + выборка.СуммаСОруб 
			+ выборка.СуммаВалевро*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("978"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата) 
			+ выборка.СуммаВалдоллар*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("840"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата);
			Итогувсех.параметры.итогкк = Итогувсех.параметры.итогкк + СтрокаДокументувсех.параметры.кк;
			Итогувсех.параметры.итогккм = Итогувсех.параметры.итогккм + СтрокаДокументувсех.параметры.ккм;
			Итогбанк.параметры.итогбанк1 = Итогбанк.параметры.итогбанк1 + СтрокаДокументбанк.параметры.банк1;
			
			ИтогбанкИМ.параметры.итогбанкОнлайн = ИтогбанкИМ.параметры.итогбанкОнлайн + СтрокаДокументбанким.параметры.банконлайн;
			ИтогбанкИМ.параметры.итогбанк = ИтогбанкИМ.параметры.итогбанкОнлайн;
			
			Табдок.Вывести(СтрокаДокументувсех,2);
		если ПС тогда
			Табдок.Присоединить(СтрокаДокументпс);
		конецесли;
		если со тогда	
			Табдок.Присоединить(СтрокаДокументсо);
		конецесли;
		если Предоплата тогда
			Табдок.Присоединить(СтрокаДокументпред);
		конецесли;
		если Постоплата тогда
			Табдок.Присоединить(СтрокаДокументпост);
		конецесли;
		если банк тогда
			Табдок.Присоединить(СтрокаДокументбанк);
		конецесли;
		если банким тогда
			Табдок.Присоединить(СтрокаДокументбанким);
		конецесли;
		конецесли;
		
	конеццикла;
	Табдок.Вывести(Итогувсех,1);
	если ПС тогда
		Табдок.Присоединить(Итогпс);
	конецесли;
	если со тогда	
		Табдок.Присоединить(Итогсо);
	конецесли;
	если Предоплата тогда
		Табдок.Присоединить(Итогпред);
	конецесли;
	если Постоплата тогда
		Табдок.Присоединить(Итогпост);
	конецесли;
	если банк тогда
		Табдок.Присоединить(Итогбанк);
	конецесли;
	если банким тогда
		Табдок.Присоединить(Итогбанким);
	конецесли;
	
	ИтогПодрувсех.параметры.итогколво = ИтогПодрувсех.параметры.итогколво + Итогувсех.параметры.итогколво;
	ИтогПодрувсех.параметры.итогсумма = ИтогПодрувсех.параметры.итогсумма + Итогувсех.параметры.итогсумма;
	ИтогПодрувсех.параметры.итогскидка = ИтогПодрувсех.параметры.итогскидка + Итогувсех.параметры.итогскидка;
	ИтогПодрувсех.параметры.итогккм = ИтогПодрувсех.параметры.итогккм + Итогувсех.параметры.итогккм;
	ИтогПодрувсех.параметры.итогкк = ИтогПодрувсех.параметры.итогкк + Итогувсех.параметры.итогкк;
	ИтогПодрсо.параметры.итогсо = ИтогПодрсо.параметры.итогсо + Итогсо.параметры.итогсо;
	ИтогПодрсо.параметры.итогсоруб = ИтогПодрсо.параметры.итогсоруб + Итогсо.параметры.итогсоруб;
	ИтогПодрсо.параметры.итогсоевро = ИтогПодрсо.параметры.итогсоевро + Итогсо.параметры.итогсоевро;
	ИтогПодрсо.параметры.итогсодоллар = ИтогПодрсо.параметры.итогсодоллар + Итогсо.параметры.итогсодоллар;
	ИтогПодрпс.параметры.итогпс = ИтогПодрпс.параметры.итогпс + Итогпс.параметры.итогпс;
	ИтогПодрпред.параметры.итогпред = ИтогПодрпред.параметры.итогпред + Итогпред.параметры.итогпред;
	ИтогПодрпост.параметры.итогпост = ИтогПодрпост.параметры.итогпост + Итогпост.параметры.итогпост;
	ИтогПодрбанк.параметры.итогбанк1 = ИтогПодрбанк.параметры.итогбанк1 + Итогбанк.параметры.итогбанк1;
	ИтогПодрбанкИМ.параметры.итогбанк = ИтогПодрбанкИМ.параметры.итогбанк + ИтогбанкИМ.параметры.итогбанк;
	ИтогПодрбанкИМ.параметры.итогбанксчет = ИтогПодрбанкИМ.параметры.итогбанксчет + ИтогбанкИМ.параметры.итогбанксчет;
	ИтогПодрбанкИМ.параметры.итогбанконлайн = ИтогПодрбанкИМ.параметры.итогбанконлайн + ИтогбанкИМ.параметры.итогбанконлайн;
	ИтогПодрбанкИМ.параметры.итогбанкпони = ИтогПодрбанкИМ.параметры.итогбанкпони + ИтогбанкИМ.параметры.итогбанкпони;
	ИтогПодрбанкИМ.параметры.итогбанкпп = ИтогПодрбанкИМ.параметры.итогбанкпп + ИтогбанкИМ.параметры.итогбанкпп;
#КонецОбласти

#Область Постоплата
	Итогувсех.параметры.итогколво = 0;
	Итогувсех.параметры.итогсумма = 0;
	Итогувсех.параметры.итогскидка = 0;
	Итогувсех.параметры.итогккм = 0;
	Итогувсех.параметры.итогкк = 0;
	Итогсо.параметры.итогсо = 0;
	Итогсо.параметры.итогсоруб = 0;
	Итогсо.параметры.итогсоевро = 0;
	Итогсо.параметры.итогсодоллар = 0;
	Итогпс.параметры.итогпс = 0;
	Итогпред.параметры.итогпред = 0;
	Итогпост.параметры.итогпост = 0;
	Итогувсех.параметры.итогколво = 0;
	Итогбанк.параметры.итогбанк1 = 0;
	ИтогбанкИМ.параметры.итогбанк= 0;
	ИтогбанкИМ.параметры.итогбанксчет= 0;
	ИтогбанкИМ.параметры.итогбанконлайн= 0;
	ИтогбанкИМ.параметры.итогбанкпони= 0;
	ИтогбанкИМ.параметры.итогбанкпп= 0;

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма КАК Сумма,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка КАК Ссылка,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент КАК партнер,
	               |	0 КАК СУммаКК,
	               |	0 КАК СуммаСОруб,
	               |	0 КАК СуммаСОевро,
	               |	0 КАК СуммаСОдоллар,
	               |	0 КАК СуммаВалевро,
	               |	0 КАК СуммаВалдоллар,
	               |	0 КАК суммаПС,
	               |	0 КАК суммаБезнал,
	               |	0 КАК счет,
	               |	0 КАК пони,
	               |	0 КАК Пп,
	               |	0 КАК Онлайн
	               |ПОМЕСТИТЬ ОплатыЗаПериод
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассаККМ1)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ВЫРАЗИТЬ(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа <> &ВидЗаказа
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Сумма
	               |ИЗ
	               |	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
	               |ГДЕ
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ЭквайринговыйТерминал В(&ЭквайринговыйТерминал)
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ВЫРАЗИТЬ(ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа <> &ВидЗаказа
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Сумма,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
	               |ГДЕ
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
	               |	И НЕ ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ЭквайринговыйТерминал В (&ЭквайринговыйТерминал)
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ВЫРАЗИТЬ(ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа <> &ВидЗаказа
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	ЕСТЬNULL(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма, 0),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассаККМ2)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта = &Валютаруб
	               |	И ВЫРАЗИТЬ(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа <> &ВидЗаказа
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	ЕСТЬNULL(ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов, 0),
	               |	0,
	               |	ЕСТЬNULL(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма, 0),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассаККМ2)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта = &Валютаевро
	               |	И ВЫРАЗИТЬ(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа <> &ВидЗаказа
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	0,
	               |	ЕСТЬNULL(ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов, 0),
	               |	0,
	               |	ЕСТЬNULL(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма, 0),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассаККМ2)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта = &Валютадоллар
	               |	И ВЫРАЗИТЬ(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа <> &ВидЗаказа
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Заказ,
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка,
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Партнер,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Сумма,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ОплатаПодарочнымСертификатом.РасшифровкаПлатежа КАК ОплатаПодарочнымСертификатомРасшифровкаПлатежа
	               |ГДЕ
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&Склад)
	               |	И ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	               |	И ВЫРАЗИТЬ(ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа <> &ВидЗаказа
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	               |ГДЕ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ОплатаИМ = ЛОЖЬ
	               |	И ВЫРАЗИТЬ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).Подразделение В ИЕРАРХИИ (&Склад)
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ВЫРАЗИТЬ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа <> &ВидЗаказа
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	               |ГДЕ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &счет
	               |	И ВЫРАЗИТЬ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).Подразделение В ИЕРАРХИИ (&Склад)
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ВЫРАЗИТЬ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа <> &ВидЗаказа
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	               |ГДЕ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &пони
	               |	И ВЫРАЗИТЬ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).Подразделение В ИЕРАРХИИ (&Склад)
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ВЫРАЗИТЬ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа <> &ВидЗаказа
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма,
	               |	0
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	               |ГДЕ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &пп
	               |	И ВЫРАЗИТЬ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).Подразделение В ИЕРАРХИИ (&Склад)
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ВЫРАЗИТЬ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа <> &ВидЗаказа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОплатыЗаПериод.Сумма КАК Сумма,
	               |	ОплатыЗаПериод.Заказ КАК Заказ,
	               |	ОплатыЗаПериод.Ссылка КАК Ссылка,
	               |	ОплатыЗаПериод.партнер КАК партнер,
	               |	ОплатыЗаПериод.СУммаКК КАК СУммаКК,
	               |	ОплатыЗаПериод.СуммаСОруб КАК СуммаСОруб,
	               |	ОплатыЗаПериод.СуммаСОевро КАК СуммаСОевро,
	               |	ОплатыЗаПериод.СуммаСОдоллар КАК СуммаСОдоллар,
	               |	ОплатыЗаПериод.СуммаВалевро КАК СуммаВалевро,
	               |	ОплатыЗаПериод.СуммаВалдоллар КАК СуммаВалдоллар,
	               |	ОплатыЗаПериод.суммаПС КАК суммаПС,
	               |	ОплатыЗаПериод.суммаБезнал КАК суммаБезнал,
	               |	ОплатыЗаПериод.счет КАК счет,
	               |	ОплатыЗаПериод.пони КАК пони,
	               |	ОплатыЗаПериод.Пп КАК Пп,
	               |	ОплатыЗаПериод.Онлайн КАК Онлайн
	               |ИЗ
	               |	ОплатыЗаПериод КАК ОплатыЗаПериод
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ОплатыЗаПериод.Заказ = РеализацияТоваровУслуг.ЗаказКлиента
	               |			И (РеализацияТоваровУслуг.Проведен)
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ОплатыЗаПериод.Ссылка.Дата, ДЕНЬ) > НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Ссылка.Дата, ДЕНЬ)";	
	Запрос.УстановитьПараметр("НачалоПериода", началодня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", конецдня(конецпериода));			   
	Запрос.УстановитьПараметр("КассаККМ1", КассыККМ);
	Запрос.УстановитьПараметр("КассаККМ2", КассыККМСО);
	Запрос.УстановитьПараметр("Склад", подразделение);
	Запрос.УстановитьПараметр("ВалютаДоллар", справочники.Валюты.НайтиПоКоду("840"));
	Запрос.УстановитьПараметр("Валютаевро", справочники.Валюты.НайтиПоКоду("978"));
	Запрос.УстановитьПараметр("Валютаруб", справочники.Валюты.НайтиПоКоду("643"));
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
	Запрос.УстановитьПараметр("ВидЗаказа", перечисления.ВидыЗаказов.МТМ);
	Запрос.УстановитьПараметр("пони", перечисления.ТипОплатыИМ.пони);
	Запрос.УстановитьПараметр("счет", перечисления.ТипОплатыИМ.Счет);
	Запрос.УстановитьПараметр("онлайн", перечисления.ТипОплатыИМ.онлайн);
	Запрос.УстановитьПараметр("пп", перечисления.ТипОплатыИМ.ОнлайнPayPal);
	ЭквайринговыйТерминал = Новый Массив;
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("online"));
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("babochka.ru"));
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("ИМБарниус"));
	
	Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
	
	Табдок.Вывести(постоплаты,1);
	выборка = Запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл
		если строка(выборка.заказ) <> "" тогда
			
			запрос = новый запрос();
			запрос.Текст = "ВЫБРАТЬ
			               |	РеализацияТоваровУслуг.Ссылка,
			               |	РеализацияТоваровУслуг.Дата
			               |ИЗ
			               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			               |ГДЕ
			               |	РеализацияТоваровУслуг.ЗаказКлиента = &ЗаказКлиента
			               |	И РеализацияТоваровУслуг.Дата между &Дата1 и &Дата2";
			запрос.УстановитьПараметр("ЗаказКлиента", выборка.заказ);
			запрос.УстановитьПараметр("Дата1", началодня(выборка.ссылка.дата));
			запрос.УстановитьПараметр("Дата2", конецдня(выборка.ссылка.дата));
			выбо = запрос.Выполнить().Выбрать();
			если выбо.Следующий() тогда 
				продолжить;
			конецесли;

			СтрокаДокументувсех.параметры.документ = выборка.заказ;
			СтрокаДокументувсех.параметры.Расшифровка1 = выборка.заказ;
			СтрокаДокументувсех.параметры.Клиент = выборка.партнер;
			СтрокаДокументувсех.параметры.бонус = 0;
			СтрокаДокументувсех.параметры.сумма = выборка.сумма + выборка.суммасоруб  +выборка.СуммаПС
			+ выборка.СуммаВалевро*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("978"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата)
			+ выборка.СуммаВалдоллар*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("840"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата) 
			+ выборка.суммакк + выборка.суммапс + выборка.суммаБезнал;
			
			СтрокаДокументувсех.параметры.ккм = выборка.сумма;
			СтрокаДокументувсех.параметры.кк = выборка.суммакк;	
			СтрокаДокументсо.параметры.соруб = выборка.суммасоруб;
			СтрокаДокументсо.параметры.соевро = выборка.СуммаВалевро;
			СтрокаДокументсо.параметры.содоллар = выборка.СуммаВалдоллар;	
			СтрокаДокументпс.параметры.пс =  выборка.суммапс;
			СтрокаДокументпред.параметры.пред = 0;
			СтрокаДокументпост.параметры.пост = 0;
			СтрокаДокументувсех.параметры.колво = 0;
			СтрокаДокументбанк.параметры.банк1 = выборка.суммабезнал;
			//СтрокаДокументбанким.параметры.банксчет = 0;
			//СтрокаДокументбанким.параметры.банконлайн = 0;
			//СтрокаДокументбанким.параметры.банкпони = 0;
			//СтрокаДокументбанким.параметры.банкпп = 0;
			СтрокаДокументбанким.параметры.банксчет = выборка.счет;
			СтрокаДокументбанким.параметры.банконлайн = выборка.онлайн;
			СтрокаДокументбанким.параметры.банкпони = выборка.пони;
			СтрокаДокументбанким.параметры.банкпп = выборка.пп;
			
			ИтогбанкИМ.параметры.итогбанксчет= ИтогбанкИМ.параметры.итогбанксчет+СтрокаДокументбанким.параметры.банксчет;
			ИтогбанкИМ.параметры.итогбанконлайн= ИтогбанкИМ.параметры.итогбанконлайн+СтрокаДокументбанким.параметры.банконлайн;
			ИтогбанкИМ.параметры.итогбанкпони=ИтогбанкИМ.параметры.итогбанкпони+СтрокаДокументбанким.параметры.банкпони;
			ИтогбанкИМ.параметры.итогбанкпп=ИтогбанкИМ.параметры.итогбанкпп+СтрокаДокументбанким.параметры.банкпп;
			
			ИтогбанкИМ.параметры.итогбанк=ИтогбанкИМ.параметры.итогбанк+СтрокаДокументбанким.параметры.банксчет+СтрокаДокументбанким.параметры.банконлайн+СтрокаДокументбанким.параметры.банкпони+СтрокаДокументбанким.параметры.банкпп;
		
			Итогувсех.параметры.итогсумма = Итогувсех.параметры.итогсумма + выборка.сумма + выборка.суммасоруб 
			+ выборка.СуммаВалевро*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("978"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата)
			+ выборка.СуммаВалдоллар*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("840"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата) 
			+ выборка.суммакк + выборка.суммапс+ выборка.суммаБезнал;
			Итогсо.параметры.итогсоруб = Итогсо.параметры.итогсоруб + выборка.СуммаСОруб;
			Итогсо.параметры.итогсоевро = Итогсо.параметры.итогсоевро + выборка.СуммаВалевро;
			Итогсо.параметры.итогсодоллар = Итогсо.параметры.итогсодоллар + выборка.СуммаВалдоллар;
			Итогсо.параметры.итогсо = Итогсо.параметры.итогсо + выборка.СуммаСОруб 
			+ выборка.СуммаВалевро*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("978"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата) 
			+ выборка.СуммаВалдоллар*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("840"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата);
			Итогпс.параметры.итогпс = Итогпс.параметры.итогпс + выборка.суммапс;
			Итогувсех.параметры.итогккм = Итогувсех.параметры.итогккм + СтрокаДокументувсех.параметры.ккм;
			Итогувсех.параметры.итогкк = Итогувсех.параметры.итогкк + СтрокаДокументувсех.параметры.кк;
			итогбанк.параметры.итогбанк1 = итогбанк.параметры.итогбанк1 + СтрокаДокументбанк.параметры.банк1;
			Табдок.Вывести(СтрокаДокументувсех,2);
			если ПС тогда
				Табдок.Присоединить(СтрокаДокументпс);
			конецесли;
			если со тогда	
				Табдок.Присоединить(СтрокаДокументсо);
			конецесли;
			если Предоплата тогда
				Табдок.Присоединить(СтрокаДокументпред);
			конецесли;
			если Постоплата тогда
				Табдок.Присоединить(СтрокаДокументпост);
			конецесли;
			если банк тогда
				Табдок.Присоединить(СтрокаДокументбанк);
			конецесли;
			если банким тогда
				Табдок.Присоединить(СтрокаДокументбанким);
			конецесли;

		конецесли;
		
	конеццикла;
	Табдок.Вывести(Итогувсех,1);
	если ПС тогда
		Табдок.Присоединить(Итогпс);
	конецесли;
	если со тогда	
		Табдок.Присоединить(Итогсо);
	конецесли;
	если Предоплата тогда
		Табдок.Присоединить(Итогпред);
	конецесли;
	если Постоплата тогда
		Табдок.Присоединить(Итогпост);
	конецесли;
	если банк тогда
		Табдок.Присоединить(Итогбанк);
	конецесли;
	если банким тогда
		Табдок.Присоединить(Итогбанким);
	конецесли;
	
	ИтогПодрувсех.параметры.итогколво = ИтогПодрувсех.параметры.итогколво + Итогувсех.параметры.итогколво;
	ИтогПодрувсех.параметры.итогсумма = ИтогПодрувсех.параметры.итогсумма + Итогувсех.параметры.итогсумма;
	ИтогПодрувсех.параметры.итогскидка = ИтогПодрувсех.параметры.итогскидка + Итогувсех.параметры.итогскидка;
	ИтогПодрувсех.параметры.итогккм = ИтогПодрувсех.параметры.итогккм + Итогувсех.параметры.итогккм;
	ИтогПодрувсех.параметры.итогкк = ИтогПодрувсех.параметры.итогкк + Итогувсех.параметры.итогкк;
	ИтогПодрсо.параметры.итогсо = ИтогПодрсо.параметры.итогсо + Итогсо.параметры.итогсо;
	ИтогПодрсо.параметры.итогсоруб = ИтогПодрсо.параметры.итогсоруб + Итогсо.параметры.итогсоруб;
	ИтогПодрсо.параметры.итогсоевро = ИтогПодрсо.параметры.итогсоевро + Итогсо.параметры.итогсоевро;
	ИтогПодрсо.параметры.итогсодоллар = ИтогПодрсо.параметры.итогсодоллар + Итогсо.параметры.итогсодоллар;
	ИтогПодрпс.параметры.итогпс = ИтогПодрпс.параметры.итогпс + Итогпс.параметры.итогпс;
	ИтогПодрпред.параметры.итогпред = ИтогПодрпред.параметры.итогпред + Итогпред.параметры.итогпред;
	ИтогПодрпост.параметры.итогпост = ИтогПодрпост.параметры.итогпост + Итогпост.параметры.итогпост;
	ИтогПодрбанк.параметры.итогбанк1 = ИтогПодрбанк.параметры.итогбанк1 + Итогбанк.параметры.итогбанк1;
	ИтогПодрбанкИМ.параметры.итогбанк = ИтогПодрбанкИМ.параметры.итогбанк + ИтогбанкИМ.параметры.итогбанк;
	ИтогПодрбанкИМ.параметры.итогбанксчет = ИтогПодрбанкИМ.параметры.итогбанксчет + ИтогбанкИМ.параметры.итогбанксчет;
	ИтогПодрбанкИМ.параметры.итогбанконлайн = ИтогПодрбанкИМ.параметры.итогбанконлайн + ИтогбанкИМ.параметры.итогбанконлайн;
	ИтогПодрбанкИМ.параметры.итогбанкпони = ИтогПодрбанкИМ.параметры.итогбанкпони + ИтогбанкИМ.параметры.итогбанкпони;
	ИтогПодрбанкИМ.параметры.итогбанкпп = ИтогПодрбанкИМ.параметры.итогбанкпп + ИтогбанкИМ.параметры.итогбанкпп;
#КонецОбласти

#Область ВозвратыОплаты
	Итогувсех.параметры.итогколво = 0;
	Итогувсех.параметры.итогсумма = 0;
	Итогувсех.параметры.итогскидка = 0;
	Итогувсех.параметры.итогккм = 0;
	Итогувсех.параметры.итогкк = 0;
	Итогсо.параметры.итогсо = 0;
	Итогсо.параметры.итогсоруб = 0;
	Итогсо.параметры.итогсоевро = 0;
	Итогсо.параметры.итогсодоллар = 0;
	Итогпс.параметры.итогпс = 0;
	Итогпред.параметры.итогпред = 0;
	Итогпост.параметры.итогпост = 0;
	Итогувсех.параметры.итогколво = 0;
	Итогбанк.параметры.итогбанк1 = 0;
	ИтогбанкИМ.параметры.итогбанк= 0;
	ИтогбанкИМ.параметры.итогбанксчет= 0;
	ИтогбанкИМ.параметры.итогбанконлайн= 0;
	ИтогбанкИМ.параметры.итогбанкпони= 0;
	ИтогбанкИМ.параметры.итогбанкпп= 0;

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Сумма КАК Сумма,
               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Заказ,
               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка КАК Ссылка,
               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент КАК партнер,
               |	0 КАК суммаСО,
               |	0 КАК СуммаКК,
               |	0 КАК СуммаПС,
               |	0 КАК Банк,
               |	0 КАК СчетОнлайн,
               |	0 КАК Пони,
               |	0 КАК Взаимозачет,
               |	0 КАК Пост,
               |	0 КАК Пп,
               |	0 КАК ББ,
               |	0 КАК Бонусы
               |ИЗ
               |	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
               |ГДЕ
               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
               |	И РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&Склад)
               |	И РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
               |	И РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
               |	И НЕ РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Касса В (&Касса)
               |
               |ОБЪЕДИНИТЬ ВСЕ
               |
               |ВЫБРАТЬ
               |	0,
               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ,
               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка,
               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Контрагент,
               |	0,
               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Сумма,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0
               |ИЗ
               |	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
               |ГДЕ
               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен
               |	И НЕ ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ЭквайринговыйТерминал В (&ЭквайринговыйТерминал)
               |
               |ОБЪЕДИНИТЬ ВСЕ
               |
               |ВЫБРАТЬ
               |	0,
               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Заказ,
               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент,
               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Сумма,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0
               |ИЗ
               |	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
               |ГДЕ
               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
               |	И РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&Склад)
               |	И РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
               |	И РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
               |	И РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Касса В(&Касса)
               |
               |ОБЪЕДИНИТЬ ВСЕ
               |
               |ВЫБРАТЬ
               |	0,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент,
               |	0,
               |	0,
               |	0,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0
               |ИЗ
               |	Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа
               |ГДЕ
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&Склад)
               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &ТипБанк
               |	И НЕ СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ ССЫЛКА Документ.ВозвратПодарочныхСертификатов
			   |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ОплатаИМ
               |
               |ОБЪЕДИНИТЬ ВСЕ
               |
               |ВЫБРАТЬ
               |	0,
               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ,
               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка,
               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Контрагент,
               |	0,
               |	0,
               |	0,
               |	0,
               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Сумма,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0
               |ИЗ
               |	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
               |ГДЕ
               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен
               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ЭквайринговыйТерминал В(&ЭквайринговыйТерминал)
               |
               |ОБЪЕДИНИТЬ ВСЕ
               |
               |ВЫБРАТЬ
               |	0,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0
               |ИЗ
               |	Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа
               |ГДЕ
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&Склад)
               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
               |	И (СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &ТипПони
			   |		ИЛИ СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &ТипЯндекс)
               |	И НЕ СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ ССЫЛКА Документ.ВозвратПодарочныхСертификатов
			   |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ОплатаИМ
               |
               |ОБЪЕДИНИТЬ ВСЕ
               |
               |ВЫБРАТЬ
               |	0,
               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.ПодарочныйСертификат,
               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка,
               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Контрагент,
               |	0,
               |	0,
               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Сумма,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0
               |ИЗ
               |	Документ.ОплатаПодарочнымСертификатом.РасшифровкаПлатежа КАК ОплатаПодарочнымСертификатомРасшифровкаПлатежа
               |ГДЕ
               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
               |	И ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
               |	И ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&Склад)
               |	И ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
               |
               |ОБЪЕДИНИТЬ ВСЕ
               |
               |ВЫБРАТЬ
               |	0,
               |	ВзаимозачетЗадолженностиКредиторскаяЗадолженность.Ссылка,
               |	ВзаимозачетЗадолженностиКредиторскаяЗадолженность.Заказ,
               |	ВзаимозачетЗадолженностиКредиторскаяЗадолженность.Ссылка.КонтрагентКредитор,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	ВзаимозачетЗадолженностиКредиторскаяЗадолженность.СуммаРегл,
               |	0,
               |	0,
               |	0,
               |	0
               |ИЗ
               |	Документ.ВзаимозачетЗадолженности.КредиторскаяЗадолженность КАК ВзаимозачетЗадолженностиКредиторскаяЗадолженность
               |ГДЕ
               |	ВзаимозачетЗадолженностиКредиторскаяЗадолженность.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
               |	И ВзаимозачетЗадолженностиКредиторскаяЗадолженность.Ссылка.Подразделение В ИЕРАРХИИ(&Склад)
               |	И ВзаимозачетЗадолженностиКредиторскаяЗадолженность.Ссылка.Проведен
               |
               |ОБЪЕДИНИТЬ ВСЕ
               |
               |ВЫБРАТЬ
               |	0,
               |	ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка,
               |	ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Заказ,
               |	ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка.Контрагент,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Сумма,
               |	0,
               |	0,
               |	0,
               |	0
               |ИЗ
               |	Документ.ВозвратТоваровОтКлиента.РасшифровкаПлатежа КАК ВозвратТоваровОтКлиентаРасшифровкаПлатежа
               |ГДЕ
               |	ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
               |	И ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&Склад)
               |	И ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка.Проведен
               |	И ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Заказ ССЫЛКА Документ.ЗаказКлиента
               |	И (ВЫРАЗИТЬ(ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка.ДокументРеализации КАК Документ.РеализацияТоваровУслуг).ЗаказКлиента <> ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Заказ
               |			ИЛИ ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка.ДокументРеализации ССЫЛКА Документ.ОтчетОРозничныхПродажах)
               |
               |ОБЪЕДИНИТЬ ВСЕ
               |
               |ВЫБРАТЬ
               |	0,
               |	ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка,
               |	ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Заказ,
               |	ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка.Контрагент,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Сумма,
               |	0,
               |	0,
               |	0
               |ИЗ
               |	Документ.ВозвратТоваровОтКлиента.РасшифровкаПлатежа КАК ВозвратТоваровОтКлиентаРасшифровкаПлатежа
               |ГДЕ
               |	ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
               |	И ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&Склад)
               |	И ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка.Проведен
               |	И ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Заказ ССЫЛКА Документ.ЗаказКлиента
               |	И ВЫРАЗИТЬ(ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Ссылка.ДокументРеализации КАК Документ.РеализацияТоваровУслуг).ЗаказКлиента = ВозвратТоваровОтКлиентаРасшифровкаПлатежа.Заказ
               |
               |ОБЪЕДИНИТЬ ВСЕ
               |
               |ВЫБРАТЬ
               |	0,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма,
               |	0,
               |	0
               |ИЗ
               |	Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа
               |ГДЕ
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&Склад)
               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &ТипПп
               |	И НЕ СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ ССЫЛКА Документ.ВозвратПодарочныхСертификатов  
			   |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ОплатаИМ
               |
               |ОБЪЕДИНИТЬ ВСЕ
               |
               |ВЫБРАТЬ
               |	0,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма,
               |	0
               |ИЗ
               |	Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа
               |ГДЕ
               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&Склад)
               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ОплатаИМ = ЛОЖЬ
               |	И НЕ СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ ССЫЛКА Документ.ВозвратПодарочныхСертификатов
               |
               |ОБЪЕДИНИТЬ ВСЕ
               |
               |ВЫБРАТЬ
               |	0,
               |	ВозвратТоваровОтКлиента.Ссылка,
               |	ВозвратТоваровОтКлиента.Ссылка,
               |	ВозвратТоваровОтКлиента.Ссылка.Контрагент,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	0,
               |	ВозвратТоваровОтКлиента.СуммаДокумента
               |ИЗ
               |	Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
               |ГДЕ
               |	ВозвратТоваровОтКлиента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
               |	И ВозвратТоваровОтКлиента.Подразделение В ИЕРАРХИИ(&Склад)
               |	И ВозвратТоваровОтКлиента.Проведен
               |	И ВозвратТоваровОтКлиента.ВернутьБонусами";
	
	Запрос.УстановитьПараметр("НачалоПериода", началодня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", конецдня(конецпериода));			   
	Запрос.УстановитьПараметр("Склад", подразделение);
	Запрос.УстановитьПараметр("Касса", КассыСО);
	Запрос.УстановитьПараметр("ТипПони", перечисления.ТипОплатыИМ.Пони);   
	Запрос.УстановитьПараметр("ТипПп", перечисления.ТипОплатыИМ.ОнлайнPayPal);
	Запрос.УстановитьПараметр("ТипЯндекс", перечисления.ТипОплатыИМ.Яндекс);
	Запрос.УстановитьПараметр("ТипОнлайн", перечисления.ТипОплатыИМ.Онлайн);
	Запрос.УстановитьПараметр("ТипБанк", перечисления.ТипОплатыИМ.Счет);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
	ЭквайринговыйТерминал = Новый Массив;
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("online"));
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("babochka.ru"));
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("ИМБарниус"));
	
	Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
	
	Табдок.Вывести(возвратысумма,1);
	выборка = Запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл

			СтрокаДокументувсех.параметры.колво = "";
			СтрокаДокументувсех.параметры.бонус = выборка.Бонусы;
			СтрокаДокументувсех.параметры.документ = выборка.заказ;
			СтрокаДокументувсех.параметры.Расшифровка1 = выборка.заказ;
			СтрокаДокументувсех.параметры.Клиент = выборка.партнер;
			СтрокаДокументувсех.параметры.сумма = выборка.сумма + выборка.суммасо + выборка.суммакк + выборка.суммапс + выборка.Банк+выборка.СчетОнлайн+выборка.Пони+выборка.Взаимозачет+выборка.пост + выборка.бб;
			СтрокаДокументувсех.параметры.ккм = выборка.сумма;
			СтрокаДокументувсех.параметры.кк = выборка.суммакк;	
			СтрокаДокументсо.параметры.соруб = выборка.суммаСО;
			СтрокаДокументсо.параметры.соевро = 0;
			СтрокаДокументсо.параметры.содоллар = 0;
			СтрокаДокументпс.параметры.пс =  выборка.суммапс;
			СтрокаДокументпред.параметры.пред = выборка.Взаимозачет;
			СтрокаДокументпост.параметры.пост = выборка.пост;
			СтрокаДокументбанк.параметры.банк1 = выборка.бб;
			СтрокаДокументбанким.параметры.банксчет = выборка.Банк;
			СтрокаДокументбанким.параметры.банконлайн = выборка.счетонлайн;
			СтрокаДокументбанким.параметры.банкпони = выборка.пони;
			СтрокаДокументбанким.параметры.банкпп = выборка.пп;
			Итогувсех.параметры.итогколво = "";
			Итогувсех.параметры.итогсумма = Итогувсех.параметры.итогсумма + выборка.сумма + выборка.суммасо + выборка.суммакк + выборка.суммапс + выборка.Банк+выборка.СчетОнлайн+выборка.Пони+выборка.Пп + выборка.бб+выборка.Взаимозачет;
			Итогсо.параметры.итогсо =  Итогсо.параметры.итогсо+СтрокаДокументсо.параметры.соруб;
			Итогсо.параметры.итогсоруб = Итогсо.параметры.итогсоруб+СтрокаДокументсо.параметры.соруб;
			Итогувсех.параметры.итогкк = Итогувсех.параметры.итогкк + выборка.суммакк;
			Итогувсех.параметры.итогккм = Итогувсех.параметры.итогккм + выборка.сумма;
			Итогувсех.параметры.итогбонус = Итогувсех.параметры.итогбонус + выборка.Бонусы;
			ИтогбанкИМ.параметры.итогбанксчет=ИтогбанкИМ.параметры.итогбанксчет +СтрокаДокументбанким.параметры.банксчет;
			ИтогбанкИМ.параметры.итогбанконлайн=ИтогбанкИМ.параметры.итогбанконлайн +СтрокаДокументбанким.параметры.банконлайн;
			ИтогбанкИМ.параметры.итогбанкпп=ИтогбанкИМ.параметры.итогбанкпп +СтрокаДокументбанким.параметры.банкпп;
			ИтогбанкИМ.параметры.итогбанк=ИтогбанкИМ.параметры.итогбанк +СтрокаДокументбанким.параметры.банксчет+СтрокаДокументбанким.параметры.банконлайн+СтрокаДокументбанким.параметры.банкпони+СтрокаДокументбанким.параметры.банкпп;
	        Итогпс.параметры.итогпс = Итогпс.параметры.итогпс + выборка.суммапс;
			Итогпред.параметры.итогпред = Итогпред.параметры.итогпред + СтрокаДокументпред.параметры.пред;
			Итогпост.параметры.итогпост = Итогпост.параметры.итогпост + СтрокаДокументпост.параметры.пост;
			Итогбанк.параметры.итогбанк1 = Итогбанк.параметры.итогбанк1 + СтрокаДокументбанк.параметры.банк1;
			Табдок.Вывести(СтрокаДокументувсех,2);
			
			если ПС тогда
				Табдок.Присоединить(СтрокаДокументпс);
			конецесли;
			если со тогда	
				Табдок.Присоединить(СтрокаДокументсо);
			конецесли;
			если Предоплата тогда
				Табдок.Присоединить(СтрокаДокументпред);
			конецесли;
			если Постоплата тогда
				Табдок.Присоединить(СтрокаДокументпост);
			конецесли;
			если банк тогда
				Табдок.Присоединить(СтрокаДокументбанк);
			конецесли;
			если банким тогда
				Табдок.Присоединить(СтрокаДокументбанким);
			конецесли;

		
	конеццикла;
	Табдок.Вывести(Итогувсех,1);
	если ПС тогда
		Табдок.Присоединить(Итогпс);
	конецесли;
	если со тогда	
		Табдок.Присоединить(Итогсо);
	конецесли;
	если Предоплата тогда
		Табдок.Присоединить(Итогпред);
	конецесли;
	если Постоплата тогда
		Табдок.Присоединить(Итогпост);
	конецесли;
	если банк тогда
		Табдок.Присоединить(Итогбанк);
	конецесли;
	если банким тогда
		Табдок.Присоединить(Итогбанким);
	конецесли;


	//ИтогПодрувсех.параметры.итогколво = ИтогПодрувсех.параметры.итогколво - Итогувсех.параметры.итогколво;
	//ИтогПодрувсех.параметры.итогсумма = ИтогПодрувсех.параметры.итогсумма - Итогувсех.параметры.итогсумма;
	//ИтогПодрувсех.параметры.итогскидка = ИтогПодрувсех.параметры.итогскидка - Итогувсех.параметры.итогскидка;
	//ИтогПодрувсех.параметры.итогккм = ИтогПодрувсех.параметры.итогккм - Итогувсех.параметры.итогккм;
	//ИтогПодрувсех.параметры.итогкк = ИтогПодрувсех.параметры.итогкк - Итогувсех.параметры.итогкк;
	//ИтогПодрсо.параметры.итогсо = ИтогПодрсо.параметры.итогсо - Итогсо.параметры.итогсо;
	//ИтогПодрсо.параметры.итогсоруб = ИтогПодрсо.параметры.итогсоруб - Итогсо.параметры.итогсоруб;
	//ИтогПодрсо.параметры.итогсоевро = ИтогПодрсо.параметры.итогсоевро - Итогсо.параметры.итогсоевро;
	//ИтогПодрсо.параметры.итогсодоллар = ИтогПодрсо.параметры.итогсодоллар - Итогсо.параметры.итогсодоллар;
	//ИтогПодрпс.параметры.итогпс = ИтогПодрпс.параметры.итогпс - Итогпс.параметры.итогпс;
	////ИтогПодрпред.параметры.итогпред = ИтогПодрпред.параметры.итогпред - Итогпред.параметры.итогпред;
	////ИтогПодрпост.параметры.итогпост = ИтогПодрпост.параметры.итогпост - Итогпост.параметры.итогпост;
	//ИтогПодрбанк.параметры.итогбанк1 = ИтогПодрбанк.параметры.итогбанк1 - Итогбанк.параметры.итогбанк1;
	//ИтогПодрбанкИМ.параметры.итогбанк = ИтогПодрбанкИМ.параметры.итогбанк - ИтогбанкИМ.параметры.итогбанк;
	//ИтогПодрбанкИМ.параметры.итогбанксчет = ИтогПодрбанкИМ.параметры.итогбанксчет - ИтогбанкИМ.параметры.итогбанксчет;
	//ИтогПодрбанкИМ.параметры.итогбанконлайн = ИтогПодрбанкИМ.параметры.итогбанконлайн - ИтогбанкИМ.параметры.итогбанконлайн;
	//ИтогПодрбанкИМ.параметры.итогбанкпони = ИтогПодрбанкИМ.параметры.итогбанкпони - ИтогбанкИМ.параметры.итогбанкпони;
	//ИтогПодрбанкИМ.параметры.итогбанкпп = ИтогПодрбанкИМ.параметры.итогбанкпп - ИтогбанкИМ.параметры.итогбанкпп;
#КонецОбласти

#Область Сертификаты
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РеализацияПодарочныхСертификатов.Ссылка,
	               |	РеализацияПодарочныхСертификатов.Партнер,
	               |	РеализацияПодарочныхСертификатов.СуммаДокумента,
	               |	РеализацияПодарочныхСертификатов.ПолученоНаличными,
	               |	РеализацияПодарочныхСертификатов.Дата КАК Дата
	               |ИЗ
	               |	Документ.РеализацияПодарочныхСертификатов КАК РеализацияПодарочныхСертификатов
	               |ГДЕ
	               |	РеализацияПодарочныхСертификатов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РеализацияПодарочныхСертификатов.КассаККМ В (&КассаККМ)
	               |	И РеализацияПодарочныхСертификатов.Статус = &Статус";
	Запрос.УстановитьПараметр("КассаККМ", КассыККМ);
	Запрос.УстановитьПараметр("НачалоПериода", началодня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", конецдня(конецпериода));
	Запрос.УстановитьПараметр("Статус", перечисления.СтатусыЧековККМ.Пробит);
	чеки = Запрос.Выполнить().Выбрать();
	Табдок.Вывести(Сертификаты,1);
	Итогувсех.параметры.итогколво = 0;
	Итогувсех.параметры.итогсумма = 0;
	Итогувсех.параметры.итогскидка = 0;
	Итогувсех.параметры.итогккм = 0;
	Итогувсех.параметры.итогбонус = 0;
	Итогувсех.параметры.итогкк = 0;
	Итогсо.параметры.итогсо = 0;
	Итогсо.параметры.итогсоруб = 0;
	Итогсо.параметры.итогсоевро = 0;
	Итогсо.параметры.итогсодоллар = 0;
	Итогпс.параметры.итогпс = 0;
	Итогпред.параметры.итогпред = 0;
	Итогпост.параметры.итогпост = 0;
	Итогувсех.параметры.итогколво = 0;
	Итогбанк.параметры.итогбанк1 = 0;
	ИтогбанкИМ.параметры.итогбанк= 0;
	ИтогбанкИМ.параметры.итогбанксчет= 0;
	ИтогбанкИМ.параметры.итогбанконлайн= 0;
	ИтогбанкИМ.параметры.итогбанкпони= 0;
	ИтогбанкИМ.параметры.итогбанкпп= 0;
	
	пока чеки.Следующий() цикл
		СтрокаДокументувсех.параметры.документ = чеки.ссылка;//чеки.ссылка;
		СтрокаДокументувсех.параметры.Расшифровка1 = чеки.ссылка;
		СтрокаДокументувсех.параметры.Клиент = чеки.Партнер;
		СтрокаДокументувсех.параметры.сумма = чеки.суммадокумента;
		СтрокаДокументувсех.параметры.бонус = 0;
		пред = 0;
		
		если  не чеки.ссылка.безвозмездно и не чеки.ссылка.безнал  тогда
			СтрокаДокументувсех.параметры.ккм = чеки.ПолученоНаличными - (чеки.ссылка.ОплатаПлатежнымиКартами.Итог("Сумма")  
				+ чеки.ссылка.ПолученоНаличными + чеки.ссылка.ВалютнаяОплата.Итог("СуммаРуб") - чеки.ссылка.СуммаДокумента);
		иначе
			СтрокаДокументувсех.параметры.ккм = 0;
		конецесли;
		
		//СтрокаДокумент.параметры.пост = чеки.постоплата;
		
		Итогувсех.параметры.итогсумма = Итогувсех.параметры.итогсумма + чеки.суммадокумента;
		Итогувсех.параметры.итогккм = Итогувсех.параметры.итогккм + СтрокаДокументувсех.параметры.ккм;
		Итогпост.параметры.итогпост = 0;
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РеализацияПодарочныхСертификатовОплатаПлатежнымиКартами.Ссылка,
		               |	СУММА(РеализацияПодарочныхСертификатовОплатаПлатежнымиКартами.Сумма) КАК Сумма
		               |ПОМЕСТИТЬ КК
		               |ИЗ
		               |	Документ.РеализацияПодарочныхСертификатов.ОплатаПлатежнымиКартами КАК РеализацияПодарочныхСертификатовОплатаПлатежнымиКартами
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияПодарочныхСертификатовОплатаПлатежнымиКартами.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РеализацияПодарочныхСертификатовВалютнаяОплата.Ссылка,
		               |	СУММА(РеализацияПодарочныхСертификатовВалютнаяОплата.СуммаРуб) КАК СуммаРуб
		               |ПОМЕСТИТЬ СОруб
		               |ИЗ
		               |	Документ.РеализацияПодарочныхСертификатов.ВалютнаяОплата КАК РеализацияПодарочныхСертификатовВалютнаяОплата
		               |ГДЕ
		               |	РеализацияПодарочныхСертификатовВалютнаяОплата.Валюта = &Валютаруб
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияПодарочныхСертификатовВалютнаяОплата.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РеализацияПодарочныхСертификатовВалютнаяОплата.Ссылка,
		               |	СУММА(РеализацияПодарочныхСертификатовВалютнаяОплата.СуммаРуб) КАК СуммаРуб,
		               |	РеализацияПодарочныхСертификатовВалютнаяОплата.СуммаВал
		               |ПОМЕСТИТЬ СОевро
		               |ИЗ
		               |	Документ.РеализацияПодарочныхСертификатов.ВалютнаяОплата КАК РеализацияПодарочныхСертификатовВалютнаяОплата
		               |ГДЕ
		               |	РеализацияПодарочныхСертификатовВалютнаяОплата.Валюта = &Валютаевро
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияПодарочныхСертификатовВалютнаяОплата.Ссылка,
		               |	РеализацияПодарочныхСертификатовВалютнаяОплата.СуммаВал
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РеализацияПодарочныхСертификатовВалютнаяОплата.Ссылка,
		               |	СУММА(РеализацияПодарочныхСертификатовВалютнаяОплата.СуммаРуб) КАК СуммаРуб,
		               |	РеализацияПодарочныхСертификатовВалютнаяОплата.СуммаВал
		               |ПОМЕСТИТЬ СОдоллар
		               |ИЗ
		               |	Документ.РеализацияПодарочныхСертификатов.ВалютнаяОплата КАК РеализацияПодарочныхСертификатовВалютнаяОплата
		               |ГДЕ
		               |	РеализацияПодарочныхСертификатовВалютнаяОплата.Валюта = &Валютадоллар
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияПодарочныхСертификатовВалютнаяОплата.Ссылка,
		               |	РеализацияПодарочныхСертификатовВалютнаяОплата.СуммаВал
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СУММА(ЕСТЬNULL(КК.Сумма, 0)) КАК СуммаЭТ,
		               |	РеализацияПодарочныхСертификатов.Ссылка,
		               |	СУММА(ЕСТЬNULL(СО.СуммаРуб, 0)) КАК СуммаСОруб,
		               |	ЕСТЬNULL(СОдоллар.СуммаРуб, 0) КАК СуммаСодоллар,
		               |	ЕСТЬNULL(СОдоллар.СуммаВал, 0) КАК СуммаВалдоллар,
		               |	ЕСТЬNULL(СОевро.СуммаРуб, 0) КАК СуммаСОевро,
		               |	ЕСТЬNULL(СОевро.СуммаВал, 0) КАК СуммаВалевро
		               |ИЗ
		               |	Документ.РеализацияПодарочныхСертификатов КАК РеализацияПодарочныхСертификатов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ СОруб КАК СО
		               |		ПО РеализацияПодарочныхСертификатов.Ссылка = СО.Ссылка
		               |		ЛЕВОЕ СОЕДИНЕНИЕ КК КАК КК
		               |		ПО (КК.Ссылка = РеализацияПодарочныхСертификатов.Ссылка)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ СОевро КАК СОевро
		               |		ПО РеализацияПодарочныхСертификатов.Ссылка = СОевро.Ссылка
		               |		ЛЕВОЕ СОЕДИНЕНИЕ СОдоллар КАК СОдоллар
		               |		ПО РеализацияПодарочныхСертификатов.Ссылка = СОдоллар.Ссылка
		               |ГДЕ
		               |	РеализацияПодарочныхСертификатов.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияПодарочныхСертификатов.Ссылка,
		               |	ЕСТЬNULL(СОдоллар.СуммаРуб, 0),
		               |	ЕСТЬNULL(СОдоллар.СуммаВал, 0),
		               |	ЕСТЬNULL(СОевро.СуммаРуб, 0),
		               |	ЕСТЬNULL(СОевро.СуммаВал, 0)";
		Запрос.УстановитьПараметр("Ссылка", чеки.ссылка);
		Запрос.УстановитьПараметр("ВалютаДоллар", справочники.Валюты.НайтиПоКоду("840"));
		Запрос.УстановитьПараметр("Валютаевро", справочники.Валюты.НайтиПоКоду("978"));
		Запрос.УстановитьПараметр("Валютаруб", справочники.Валюты.НайтиПоКоду("643"));
		чекисуммы = Запрос.Выполнить().Выбрать();
		если чекисуммы.Следующий() тогда
			СтрокаДокументувсех.параметры.колво = 0;
			//СтрокаДокумент.параметры.скидка = формат(чекисуммы.Скидка, "ЧДЦ=2");	
			СтрокаДокументувсех.параметры.кк = чекисуммы.СуммаЭТ;	
			СтрокаДокументсо.параметры.соруб = чекисуммы.СуммаСОруб;
			СтрокаДокументсо.параметры.соевро = чекисуммы.СуммаВалЕвро;
			СтрокаДокументсо.параметры.содоллар = чекисуммы.СуммаВалДоллар;	
			СтрокаДокументпс.параметры.пс = 0;
			СтрокаДокументпред.параметры.пред = 0;
			СтрокаДокументпост.параметры.пост = 0;
			СтрокаДокументбанк.параметры.банк1 = 0;
			СтрокаДокументбанким.параметры.банксчет = 0;
			СтрокаДокументбанким.параметры.банконлайн = 0;
			СтрокаДокументбанким.параметры.банкпони = 0;
			СтрокаДокументбанким.параметры.банкпп = 0;
			Итогувсех.параметры.итогкк = Итогувсех.параметры.итогкк + чекисуммы.СуммаЭТ;
			Итогсо.параметры.итогсоруб = Итогсо.параметры.итогсоруб + чекисуммы.СуммаСОруб;
			Итогсо.параметры.итогсоевро = Итогсо.параметры.итогсоевро + чекисуммы.СуммаВалЕвро;
			Итогсо.параметры.итогсодоллар = Итогсо.параметры.итогсодоллар + чекисуммы.СуммаВалДоллар;
			Итогсо.параметры.итогсо = Итогсо.параметры.итогсо + чекисуммы.СуммаСОруб + чекисуммы.СуммаСОевро + чекисуммы.СуммаСОдоллар;
		конецесли;
		
		если чеки.ссылка.безнал тогда
			запрос = новый запрос();
			запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	СУММА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма) КАК Сумма,
			               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ
			               |ИЗ
			               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
			               |ГДЕ
			               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ = &Заказ
			               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ";
			запрос.УстановитьПараметр("Заказ", чеки.ссылка);
			чекисуммы = Запрос.Выполнить().Выбрать();
			если чекисуммы.Следующий() тогда
				СтрокаДокументбанк.параметры.банк1 = чекисуммы.сумма;
				Итогбанк.параметры.итогбанк1 = Итогбанк.параметры.итогбанк1 + чекисуммы.сумма;
			конецесли;
			
		конецесли;
		
		Табдок.Вывести(СтрокаДокументувсех,2);
		
		если ПС тогда
			Табдок.Присоединить(СтрокаДокументпс);
		конецесли;
		если со тогда	
			Табдок.Присоединить(СтрокаДокументсо);
		конецесли;
		если Предоплата тогда
			Табдок.Присоединить(СтрокаДокументпред);
		конецесли;
		если Постоплата тогда
			Табдок.Присоединить(СтрокаДокументпост);
		конецесли;
		если банк тогда
			Табдок.Присоединить(СтрокаДокументбанк);
		конецесли;
		если банким тогда
			Табдок.Присоединить(СтрокаДокументбанким);
		конецесли;

		запрос = новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РеализацияПодарочныхСертификатовПодарочныеСертификаты.Сумма,
		               |	РеализацияПодарочныхСертификатовПодарочныеСертификаты.ПодарочныйСертификат
		               |ИЗ
		               |	Документ.РеализацияПодарочныхСертификатов.ПодарочныеСертификаты КАК РеализацияПодарочныхСертификатовПодарочныеСертификаты
		               |ГДЕ
		               |	РеализацияПодарочныхСертификатовПодарочныеСертификаты.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", чеки.ссылка);
		детали = запрос.Выполнить().Выбрать();
		пока детали.Следующий() цикл
			СтрокаДетали.параметры.номенклатура = детали.ПодарочныйСертификат;
			СтрокаДетали.параметры.колво = 0;
			Строкадетали.параметры.сумма = детали.сумма;
		    Строкадетали.параметры.скидка = 0;
			Верх = СтрокаДетали.ВысотаТаблицы;;
			ОбластьНомен = СтрокаДетали.Область(верх,1,верх,2);
			ОбластьНомен.Объединить();
			Табдок.Вывести(Строкадетали,3,,ложь);
		конеццикла;			
	конеццикла;
	Табдок.Вывести(Итогувсех,1);
	если ПС тогда
		Табдок.Присоединить(Итогпс);
	конецесли;
	если со тогда	
		Табдок.Присоединить(Итогсо);
	конецесли;
	если Предоплата тогда
		Табдок.Присоединить(Итогпред);
	конецесли;
	если Постоплата тогда
		Табдок.Присоединить(Итогпост);
	конецесли;
	если банк тогда
		Табдок.Присоединить(Итогбанк);
	конецесли;
	если банким тогда
		Табдок.Присоединить(Итогбанким);
	конецесли;

	ИтогПодрувсех.параметры.итогколво = ИтогПодрувсех.параметры.итогколво + Итогувсех.параметры.итогколво;
	ИтогПодрувсех.параметры.итогсумма = ИтогПодрувсех.параметры.итогсумма + Итогувсех.параметры.итогсумма;
	ИтогПодрувсех.параметры.итогскидка = ИтогПодрувсех.параметры.итогскидка + Итогувсех.параметры.итогскидка;
	ИтогПодрувсех.параметры.итогккм = ИтогПодрувсех.параметры.итогккм + Итогувсех.параметры.итогккм;
	ИтогПодрувсех.параметры.итогкк = ИтогПодрувсех.параметры.итогкк + Итогувсех.параметры.итогкк;
	ИтогПодрсо.параметры.итогсо = ИтогПодрсо.параметры.итогсо + Итогсо.параметры.итогсо;
	ИтогПодрсо.параметры.итогсоруб = ИтогПодрсо.параметры.итогсоруб + Итогсо.параметры.итогсоруб;
	ИтогПодрсо.параметры.итогсоевро = ИтогПодрсо.параметры.итогсоевро + Итогсо.параметры.итогсоевро;
	ИтогПодрсо.параметры.итогсодоллар = ИтогПодрсо.параметры.итогсодоллар + Итогсо.параметры.итогсодоллар;
	ИтогПодрпс.параметры.итогпс = ИтогПодрпс.параметры.итогпс + Итогпс.параметры.итогпс;
	ИтогПодрпред.параметры.итогпред = ИтогПодрпред.параметры.итогпред + Итогпред.параметры.итогпред;
	ИтогПодрпост.параметры.итогпост = ИтогПодрпост.параметры.итогпост + Итогпост.параметры.итогпост;
	ИтогПодрбанк.параметры.итогбанк1 = ИтогПодрбанк.параметры.итогбанк1 + Итогбанк.параметры.итогбанк1;
	ИтогПодрбанкИМ.параметры.итогбанк = ИтогПодрбанкИМ.параметры.итогбанк + ИтогбанкИМ.параметры.итогбанк;
	ИтогПодрбанкИМ.параметры.итогбанксчет = ИтогПодрбанкИМ.параметры.итогбанксчет + ИтогбанкИМ.параметры.итогбанксчет;
	ИтогПодрбанкИМ.параметры.итогбанконлайн = ИтогПодрбанкИМ.параметры.итогбанконлайн + ИтогбанкИМ.параметры.итогбанконлайн;
	ИтогПодрбанкИМ.параметры.итогбанкпони = ИтогПодрбанкИМ.параметры.итогбанкпони + ИтогбанкИМ.параметры.итогбанкпони;
	ИтогПодрбанкИМ.параметры.итогбанкпп = ИтогПодрбанкИМ.параметры.итогбанкпп + ИтогбанкИМ.параметры.итогбанкпп;
	
#КонецОбласти

#Область ВозвратПС

	Табдок.Вывести(ВозвратПС,1);
	
	ПакетЗапросов = ПолучитьЗапросВозвратПС(КассыККМ, КассыККМСО, НачалоПериода, КонецПериода, Подразделение);
	
	ТЗВозвратыТовары 	= ПакетЗапросов[3].Выгрузить();
	ВыборкаВозвраты 	= ПакетЗапросов[4].Выбрать();
		
	Итогувсех.параметры.итогколво = 0;
	Итогувсех.параметры.итогсумма = 0;
	Итогувсех.параметры.итогскидка = 0;
	Итогувсех.параметры.итогккм = 0;
	Итогувсех.параметры.итогбонус = 0;
	Итогувсех.параметры.итогкк = 0;
	Итогсо.параметры.итогсо = 0;
	Итогсо.параметры.итогсоруб = 0;
	Итогсо.параметры.итогсоевро = 0;
	Итогсо.параметры.итогсодоллар = 0;
	Итогпс.параметры.итогпс = 0;
	Итогпред.параметры.итогпред = 0;
	Итогпост.параметры.итогпост = 0;
	Итогувсех.параметры.итогколво = 0;
	Итогбанк.параметры.итогбанк1 = 0;
	ИтогбанкИМ.параметры.итогбанк= 0;
	ИтогбанкИМ.параметры.итогбанксчет= 0;
	ИтогбанкИМ.параметры.итогбанконлайн= 0;
	ИтогбанкИМ.параметры.итогбанкпони= 0;
	ИтогбанкИМ.параметры.итогбанкпп= 0;
	
	Пока ВыборкаВозвраты.Следующий() Цикл
		
		СтрокаДокументувсех.Параметры.Документ = ВыборкаВозвраты.Ссылка;
		СтрокаДокументувсех.Параметры.Расшифровка1 = ВыборкаВозвраты.Ссылка;
		СтрокаДокументувсех.Параметры.Клиент = ВыборкаВозвраты.Партнер;
		СтрокаДокументувсех.Параметры.Сумма = ВыборкаВозвраты.СуммаДокумента;
		СтрокаДокументувсех.Параметры.Бонус = 0;
		
		СтрокаДокументувсех.параметры.ккм = ВыборкаВозвраты.ВыданоНаличными;
		
		Итогувсех.Параметры.итогсумма = Итогувсех.параметры.итогсумма + ВыборкаВозвраты.СуммаДокумента;
		Итогувсех.Параметры.итогккм = Итогувсех.параметры.итогккм + СтрокаДокументувсех.параметры.ккм;
		СтрокаДокументувсех.параметры.кк = ВыборкаВозвраты.ссылка.ОплатаПлатежнымиКартами.Итог("Сумма");
		СтрокаДокументбанк.параметры.банк1 = ВыборкаВозвраты.СуммаБезнал;
		Итогбанк.параметры.итогбанк1 = Итогбанк.параметры.итогбанк1 + ВыборкаВозвраты.СуммаБезнал;
		СтрокаДокументсо.параметры.соруб = 0;
		СтрокаДокументсо.параметры.соевро = 0;
		СтрокаДокументсо.параметры.содоллар = 0;	
		СтрокаДокументпс.параметры.пс = 0;
		СтрокаДокументпред.параметры.пред = 0;
		СтрокаДокументпост.параметры.пост = 0;
		СтрокаДокументбанким.параметры.банксчет = 0;
		СтрокаДокументбанким.параметры.банконлайн = 0;
		СтрокаДокументбанким.параметры.банкпони = 0;
		СтрокаДокументбанким.параметры.банкпп = 0;
		Итогпост.Параметры.итогпост = 0;
		СтрокаДокументувсех.параметры.колво = 0;
		
		Итогувсех.параметры.итогкк = Итогувсех.параметры.итогкк + СтрокаДокументувсех.параметры.кк;
				
		Табдок.Вывести(СтрокаДокументувсех,2);
		
		если ПС тогда
			Табдок.Присоединить(СтрокаДокументпс);
		конецесли;
		если со тогда	
			Табдок.Присоединить(СтрокаДокументсо);
		конецесли;
		если Предоплата тогда
			Табдок.Присоединить(СтрокаДокументпред);
		конецесли;
		если Постоплата тогда
			Табдок.Присоединить(СтрокаДокументпост);
		конецесли;
		если банк тогда
			Табдок.Присоединить(СтрокаДокументбанк);
		конецесли;
		если банким тогда
			Табдок.Присоединить(СтрокаДокументбанким);
		конецесли;

		СтрокиПСТовары = ТЗВозвратыТовары.НайтиСтроки(Новый Структура("Ссылка", ВыборкаВозвраты.Ссылка));
		Для каждого СтрокаПС Из СтрокиПСТовары Цикл
			СтрокаДетали = Макет.ПолучитьОбласть("СтрокаДетали|Увсех");
			СтрокаДетали.параметры.номенклатура = СтрокаПС.ПодарочныйСертификат;
			СтрокаДетали.параметры.колво = 0;
			Строкадетали.параметры.сумма = СтрокаПС.сумма;
		    Строкадетали.параметры.скидка = 0;
			Верх = СтрокаДетали.ВысотаТаблицы;;
			ОбластьНомен = СтрокаДетали.Область(верх,1,верх,2);
			ОбластьНомен.Объединить();
			Табдок.Вывести(Строкадетали,3,,ложь);	
		КонецЦикла; 
					
	конеццикла;
	Табдок.Вывести(Итогувсех,1);
	если ПС тогда
		Табдок.Присоединить(Итогпс);
	конецесли;
	если со тогда	
		Табдок.Присоединить(Итогсо);
	конецесли;
	если Предоплата тогда
		Табдок.Присоединить(Итогпред);
	конецесли;
	если Постоплата тогда
		Табдок.Присоединить(Итогпост);
	конецесли;
	если банк тогда
		Табдок.Присоединить(Итогбанк);
	конецесли;
	если банким тогда
		Табдок.Присоединить(Итогбанким);
	конецесли;
	
#КонецОбласти

#Область ЗаказыМТМ
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗаказКлиента.Ссылка,
	               |	ЗаказКлиента.Партнер,
	               |	ЗаказКлиента.СуммаДокумента,
	               |	ЗаказКлиента.Дата КАК Дата,
	               |	ЗаказКлиента.Валюта
	               |ИЗ
	               |	Документ.ЗаказКлиента КАК ЗаказКлиента
	               |ГДЕ
	               |	ЗаказКлиента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ЗаказКлиента.Подразделение В иерархии (&Склад)
	               |	И ЗаказКлиента.Проведен
	               |	И ЗаказКлиента.ВидЗаказа = &ВидЗаказа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	ЗАпрос.УстановитьПараметр("ВидЗаказа", перечисления.ВидыЗаказов.МТМ);
	ЗАпрос.УстановитьПараметр("Склад", Подразделение);
	//Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	Запрос.УстановитьПараметр("НачалоПериода", началодня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", конецдня(конецпериода));
	//Запрос.УстановитьПараметр("Статус", перечисления.СтатусыЧековККМ.Пробит);
	заказы = Запрос.Выполнить().Выбрать();
	Табдок.Вывести(ЗаказыМТМ,1);
	Итогувсех.параметры.итогколво = 0;
	Итогувсех.параметры.итогсумма = 0;
	Итогувсех.параметры.итогскидка = 0;
	Итогувсех.параметры.итогккм = 0;
	Итогувсех.параметры.итогкк = 0;
	Итогсо.параметры.итогсо = 0;
	Итогсо.параметры.итогсоруб = 0;
	Итогсо.параметры.итогсоевро = 0;
	Итогсо.параметры.итогсодоллар = 0;
	Итогпс.параметры.итогпс = 0;
	Итогпред.параметры.итогпред = 0;
	Итогпост.параметры.итогпост = 0;
	Итогувсех.параметры.итогколво = 0;
	Итогбанк.параметры.итогбанк1 = 0;
	ИтогбанкИМ.параметры.итогбанк= 0;
	ИтогбанкИМ.параметры.итогбанксчет= 0;
	ИтогбанкИМ.параметры.итогбанконлайн= 0;
	ИтогбанкИМ.параметры.итогбанкпони= 0;
	ИтогбанкИМ.параметры.итогбанкпп= 0;

	
	пока заказы.Следующий() цикл
		Коэффициенты = РаботаСКурсамивалютУТ.ПолучитьКоэффициентыПересчетаВалюты(заказы.Валюта, Неопределено, заказы.дата);
		СтрокаДокументувсех.параметры.документ = заказы.ссылка;
		СтрокаДокументувсех.параметры.Расшифровка1 = заказы.ссылка;
		СтрокаДокументувсех.параметры.Клиент = заказы.Партнер;
		СтрокаДокументувсех.параметры.сумма = заказы.суммадокумента * Коэффициенты.КоэффициентПересчетаВВалютуРегл;
		//сообщить(Коэффициенты.КоэффициентПересчетаВВалютуРегл);
		СтрокаДокументувсех.параметры.колво = заказы.ссылка.товары.итог("КоличествоУпаковок");
		
		СтрокаДокументувсех.параметры.бонус = 0;
		СтрокаДокументувсех.параметры.ккм = 0;
		СтрокаДокументсо.параметры.соруб = 0;
		СтрокаДокументсо.параметры.соевро = 0;
		СтрокаДокументсо.параметры.содоллар = 0;
		СтрокаДокументувсех.параметры.кк = 0;
		СтрокаДокументпс.параметры.пс = 0;
		СтрокаДокументпред.параметры.пред = 0;
		СтрокаДокументбанк.параметры.банк1 = 0;
		СтрокаДокументбанким.параметры.банксчет = 0;
		СтрокаДокументбанким.параметры.банконлайн = 0;
		СтрокаДокументбанким.параметры.банкпони = 0;
		СтрокаДокументбанким.параметры.банкпп = 0;
		СтрокаДокументпост.параметры.пост = 0;
		Итогувсех.параметры.итогсумма = Итогувсех.параметры.итогсумма + заказы.суммадокумента*Коэффициенты.КоэффициентПересчетаВВалютуРегл;			
		Итогувсех.параметры.итогколво = Итогувсех.параметры.итогколво + заказы.ссылка.товары.итог("КоличествоУпаковок");
	
		Табдок.Вывести(СтрокаДокументувсех,2);
		
		если ПС тогда
			Табдок.Присоединить(СтрокаДокументпс);
		конецесли;
		если со тогда	
			Табдок.Присоединить(СтрокаДокументсо);
		конецесли;
		если Предоплата тогда
			Табдок.Присоединить(СтрокаДокументпред);
		конецесли;
		если Постоплата тогда
			Табдок.Присоединить(СтрокаДокументпост);
		конецесли;
		если банк тогда
			Табдок.Присоединить(СтрокаДокументбанк);
		конецесли;
		если банким тогда
			Табдок.Присоединить(СтрокаДокументбанким);
		конецесли;
		
		запрос = новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЗаказКлиентаТовары.Номенклатура,
		               |	ЗаказКлиентаТовары.Характеристика,
		               |	ЗаказКлиентаТовары.Количество,
		               |	ЗаказКлиентаТовары.Сумма,
		               |	ЗаказКлиентаТовары.ПроцентРучнойСкидки + ЗаказКлиентаТовары.ПроцентАвтоматическойСкидки КАК Поле1
		               |ИЗ
		               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		               |ГДЕ
		               |	ЗаказКлиентаТовары.Ссылка = &Ссылка
		               |	И ЗаказКлиентаТовары.Отменено = ЛОЖЬ";
		Запрос.УстановитьПараметр("Ссылка", заказы.ссылка);
		детали = запрос.Выполнить().Выбрать();
		пока детали.Следующий() цикл
			СтрокаДетали.параметры.номенклатура = строка(детали.номенклатура) + " (" + строка(детали.характеристика) + ")";
			СтрокаДетали.параметры.колво = детали.количество;
			Строкадетали.параметры.сумма = детали.сумма*Коэффициенты.КоэффициентПересчетаВВалютуРегл;
		    Строкадетали.параметры.скидка = детали.поле1;
			Верх = СтрокаДетали.ВысотаТаблицы;;
			ОбластьНомен = СтрокаДетали.Область(верх,1,верх,2);
			ОбластьНомен.Объединить();
			Табдок.Вывести(Строкадетали,3,,ложь);
		конеццикла;			
	конеццикла;
	Табдок.Вывести(Итогувсех,1);
	
	если ПС тогда
		Табдок.Присоединить(Итогпс);
	конецесли;
	если со тогда	
		Табдок.Присоединить(Итогсо);
	конецесли;
	если Предоплата тогда
		Табдок.Присоединить(Итогпред);
	конецесли;
	если Постоплата тогда
		Табдок.Присоединить(Итогпост);
	конецесли;
	если банк тогда
		Табдок.Присоединить(Итогбанк);
	конецесли;
	если банким тогда
		Табдок.Присоединить(Итогбанким);
	конецесли;
# конецобласти

#Область ПредоплатаМТМ
	Итогувсех.параметры.итогколво = 0;
	Итогувсех.параметры.итогсумма = 0;
	Итогувсех.параметры.итогскидка = 0;
	Итогувсех.параметры.итогккм = 0;
	Итогувсех.параметры.итогкк = 0;
	Итогсо.параметры.итогсо = 0;
	Итогсо.параметры.итогсоруб = 0;
	Итогсо.параметры.итогсоевро = 0;
	Итогсо.параметры.итогсодоллар = 0;
	Итогпс.параметры.итогпс = 0;
	Итогпред.параметры.итогпред = 0;
	Итогпост.параметры.итогпост = 0;
	Итогувсех.параметры.итогколво = 0;
	Итогбанк.параметры.итогбанк1 = 0;
	ИтогбанкИМ.параметры.итогбанк= 0;
	ИтогбанкИМ.параметры.итогбанксчет= 0;
	ИтогбанкИМ.параметры.итогбанконлайн= 0;
	ИтогбанкИМ.параметры.итогбанкпони= 0;
	ИтогбанкИМ.параметры.итогбанкпп= 0;

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	               |	РеализацияТоваровУслуг.Партнер КАК Партнер,
	               |	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	               |	РеализацияТоваровУслуг.Дата КАК Дата,
	               |	РеализацияТоваровУслуг.Валюта КАК Валюта,
	               |	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ
	               |ПОМЕСТИТЬ СписокРеализиций
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РеализацияТоваровУслуг.Подразделение В ИЕРАРХИИ(&склад)
	               |	И РеализацияТоваровУслуг.Проведен
	               |	И РеализацияТоваровУслуг.ЗаказКлиента.ВидЗаказа = &ВидЗаказа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма КАК Сумма,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка КАК Ссылка,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент КАК партнер,
	               |	0 КАК СУммаКК,
	               |	0 КАК СуммаСОруб,
	               |	0 КАК СуммаСОевро,
	               |	0 КАК СуммаСОдоллар,
	               |	0 КАК СуммаВалевро,
	               |	0 КАК СуммаВалдоллар,
	               |	0 КАК Суммабезнал,
	               |	0 КАК СуммаПС
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |		ПОЛНОЕ СОЕДИНЕНИЕ СписокРеализиций КАК СписокРеализиций
	               |		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ = СписокРеализиций.Заказ
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассаККМ1)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ВЫРАЗИТЬ(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа = &ВидЗаказа
	               |	И (СписокРеализиций.Ссылка ЕСТЬ NULL
	               |			ИЛИ НАЧАЛОПЕРИОДА(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Дата, ДЕНЬ))
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Сумма,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
	               |		ПОЛНОЕ СОЕДИНЕНИЕ СписокРеализиций КАК СписокРеализиций
	               |		ПО ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ = СписокРеализиций.Заказ
	               |ГДЕ
	               |	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ(&склад)
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
	               |	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ВЫРАЗИТЬ(ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа = &ВидЗаказа
	               |	И (СписокРеализиций.Ссылка ЕСТЬ NULL
	               |			ИЛИ НАЧАЛОПЕРИОДА(ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Дата, ДЕНЬ))
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |		ПОЛНОЕ СОЕДИНЕНИЕ СписокРеализиций КАК СписокРеализиций
	               |		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ = СписокРеализиций.Заказ
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассаККМ2)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта = &Валютаруб
	               |	И ВЫРАЗИТЬ(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа = &ВидЗаказа
	               |	И (СписокРеализиций.Ссылка ЕСТЬ NULL
	               |			ИЛИ НАЧАЛОПЕРИОДА(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Дата, ДЕНЬ))
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ (&склад)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов,
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |		ПОЛНОЕ СОЕДИНЕНИЕ СписокРеализиций КАК СписокРеализиций
	               |		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ = СписокРеализиций.Заказ
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассаККМ2)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта = &Валютаевро
	               |	И ВЫРАЗИТЬ(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа = &ВидЗаказа
	               |	И (СписокРеализиций.Ссылка ЕСТЬ NULL
	               |			ИЛИ НАЧАЛОПЕРИОДА(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Дата, ДЕНЬ))
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ (&склад)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов,
	               |	0,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма,
	               |	0,
	               |	0
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |		ПОЛНОЕ СОЕДИНЕНИЕ СписокРеализиций КАК СписокРеализиций
	               |		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ = СписокРеализиций.Заказ
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассаККМ2)
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта = &Валютадоллар
	               |	И ВЫРАЗИТЬ(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа = &ВидЗаказа
	               |	И (СписокРеализиций.Ссылка ЕСТЬ NULL
	               |			ИЛИ НАЧАЛОПЕРИОДА(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Дата, ДЕНЬ))
	               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Подразделение В ИЕРАРХИИ (&склад)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма,
	               |	0
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	               |		ПОЛНОЕ СОЕДИНЕНИЕ СписокРеализиций КАК СписокРеализиций
	               |		ПО ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ = СписокРеализиций.Заказ
	               |ГДЕ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ОплатаИМ = ЛОЖЬ
	               |	И ВЫРАЗИТЬ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).Подразделение В ИЕРАРХИИ (&Склад)
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ВЫРАЗИТЬ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа = &ВидЗаказа
	               |	И (СписокРеализиций.Ссылка ЕСТЬ NULL
	               |			ИЛИ НАЧАЛОПЕРИОДА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Дата, ДЕНЬ))
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Заказ,
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка,
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Контрагент,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Сумма
	               |ИЗ
	               |	Документ.ОплатаПодарочнымСертификатом.РасшифровкаПлатежа КАК ОплатаПодарочнымСертификатомРасшифровкаПлатежа
	               |		ПОЛНОЕ СОЕДИНЕНИЕ СписокРеализиций КАК СписокРеализиций
	               |		ПО ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Заказ = СписокРеализиций.Заказ
	               |ГДЕ
	               |	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ВЫРАЗИТЬ(ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).Подразделение В ИЕРАРХИИ (&Склад)
	               |	И ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
	               |	И ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Проведен
	               |	И ВЫРАЗИТЬ(ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Заказ КАК Документ.ЗаказКлиента).ВидЗаказа = &ВидЗаказа
	               |	И (СписокРеализиций.Ссылка ЕСТЬ NULL
	               |			ИЛИ НАЧАЛОПЕРИОДА(ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Дата, ДЕНЬ))";	
	Запрос.УстановитьПараметр("НачалоПериода", началодня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", конецдня(конецпериода));			   
	Запрос.УстановитьПараметр("КассаККМ1", КассыККМ);
	Запрос.УстановитьПараметр("КассаККМ2", КассыККМСО);
	Запрос.УстановитьПараметр("ВидЗаказа", перечисления.ВидыЗаказов.МТМ);
	Запрос.УстановитьПараметр("Склад", подразделение);
	Запрос.УстановитьПараметр("ВалютаДоллар", справочники.Валюты.НайтиПоКоду("840"));
	Запрос.УстановитьПараметр("Валютаевро", справочники.Валюты.НайтиПоКоду("978"));
	Запрос.УстановитьПараметр("Валютаруб", справочники.Валюты.НайтиПоКоду("643"));
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента);
	Табдок.Вывести(предоплатыМТМ,1);
	выборка = Запрос.Выполнить().Выбрать();
	пока выборка.Следующий() цикл
		//если строка(выборка.заказ) = "" или выборка.заказ.дата > выборка.ссылка.дата тогда
		видз = истина;
		запрос = новый запрос();
		запрос.Текст = "ВЫБРАТЬ
		               |	РеализацияТоваровУслуг.Ссылка,
		               |	РеализацияТоваровУслуг.Дата
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		               |ГДЕ
		               |	РеализацияТоваровУслуг.ЗаказКлиента = &ЗаказКлиента
		               |	И РеализацияТоваровУслуг.Дата <= &Дата";
		запрос.УстановитьПараметр("ЗаказКлиента", выборка.заказ);
		запрос.УстановитьПараметр("Дата", конецдня(выборка.ссылка.дата));
		выбо = запрос.Выполнить().Выбрать();
		//если выбо.Следующий() тогда 
		//	видз = ложь;
		//конецесли;
		если видз тогда
			СтрокаДокументувсех.параметры.документ = выборка.Заказ;
			СтрокаДокументувсех.параметры.Расшифровка1 = выборка.Заказ;
			СтрокаДокументувсех.параметры.Клиент = выборка.партнер;
			СтрокаДокументувсех.параметры.сумма = выборка.сумма + выборка.суммакк + выборка.суммасоруб +выборка.СуммаПС
			+ выборка.СуммаВалевро*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("978"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата) 
			+ выборка.СуммаВалдоллар*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("840"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата)  
			+ выборка.суммаБезнал;
			СтрокаДокументувсех.параметры.ккм = выборка.сумма;
			СтрокаДокументувсех.параметры.кк = выборка.суммакк;	
			СтрокаДокументсо.параметры.соруб = выборка.суммасоруб;
			СтрокаДокументсо.параметры.соевро = выборка.СуммаВалевро;
			СтрокаДокументсо.параметры.содоллар = выборка.СуммаВалдоллар;
			СтрокаДокументпс.параметры.пс = выборка.СуммаПС;
			СтрокаДокументпред.параметры.пред = 0;
			СтрокаДокументпост.параметры.пост = 0;
			СтрокаДокументувсех.параметры.колво = 0;
			СтрокаДокументбанк.параметры.банк1 = выборка.суммабезнал;
			СтрокаДокументбанким.параметры.банксчет = 0;
			СтрокаДокументбанким.параметры.банконлайн = 0;
			СтрокаДокументбанким.параметры.банкпони = 0;
			СтрокаДокументбанким.параметры.банкпп = 0;
			СтрокаДокументувсех.параметры.бонус = 0;

			Итогувсех.параметры.итогсумма = Итогувсех.параметры.итогсумма + выборка.сумма + выборка.суммакк + выборка.суммасоруб 
			+ выборка.СуммаВалевро*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("978"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата) 
			+ выборка.СуммаВалдоллар*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("840"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата)   
			+ выборка.суммаБезнал;
			Итогсо.параметры.итогсоруб = Итогсо.параметры.итогсоруб + выборка.СуммаСОруб;
			Итогсо.параметры.итогсоевро = Итогсо.параметры.итогсоевро + выборка.СуммаВалевро;
			Итогсо.параметры.итогсодоллар = Итогсо.параметры.итогсодоллар + выборка.СуммаВалдоллар;
			Итогсо.параметры.итогсо = Итогсо.параметры.итогсо + выборка.СуммаСОруб 
			+ выборка.СуммаВалевро*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("978"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата) 
			+ выборка.СуммаВалдоллар*РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(справочники.Валюты.НайтиПоКоду("840"), справочники.Валюты.НайтиПоКоду("643"), заказы.дата);
			Итогувсех.параметры.итогкк = Итогувсех.параметры.итогкк + СтрокаДокументувсех.параметры.кк;
			Итогувсех.параметры.итогккм = Итогувсех.параметры.итогккм + СтрокаДокументувсех.параметры.ккм;
			Итогбанк.параметры.итогбанк1 = Итогбанк.параметры.итогбанк1 + СтрокаДокументбанк.параметры.банк1;
			Итогпс.параметры.итогпс = Итогпс.параметры.итогпс + выборка.СуммаПС;
			Табдок.Вывести(СтрокаДокументувсех,2);
		
		если ПС тогда
			Табдок.Присоединить(СтрокаДокументпс);
		конецесли;
		если со тогда	
			Табдок.Присоединить(СтрокаДокументсо);
		конецесли;
		если Предоплата тогда
			Табдок.Присоединить(СтрокаДокументпред);
		конецесли;
		если Постоплата тогда
			Табдок.Присоединить(СтрокаДокументпост);
		конецесли;
		если банк тогда
			Табдок.Присоединить(СтрокаДокументбанк);
		конецесли;
		если банким тогда
			Табдок.Присоединить(СтрокаДокументбанким);
		конецесли;
	конецесли;
		
	конеццикла;
	Табдок.Вывести(Итогувсех,1);
	
	если ПС тогда
		Табдок.Присоединить(Итогпс);
	конецесли;
	если со тогда	
		Табдок.Присоединить(Итогсо);
	конецесли;
	если Предоплата тогда
		Табдок.Присоединить(Итогпред);
	конецесли;
	если Постоплата тогда
		Табдок.Присоединить(Итогпост);
	конецесли;
	если банк тогда
		Табдок.Присоединить(Итогбанк);
	конецесли;
	если банким тогда
		Табдок.Присоединить(Итогбанким);
	конецесли;
	
	ИтогПодрувсех.параметры.итогколво = ИтогПодрувсех.параметры.итогколво + Итогувсех.параметры.итогколво;
	ИтогПодрувсех.параметры.итогсумма = ИтогПодрувсех.параметры.итогсумма + Итогувсех.параметры.итогсумма;
	ИтогПодрувсех.параметры.итогскидка = ИтогПодрувсех.параметры.итогскидка + Итогувсех.параметры.итогскидка;
	ИтогПодрувсех.параметры.итогккм = ИтогПодрувсех.параметры.итогккм + Итогувсех.параметры.итогккм;
	ИтогПодрувсех.параметры.итогкк = ИтогПодрувсех.параметры.итогкк + Итогувсех.параметры.итогкк;
	ИтогПодрсо.параметры.итогсо = ИтогПодрсо.параметры.итогсо + Итогсо.параметры.итогсо;
	ИтогПодрсо.параметры.итогсоруб = ИтогПодрсо.параметры.итогсоруб + Итогсо.параметры.итогсоруб;
	ИтогПодрсо.параметры.итогсоевро = ИтогПодрсо.параметры.итогсоевро + Итогсо.параметры.итогсоевро;
	ИтогПодрсо.параметры.итогсодоллар = ИтогПодрсо.параметры.итогсодоллар + Итогсо.параметры.итогсодоллар;
	ИтогПодрпс.параметры.итогпс = ИтогПодрпс.параметры.итогпс + Итогпс.параметры.итогпс;
	ИтогПодрпред.параметры.итогпред = ИтогПодрпред.параметры.итогпред + Итогпред.параметры.итогпред;
	ИтогПодрпост.параметры.итогпост = ИтогПодрпост.параметры.итогпост + Итогпост.параметры.итогпост;
	ИтогПодрбанк.параметры.итогбанк1 = ИтогПодрбанк.параметры.итогбанк1 + Итогбанк.параметры.итогбанк1;
	ИтогПодрбанкИМ.параметры.итогбанк = ИтогПодрбанкИМ.параметры.итогбанк + ИтогбанкИМ.параметры.итогбанк;
	ИтогПодрбанкИМ.параметры.итогбанксчет = ИтогПодрбанкИМ.параметры.итогбанксчет + ИтогбанкИМ.параметры.итогбанксчет;
	ИтогПодрбанкИМ.параметры.итогбанконлайн = ИтогПодрбанкИМ.параметры.итогбанконлайн + ИтогбанкИМ.параметры.итогбанконлайн;
	ИтогПодрбанкИМ.параметры.итогбанкпони = ИтогПодрбанкИМ.параметры.итогбанкпони + ИтогбанкИМ.параметры.итогбанкпони;
	ИтогПодрбанкИМ.параметры.итогбанкпп = ИтогПодрбанкИМ.параметры.итогбанкпп + ИтогбанкИМ.параметры.итогбанкпп;
#КонецОбласти

#Область РеализацииМТМНовый

	Табдок.Вывести(реализацииМТМ,1);
	
	Итогувсех 	= Макет.ПолучитьОбласть("Итого|Увсех");
	Итогсо 		= Макет.ПолучитьОбласть("Итого|со");
	Итогпс 		= Макет.ПолучитьОбласть("Итого|пс");
	Итогпред 	= Макет.ПолучитьОбласть("Итого|пред");
	Итогпост 	= Макет.ПолучитьОбласть("Итого|пост");	
	Итогбанк 	= Макет.ПолучитьОбласть("Итого|банк");
	Итогбанким 	= Макет.ПолучитьОбласть("Итого|банким");

	ПакетЗапросов = ПолучитьЗапросРеализацииМТМ(КассыККМ, КассыККМСО, НачалоПериода, КонецПериода, Подразделение);
	
	ТЗРеализацииТовары 			= ПакетЗапросов[5].Выгрузить();
	ВыборкаРеализацииСОплатами 	= ПакетЗапросов[6].Выбрать();
	ТЗИтогиМТМ 				 	= ПакетЗапросов[7].Выбрать();
	ЕстьРеализации 				= Ложь;
	
	Пока ВыборкаРеализацииСОплатами.Следующий() Цикл
		
		ЕстьРеализации = Истина;
		Коэффициенты = РаботаСКурсамивалютУТ.ПолучитьКоэффициентыПересчетаВалюты(ВыборкаРеализацииСОплатами.Валюта, Неопределено, ВыборкаРеализацииСОплатами.Дата);
		
		СтрокаДокументУвсех 	= Макет.ПолучитьОбласть("СтрокаДокумент|Увсех");
		СтрокаДокументсо 		= Макет.ПолучитьОбласть("СтрокаДокумент|со");
		СтрокаДокументпс 		= Макет.ПолучитьОбласть("СтрокаДокумент|пс");
		СтрокаДокументпред 		= Макет.ПолучитьОбласть("СтрокаДокумент|пред");
		СтрокаДокументпост 		= Макет.ПолучитьОбласть("СтрокаДокумент|пост");
		СтрокаДокументбанк 		= Макет.ПолучитьОбласть("СтрокаДокумент|банк");
		СтрокаДокументбанким 	= Макет.ПолучитьОбласть("СтрокаДокумент|банким");
		СтрокаДетали 			= Макет.ПолучитьОбласть("СтрокаДетали|Увсех");	

	 	СтрокаДокументувсех.Параметры.Заполнить(ВыборкаРеализацииСОплатами);
		СтрокаДокументувсех.Параметры.Расшифровка1 = ВыборкаРеализацииСОплатами.Документ;
		
		СтрокаДокументсо.Параметры.Заполнить(ВыборкаРеализацииСОплатами);
		СтрокаДокументпс.Параметры.Заполнить(ВыборкаРеализацииСОплатами);
		СтрокаДокументпред.Параметры.Заполнить(ВыборкаРеализацииСОплатами);
		СтрокаДокументпост.Параметры.Заполнить(ВыборкаРеализацииСОплатами);
		СтрокаДокументбанк.Параметры.Заполнить(ВыборкаРеализацииСОплатами);
		СтрокаДокументбанким.Параметры.Заполнить(ВыборкаРеализацииСОплатами);
		
		СтрокаДокументувсех.параметры.Колво = ВыборкаРеализацииСОплатами.КоличествоИтого;
		СтрокаДокументувсех.параметры.Сумма = ВыборкаРеализацииСОплатами.СуммаДокументаРубли;
		
		Табдок.Вывести(СтрокаДокументувсех,2);
		
		Если ПС Тогда
			Табдок.Присоединить(СтрокаДокументпс);
		КонецЕсли; 
		
		Если со Тогда
			Табдок.Присоединить(СтрокаДокументсо);
		КонецЕсли; 
		
		Если Предоплата Тогда
			Табдок.Присоединить(СтрокаДокументпред);
		КонецЕсли; 
		
		Если Постоплата Тогда
			Табдок.Присоединить(СтрокаДокументпост);
		КонецЕсли; 
		
		Если банк Тогда
			Табдок.Присоединить(СтрокаДокументбанк);
		КонецЕсли; 
		
		Если банким Тогда
			Табдок.Присоединить(СтрокаДокументбанким);
		КонецЕсли; 
		
		СтрокиТовары = ТЗРеализацииТовары.НайтиСтроки(Новый Структура("Документ", ВыборкаРеализацииСОплатами.Документ));
		
		Для каждого СтрокаТоваров Из СтрокиТовары Цикл
			
			СтрокаДетали = Макет.ПолучитьОбласть("СтрокаДетали|Увсех");
			СтрокаДетали.параметры.номенклатура = Строка(СтрокаТоваров.номенклатура) + " (" + строка(СтрокаТоваров.характеристика) + ")";
			СтрокаДетали.параметры.колво 		= СтрокаТоваров.количество;
			Строкадетали.параметры.сумма 		= СтрокаТоваров.сумма*Коэффициенты.КоэффициентПересчетаВВалютуРегл;
		    Строкадетали.параметры.скидка 		= СтрокаТоваров.скидка;
			Табдок.Вывести(Строкадетали,3,,Ложь);
		
		конеццикла;
	конеццикла;
	
	Итогувсех 	= Макет.ПолучитьОбласть("Итого|Увсех");
	Итогсо 		= Макет.ПолучитьОбласть("Итого|со");
	Итогпс 		= Макет.ПолучитьОбласть("Итого|пс");
	Итогпред 	= Макет.ПолучитьОбласть("Итого|пред");
	Итогпост 	= Макет.ПолучитьОбласть("Итого|пост");	
	Итогбанк 	= Макет.ПолучитьОбласть("Итого|банк");
	Итогбанким 	= Макет.ПолучитьОбласть("Итого|банким");
	
	Итогбанк.параметры.итогбанк1 = 0;
	ИтогбанкИМ.параметры.итогбанконлайн= 0;
	
	Если ТЗИтогиМТМ.Следующий() И ЕстьРеализации Тогда
		
		Итогувсех.Параметры.Заполнить(ТЗИтогиМТМ);
		Итогсо.Параметры.Заполнить(ТЗИтогиМТМ);
		Итогпс.Параметры.Заполнить(ТЗИтогиМТМ);
		Итогпред.Параметры.Заполнить(ТЗИтогиМТМ);
		Итогпост.Параметры.Заполнить(ТЗИтогиМТМ);
		Итогбанк.Параметры.Заполнить(ТЗИтогиМТМ);
		Итогбанким.Параметры.Заполнить(ТЗИтогиМТМ);
		
	Иначе
		
		Итогувсех.Параметры.Итогсумма 		= 0;			
		Итогувсех.Параметры.Итогколво 		= 0;
		Итогувсех.Параметры.Итогсумма 		= 0;
		Итогувсех.Параметры.Итогскидка 		= 0;
		Итогувсех.Параметры.ИтогКкм 		= 0;
		Итогувсех.Параметры.ИтогКк 			= 0;
		Итогсо.Параметры.Итогсо 			= 0;
		Итогсо.Параметры.Итогсоруб 			= 0;
		Итогсо.Параметры.Итогсоевро 		= 0;
		Итогсо.Параметры.Итогсодоллар 		= 0;
		Итогпс.Параметры.Итогпс 			= 0;
		Итогпред.Параметры.Итогпред 		= 0;
		Итогпост.Параметры.Итогпост 		= 0;
		Итогувсех.Параметры.Итогколво 		= 0;
		ИтогБанк.Параметры.ИтогБанк1 		= 0;
		ИтогБанкИМ.Параметры.ИтогБанк		= 0;
		ИтогБанкИМ.Параметры.ИтогБанксчет	= 0;
		ИтогБанкИМ.Параметры.ИтогБанконлайн	= 0;
		ИтогБанкИМ.Параметры.ИтогБанкпони	= 0;
		ИтогБанкИМ.Параметры.ИтогБанкпп		= 0;
		Итогувсех.Параметры.Итогбонус	 	= 0;
		
	КонецЕсли; 
	
	Табдок.Вывести(Итогувсех,1);
	
	если ПС тогда
		Табдок.Присоединить(Итогпс);
	конецесли;
	если со тогда	
		Табдок.Присоединить(Итогсо);
	конецесли;
	если Предоплата тогда
		Табдок.Присоединить(Итогпред);
	конецесли;
	если Постоплата тогда
		Табдок.Присоединить(Итогпост);
	конецесли;
	если банк тогда
		Табдок.Присоединить(Итогбанк);
	конецесли;
	если банким тогда
		Табдок.Присоединить(Итогбанким);
	конецесли;
	
	
#КонецОбласти


	ИтогПодрувсех.параметры.итогколво 		= ИтогПодрувсех.параметры.итогколво + Итогувсех.параметры.итогколво;
	ИтогПодрувсех.параметры.итогсумма 		= ИтогПодрувсех.параметры.итогсумма + Итогувсех.параметры.итогсумма;
	ИтогПодрувсех.параметры.итогскидка 		= ИтогПодрувсех.параметры.итогскидка + Итогувсех.параметры.итогскидка;
	ИтогПодрувсех.параметры.итогккм 		= ИтогПодрувсех.параметры.итогккм + Итогувсех.параметры.итогккм;
	ИтогПодрувсех.параметры.итогкк 			= ИтогПодрувсех.параметры.итогкк + Итогувсех.параметры.итогкк;
	ИтогПодрсо.параметры.итогсо 			= ИтогПодрсо.параметры.итогсо + Итогсо.параметры.итогсо;
	ИтогПодрсо.параметры.итогсоруб 			= ИтогПодрсо.параметры.итогсоруб + Итогсо.параметры.итогсоруб;
	ИтогПодрсо.параметры.итогсоевро 		= ИтогПодрсо.параметры.итогсоевро + Итогсо.параметры.итогсоевро;
	ИтогПодрсо.параметры.итогсодоллар 		= ИтогПодрсо.параметры.итогсодоллар + Итогсо.параметры.итогсодоллар;
	ИтогПодрпс.параметры.итогпс 			= ИтогПодрпс.параметры.итогпс + Итогпс.параметры.итогпс;
	ИтогПодрпред.параметры.итогпред 		= ИтогПодрпред.параметры.итогпред + Итогпред.параметры.итогпред;
	ИтогПодрпост.параметры.итогпост 		= ИтогПодрпост.параметры.итогпост + Итогпост.параметры.итогпост;
	ИтогПодрбанк.параметры.итогбанк1 		= ИтогПодрбанк.параметры.итогбанк1 + Итогбанк.параметры.итогбанк1;
	ИтогПодрбанкИМ.параметры.итогбанк 		= ИтогПодрбанкИМ.параметры.итогбанк + ИтогбанкИМ.параметры.итогбанк;
	ИтогПодрбанкИМ.параметры.итогбанксчет 	= ИтогПодрбанкИМ.параметры.итогбанксчет + ИтогбанкИМ.параметры.итогбанксчет;
	ИтогПодрбанкИМ.параметры.итогбанконлайн = ИтогПодрбанкИМ.параметры.итогбанконлайн + ИтогбанкИМ.параметры.итогбанконлайн;
	ИтогПодрбанкИМ.параметры.итогбанкпони 	= ИтогПодрбанкИМ.параметры.итогбанкпони + ИтогбанкИМ.параметры.итогбанкпони;
	ИтогПодрбанкИМ.параметры.итогбанкпп 	= ИтогПодрбанкИМ.параметры.итогбанкпп + ИтогбанкИМ.параметры.итогбанкпп;

	Табдок.Вывести(ИтогПодрувсех,1);
	
	если ПС тогда
		Табдок.Присоединить(ИтогПодрпс);
	конецесли;
	если со тогда	
		Табдок.Присоединить(ИтогПодрсо);
	конецесли;
	если Предоплата тогда
		Табдок.Присоединить(ИтогПодрпред);
	конецесли;
	если Постоплата тогда
		Табдок.Присоединить(ИтогПодрпост);
	конецесли;
	если банк тогда
		Табдок.Присоединить(ИтогПодрбанк);
	конецесли;
	если банким тогда
		Табдок.Присоединить(ИтогПодрбанким,1);
	конецесли;
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

Функция ПолучитьЗапросРеализацииМТМ(КассаККМ, КассыККМСО, НачалоПериода, КонецПериода, Подразделение)
	
	Запрос = Новый Запрос;
#Область ТекстЗапроса

    Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Партнер КАК Партнер,
		|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
		|	РеализацияТоваровУслуг.Дата КАК Дата,
		|	РеализацияТоваровУслуг.Валюта КАК Валюта,
		|	РеализацияТоваровУслуг.ЗаказКлиента КАК Заказ
		|ПОМЕСТИТЬ СписокРеализиций
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РеализацияТоваровУслуг.Подразделение В ИЕРАРХИИ(&Подразделение)
		|	И РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.ЗаказКлиента.ВидЗаказа = &ВидЗаказаМТМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписокРеализиций.Ссылка КАК СсылкаРеализация,
		|	РеализацияТоваровУслугТовары.ПроцентАвтоматическойСкидки + РеализацияТоваровУслугТовары.ПроцентРучнойСкидки КАК ПроцентСкидки,
		|	РеализацияТоваровУслугТовары.Количество КАК Количество
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	СписокРеализиций КАК СписокРеализиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО СписокРеализиций.Ссылка = РеализацияТоваровУслугТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ПС"" КАК ВидОплаты,
		|	СписокРеализиций.Ссылка КАК РеализацияСсылка,
		|	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Заказ КАК Заказ,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПС,
		|	0 КАК ККОнлайн,
		|	0 КАК КК,
		|	0 КАК Касса,
		|	0 КАК СОруб,
		|	0 КАК СОевро,
		|	0 КАК СОдоллар,
		|	0 КАК Банк,
		|	0 КАК БанкСчет,
		|	0 КАК БанкПони,
		|	0 КАК БанкPayPal,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Предоплата,
		|	0 КАК СОВРуб
		|ПОМЕСТИТЬ Оплаты
		|ИЗ
		|	СписокРеализиций КАК СписокРеализиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаПодарочнымСертификатом.РасшифровкаПлатежа КАК ОплатаПодарочнымСертификатомРасшифровкаПлатежа
		|		ПО СписокРеализиций.Заказ = ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Заказ
		|ГДЕ
		|	ОплатаПодарочнымСертификатомРасшифровкаПлатежа.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ККОнлайн"",
		|	СписокРеализиций.Ссылка,
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	СписокРеализиций КАК СписокРеализиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
		|		ПО СписокРеализиций.Заказ = ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ
		|ГДЕ
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен
		|	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ЭквайринговыйТерминал В(&ЭквайринговыйТерминалOnline)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""КК"",
		|	СписокРеализиций.Ссылка,
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	СписокРеализиций КАК СписокРеализиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
		|		ПО СписокРеализиций.Заказ = ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ
		|ГДЕ
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен
		|	И НЕ ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.ЭквайринговыйТерминал В (&ЭквайринговыйТерминалOnline)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Касса"",
		|	СписокРеализиций.Ссылка,
		|	ПКОРасшифровкаПлатежа.Заказ,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПКОРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ПКОРасшифровкаПлатежа.Сумма - ЕСТЬNULL(РКОРасшифровкаПлатежа.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПКОРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ПКОРасшифровкаПлатежа.Сумма - ЕСТЬNULL(РКОРасшифровкаПлатежа.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	СписокРеализиций КАК СписокРеализиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПКОРасшифровкаПлатежа
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РКОРасшифровкаПлатежа
		|			ПО ПКОРасшифровкаПлатежа.Заказ = РКОРасшифровкаПлатежа.Заказ
		|				И (РКОРасшифровкаПлатежа.Ссылка.КассаККМ1 В (&КассаККМ))
		|				И (РКОРасшифровкаПлатежа.Ссылка.Проведен)
		|				И (РКОРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
		|		ПО СписокРеализиций.Заказ = ПКОРасшифровкаПлатежа.Заказ
		|ГДЕ
		|	ПКОРасшифровкаПлатежа.Ссылка.Проведен
		|	И ПКОРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассаККМ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""СОруб"",
		|	СписокРеализиций.Ссылка,
		|	ПКОРасшифровкаПлатежа.Заказ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПКОРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ПКОРасшифровкаПлатежа.Сумма - ЕСТЬNULL(РКОРасшифровкаПлатежа.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПКОРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ПКОРасшифровкаПлатежа.Сумма - ЕСТЬNULL(РКОРасшифровкаПлатежа.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	СписокРеализиций КАК СписокРеализиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПКОРасшифровкаПлатежа
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РКОРасшифровкаПлатежа
		|			ПО ПКОРасшифровкаПлатежа.Заказ = РКОРасшифровкаПлатежа.Заказ
		|				И (РКОРасшифровкаПлатежа.Ссылка.КассаККМ1 В (&КассыККМСО))
		|				И (РКОРасшифровкаПлатежа.Ссылка.Проведен)
		|				И (РКОРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
		|				И (РКОРасшифровкаПлатежа.Ссылка.Валюта = &ВалютаРУБ)
		|		ПО СписокРеализиций.Заказ = ПКОРасшифровкаПлатежа.Заказ
		|ГДЕ
		|	ПКОРасшифровкаПлатежа.Ссылка.Проведен
		|	И ПКОРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассыККМСО)
		|	И ПКОРасшифровкаПлатежа.Ссылка.Валюта = &ВалютаРУБ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""СОЕвро"",
		|	СписокРеализиций.Ссылка,
		|	ПКОРасшифровкаПлатежа.Заказ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПКОРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ПКОРасшифровкаПлатежа.Сумма - ЕСТЬNULL(РКОРасшифровкаПлатежа.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПКОРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ВЫБОР
		|					КОГДА ПКОРасшифровкаПлатежа.ВалютаВзаиморасчетов = &ВалютаРуб
		|						ТОГДА ПКОРасшифровкаПлатежа.СуммаВзаиморасчетов
		|					ИНАЧЕ (ПКОРасшифровкаПлатежа.Сумма - ЕСТЬNULL(РКОРасшифровкаПлатежа.Сумма, 0)) * КурсыВалют.Курс
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПКОРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ВЫБОР
		|					КОГДА ПКОРасшифровкаПлатежа.ВалютаВзаиморасчетов = &ВалютаРуб
		|						ТОГДА ПКОРасшифровкаПлатежа.СуммаВзаиморасчетов
		|					ИНАЧЕ (ПКОРасшифровкаПлатежа.Сумма - ЕСТЬNULL(РКОРасшифровкаПлатежа.Сумма, 0)) * КурсыВалют.Курс
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	СписокРеализиций КАК СписокРеализиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПКОРасшифровкаПлатежа
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РКОРасшифровкаПлатежа
		|			ПО ПКОРасшифровкаПлатежа.Заказ = РКОРасшифровкаПлатежа.Заказ
		|				И (РКОРасшифровкаПлатежа.Ссылка.КассаККМ1 В (&КассыККМСО))
		|				И (РКОРасшифровкаПлатежа.Ссылка.Проведен)
		|				И (РКОРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
		|				И (РКОРасшифровкаПлатежа.Ссылка.Валюта = &ВалютаЕвро)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО ПКОРасшифровкаПлатежа.ВалютаВзаиморасчетов = КурсыВалют.Валюта
		|				И (НАЧАЛОПЕРИОДА(ПКОРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = КурсыВалют.Период)
		|		ПО СписокРеализиций.Заказ = ПКОРасшифровкаПлатежа.Заказ
		|ГДЕ
		|	ПКОРасшифровкаПлатежа.Ссылка.Проведен
		|	И ПКОРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассыККМСО)
		|	И ПКОРасшифровкаПлатежа.Ссылка.Валюта = &ВалютаЕвро
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""СОДоллар"",
		|	СписокРеализиций.Ссылка,
		|	ПКОРасшифровкаПлатежа.Заказ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПКОРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ПКОРасшифровкаПлатежа.Сумма - ЕСТЬNULL(РКОРасшифровкаПлатежа.Сумма, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПКОРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ВЫБОР
		|					КОГДА ПКОРасшифровкаПлатежа.ВалютаВзаиморасчетов = &ВалютаРуб
		|						ТОГДА ПКОРасшифровкаПлатежа.СуммаВзаиморасчетов
		|					ИНАЧЕ (ПКОРасшифровкаПлатежа.Сумма - ЕСТЬNULL(РКОРасшифровкаПлатежа.Сумма, 0)) * КурсыВалют.Курс
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПКОРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ВЫБОР
		|					КОГДА ПКОРасшифровкаПлатежа.ВалютаВзаиморасчетов = &ВалютаРуб
		|						ТОГДА ПКОРасшифровкаПлатежа.СуммаВзаиморасчетов
		|					ИНАЧЕ (ПКОРасшифровкаПлатежа.Сумма - ЕСТЬNULL(РКОРасшифровкаПлатежа.Сумма, 0)) * КурсыВалют.Курс
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	СписокРеализиций КАК СписокРеализиций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПКОРасшифровкаПлатежа
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РКОРасшифровкаПлатежа
		|			ПО ПКОРасшифровкаПлатежа.Заказ = РКОРасшифровкаПлатежа.Заказ
		|				И (РКОРасшифровкаПлатежа.Ссылка.КассаККМ1 В (&КассыККМСО))
		|				И (РКОРасшифровкаПлатежа.Ссылка.Проведен)
		|				И (РКОРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
		|				И (РКОРасшифровкаПлатежа.Ссылка.Валюта = &ВалютаЕвро)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО ПКОРасшифровкаПлатежа.ВалютаВзаиморасчетов = КурсыВалют.Валюта
		|				И (НАЧАЛОПЕРИОДА(ПКОРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = КурсыВалют.Период)
		|		ПО СписокРеализиций.Заказ = ПКОРасшифровкаПлатежа.Заказ
		|ГДЕ
		|	ПКОРасшифровкаПлатежа.Ссылка.Проведен
		|	И ПКОРасшифровкаПлатежа.Ссылка.КассаККМ1 В(&КассыККМСО)
		|	И ПКОРасшифровкаПлатежа.Ссылка.Валюта = &ВалютаДоллар
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Банк"",
		|	СписокРеализиций.Ссылка,
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	СписокРеализиций КАК СписокРеализиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|		ПО СписокРеализиций.Заказ = ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ
		|ГДЕ
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
		|	И НЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ОплатаИМ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Банк Счет"",
		|	СписокРеализиций.Ссылка,
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	СписокРеализиций КАК СписокРеализиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|		ПО СписокРеализиций.Заказ = ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ
		|ГДЕ
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
		|	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &ТипОплатыСчет
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Банк Пони"",
		|	СписокРеализиций.Ссылка,
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	СписокРеализиций КАК СписокРеализиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|		ПО СписокРеализиций.Заказ = ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ
		|ГДЕ
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
		|	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &ТипОплатыПони
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Банк PayPal"",
		|	СписокРеализиций.Ссылка,
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(СписокРеализиций.Ссылка.Дата, ДЕНЬ)
		|			ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	СписокРеализиций КАК СписокРеализиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|		ПО СписокРеализиций.Заказ = ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ
		|ГДЕ
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
		|	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ТипОплатыИМ = &ТипОплатыPayPal
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(РеализацияТУТовары.Количество) КАК Количество,
		|	СУММА(РеализацияТУТовары.Сумма) КАК Сумма,
		|	СписокРеализиций.Ссылка КАК РеализацияСсылка
		|ПОМЕСТИТЬ ИтогоСуммаКоличество
		|ИЗ
		|	СписокРеализиций КАК СписокРеализиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТУТовары
		|		ПО СписокРеализиций.Ссылка = РеализацияТУТовары.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокРеализиций.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокРеализиций.Ссылка КАК Документ,
		|	СписокРеализиций.Валюта КАК Валюта,
		|	СписокРеализиций.Заказ КАК Заказ,
		|	СписокРеализиций.СуммаДокумента КАК СуммаДокумента,
		|	ВЫБОР
		|		КОГДА СписокРеализиций.Валюта = &ВалютаРуб
		|			ТОГДА СписокРеализиций.СуммаДокумента
		|		ИНАЧЕ ВЫРАЗИТЬ(СписокРеализиций.СуммаДокумента * КурсыВалют.Курс КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК СуммаДокументаРубли,
		|	ЕСТЬNULL(ИтогоСуммаКоличество.Сумма, 0) КАК СуммаИтого,
		|	СУММА(ЕСТЬNULL(Оплаты.Предоплата, 0) + ЕСТЬNULL(Оплаты.ПС, 0) + ЕСТЬNULL(Оплаты.ККОнлайн, 0) + ЕСТЬNULL(Оплаты.КК, 0) + ЕСТЬNULL(Оплаты.Касса, 0) + ЕСТЬNULL(Оплаты.СОруб, 0) + ЕСТЬNULL(Оплаты.СОВРуб, 0) + ЕСТЬNULL(Оплаты.Банк, 0) + ЕСТЬNULL(Оплаты.БанкСчет, 0) + ЕСТЬNULL(Оплаты.БанкПони, 0) + ЕСТЬNULL(Оплаты.БанкPayPal, 0)) КАК СуммаОплат,
		|	ЕСТЬNULL(ИтогоСуммаКоличество.Количество, 0) КАК КоличествоИтого,
		|	СУММА(ЕСТЬNULL(Оплаты.Предоплата, 0)) КАК Пред,
		|	ВЫБОР
		|		КОГДА СУММА(Оплаты.Предоплата + Оплаты.ПС + Оплаты.ККОнлайн + Оплаты.КК + Оплаты.Касса + Оплаты.СОруб + Оплаты.СОВРуб + Оплаты.Банк + Оплаты.БанкСчет + Оплаты.БанкПони + Оплаты.БанкPayPal) ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА СписокРеализиций.Валюта = &ВалютаРуб
		|						ТОГДА СписокРеализиций.СуммаДокумента
		|					ИНАЧЕ ВЫРАЗИТЬ(СписокРеализиций.СуммаДокумента * КурсыВалют.Курс КАК ЧИСЛО(15, 2))
		|				КОНЕЦ
		|		КОГДА ВЫБОР
		|				КОГДА СписокРеализиций.Валюта = &ВалютаРуб
		|					ТОГДА СписокРеализиций.СуммаДокумента
		|				ИНАЧЕ ВЫРАЗИТЬ(СписокРеализиций.СуммаДокумента * КурсыВалют.Курс КАК ЧИСЛО(15, 2))
		|			КОНЕЦ - СУММА(Оплаты.Предоплата + Оплаты.ПС + Оплаты.ККОнлайн + Оплаты.КК + Оплаты.Касса + Оплаты.СОруб + Оплаты.СОВРуб + Оплаты.Банк + Оплаты.БанкСчет + Оплаты.БанкПони + Оплаты.БанкPayPal) < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СписокРеализиций.Валюта = &ВалютаРуб
		|					ТОГДА СписокРеализиций.СуммаДокумента
		|				ИНАЧЕ ВЫРАЗИТЬ(СписокРеализиций.СуммаДокумента * КурсыВалют.Курс КАК ЧИСЛО(15, 2))
		|			КОНЕЦ - СУММА(Оплаты.Предоплата + Оплаты.ПС + Оплаты.ККОнлайн + Оплаты.КК + Оплаты.Касса + Оплаты.СОруб + Оплаты.СОВРуб + Оплаты.Банк + Оплаты.БанкСчет + Оплаты.БанкПони + Оплаты.БанкPayPal)
		|	КОНЕЦ КАК Пост,
		|	СУММА(ЕСТЬNULL(Оплаты.ПС, 0)) КАК ПС,
		|	СУММА(ЕСТЬNULL(Оплаты.ККОнлайн, 0)) КАК ККОнлайн,
		|	СУММА(ЕСТЬNULL(Оплаты.КК, 0)) КАК КК,
		|	СУММА(ЕСТЬNULL(Оплаты.Касса, 0)) КАК ККМ,
		|	СУММА(ЕСТЬNULL(Оплаты.СОруб, 0)) КАК СОруб,
		|	СУММА(ЕСТЬNULL(Оплаты.СОевро, 0)) КАК СОевро,
		|	СУММА(ЕСТЬNULL(Оплаты.СОдоллар, 0)) КАК СОдоллар,
		|	СУММА(ЕСТЬNULL(Оплаты.Банк, 0)) КАК Банк,
		|	СУММА(ЕСТЬNULL(Оплаты.БанкСчет, 0)) КАК БанкСчет,
		|	СУММА(ЕСТЬNULL(Оплаты.БанкПони, 0)) КАК БанкПони,
		|	СУММА(ЕСТЬNULL(Оплаты.БанкPayPal, 0)) КАК БанкПП,
		|	СписокРеализиций.Партнер.Наименование КАК Клиент,
		|	СписокРеализиций.Партнер КАК Партнер,
		|	СписокРеализиций.Дата КАК Дата,
		|	Оплаты.РеализацияСсылка КАК РеализацияСсылка,
		|	СУММА(ЕСТЬNULL(Оплаты.СОВРуб, 0)) КАК СОВРуб
		|ПОМЕСТИТЬ ИтогОплаты
		|ИЗ
		|	СписокРеализиций КАК СписокРеализиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Оплаты КАК Оплаты
		|		ПО СписокРеализиций.Ссылка = Оплаты.РеализацияСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоСуммаКоличество КАК ИтогоСуммаКоличество
		|		ПО СписокРеализиций.Ссылка = ИтогоСуммаКоличество.РеализацияСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО СписокРеализиций.Валюта = КурсыВалют.Валюта
		|			И (НАЧАЛОПЕРИОДА(СписокРеализиций.Дата, ДЕНЬ) = КурсыВалют.Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокРеализиций.Валюта,
		|	Оплаты.РеализацияСсылка,
		|	СписокРеализиций.Партнер,
		|	СписокРеализиций.СуммаДокумента,
		|	СписокРеализиций.Дата,
		|	СписокРеализиций.Ссылка,
		|	СписокРеализиций.Партнер.Наименование,
		|	ВЫБОР
		|		КОГДА СписокРеализиций.Валюта = &ВалютаРуб
		|			ТОГДА СписокРеализиций.СуммаДокумента
		|		ИНАЧЕ ВЫРАЗИТЬ(СписокРеализиций.СуммаДокумента * КурсыВалют.Курс КАК ЧИСЛО(15, 2))
		|	КОНЕЦ,
		|	СписокРеализиций.Заказ,
		|	КурсыВалют.Курс,
		|	ЕСТЬNULL(ИтогоСуммаКоличество.Количество, 0),
		|	ЕСТЬNULL(ИтогоСуммаКоличество.Сумма, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТУТовары.Номенклатура КАК Номенклатура,
		|	РеализацияТУТовары.Характеристика КАК Характеристика,
		|	РеализацияТУТовары.Количество КАК Количество,
		|	РеализацияТУТовары.Сумма КАК Сумма,
		|	РеализацияТУТовары.ПроцентРучнойСкидки + РеализацияТУТовары.ПроцентАвтоматическойСкидки КАК Скидка,
		|	СписокРеализиций.Дата КАК Дата,
		|	СписокРеализиций.Ссылка КАК Документ
		|ИЗ
		|	СписокРеализиций КАК СписокРеализиций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТУТовары
		|		ПО СписокРеализиций.Ссылка = РеализацияТУТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтогОплаты.Документ КАК Документ,
		|	ИтогОплаты.Валюта КАК Валюта,
		|	ИтогОплаты.Заказ КАК Заказ,
		|	ИтогОплаты.СуммаДокумента КАК СуммаДокумента,
		|	ИтогОплаты.СуммаДокументаРубли КАК СуммаДокументаРубли,
		|	ИтогОплаты.СуммаИтого КАК СуммаИтого,
		|	ИтогОплаты.СуммаОплат КАК СуммаОплат,
		|	ИтогОплаты.КоличествоИтого КАК КоличествоИтого,
		|	ИтогОплаты.Пред КАК Пред,
		|	ИтогОплаты.Пост КАК Пост,
		|	ИтогОплаты.ПС КАК ПС,
		|	ИтогОплаты.ККОнлайн КАК ККОнлайн,
		|	ИтогОплаты.КК КАК КК,
		|	ИтогОплаты.ККМ КАК ККМ,
		|	ИтогОплаты.СОруб КАК СОруб,
		|	ИтогОплаты.СОевро КАК СОевро,
		|	ИтогОплаты.СОдоллар КАК СОдоллар,
		|	ИтогОплаты.Банк КАК Банк,
		|	ИтогОплаты.БанкСчет КАК БанкСчет,
		|	ИтогОплаты.БанкПони КАК БанкПони,
		|	ИтогОплаты.БанкПП КАК БанкПП,
		|	ИтогОплаты.Клиент КАК Клиент,
		|	ИтогОплаты.Партнер КАК Партнер,
		|	ИтогОплаты.Дата КАК Дата,
		|	ИтогОплаты.РеализацияСсылка КАК РеализацияСсылка
		|ИЗ
		|	ИтогОплаты КАК ИтогОплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ИтогОплаты.СуммаДокумента) КАК СуммаДокумента,
		|	СУММА(ИтогОплаты.СуммаДокументаРубли) КАК ИтогСумма,
		|	СУММА(ИтогОплаты.СуммаИтого) КАК СуммаИтого,
		|	СУММА(ИтогОплаты.СуммаОплат) КАК СуммаОплат,
		|	СУММА(ИтогОплаты.КоличествоИтого) КАК ИтогКолво,
		|	СУММА(ИтогОплаты.Пред) КАК ИтогПред,
		|	СУММА(ИтогОплаты.Пост) КАК ИтогПост,
		|	СУММА(ИтогОплаты.ПС) КАК ИтогПС,
		|	СУММА(ИтогОплаты.ККОнлайн) КАК ИтогККОнлайн,
		|	СУММА(ИтогОплаты.КК) КАК ИтогКК,
		|	СУММА(ИтогОплаты.ККМ) КАК ИтогКкм,
		|	СУММА(ИтогОплаты.СОруб) КАК ИтогСОруб,
		|	СУММА(ИтогОплаты.СОевро) КАК ИтогСОевро,
		|	СУММА(ИтогОплаты.СОдоллар) КАК ИтогСОдоллар,
		|	СУММА(ИтогОплаты.Банк) КАК ИтогБанк,
		|	СУММА(ИтогОплаты.БанкСчет) КАК ИтогБанкСчет,
		|	СУММА(ИтогОплаты.БанкПони) КАК ИтогБанкПони,
		|	СУММА(ИтогОплаты.БанкПП) КАК ИтогБанкПП,
		|	0 КАК ИтогСкидка,
		|	СУММА(ИтогОплаты.СОВРуб) КАК СОВРуб,
		|	СУММА(ИтогОплаты.СОруб + ИтогОплаты.СОВРуб) КАК ИтогСО
		|ИЗ
		|	ИтогОплаты КАК ИтогОплаты";
#КонецОбласти	

    ВалютаEUR = Справочники.Валюты.НайтиПоКоду("978");
	ВалютаUSD = Справочники.Валюты.НайтиПоКоду("840");
	ВалютаРуб = Справочники.Валюты.НайтиПоКоду("643");
	
	Запрос.УстановитьПараметр("ВалютаДоллар", 		ВалютаUSD);
	Запрос.УстановитьПараметр("ВалютаЕвро", 		ВалютаEUR);
	Запрос.УстановитьПараметр("ВалютаРУБ", 			ВалютаРуб);
	Запрос.УстановитьПараметр("ВидЗаказаМТМ", 		Перечисления.ВидыЗаказов.МТМ);
	Запрос.УстановитьПараметр("КассаККМ", 			КассаККМ);
	Запрос.УстановитьПараметр("КассыККМСО", 		КассыККМСО);
	Запрос.УстановитьПараметр("КонецПериода", 		КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("НачалоПериода", 		НачалоПериода);
	Запрос.УстановитьПараметр("Подразделение", 		Подразделение);
	Запрос.УстановитьПараметр("ТипОплатыPayPal", 	Перечисления.ТипОплатыИМ.ОнлайнPayPal);
	Запрос.УстановитьПараметр("ТипОплатыПони", 		Перечисления.ТипОплатыИМ.Пони);
	Запрос.УстановитьПараметр("ТипОплатыСчет", 		Перечисления.ТипОплатыИМ.Счет);
	ЭквайринговыйТерминал = Новый Массив;
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("online"));
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("babochka.ru"));
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("ИМБарниус"));
	
	Запрос.УстановитьПараметр("ЭквайринговыйТерминалOnline", ЭквайринговыйТерминал);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат РезультатЗапроса;
		
КонецФункции

Функция ПолучитьЗапросВозвратПС(КассаККМ, КассыККМСО, НачалоПериода, КонецПериода, Подразделение)
	
	Запрос = Новый Запрос;
#Область ТекстЗапроса

    Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВозвратПодарочныхСертификатов.Ссылка КАК Ссылка,
		|	ВозвратПодарочныхСертификатов.Партнер КАК Партнер,
		|	ВозвратПодарочныхСертификатов.СуммаДокумента КАК СуммаДокумента,
		|	ВозвратПодарочныхСертификатов.Дата КАК Дата,
		|	ВозвратПодарочныхСертификатов.Валюта КАК Валюта,
		|	ЕСТЬNULL(СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма, 0) КАК СуммаБезнал,
		|	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком КАК ДатаПроведенияБанком
		|ПОМЕСТИТЬ СписокВозвратов_БезналВУчетномПериоде
		|ИЗ
		|	Документ.ВозвратПодарочныхСертификатов КАК ВозвратПодарочныхСертификатов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|		ПО ВозвратПодарочныхСертификатов.Ссылка = СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ
		|			И (СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком <= &КонецПериода)
		|			И (СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком >= &НачалоПериода)
		|ГДЕ
		|	ВозвратПодарочныхСертификатов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВозвратПодарочныхСертификатов.Подразделение В ИЕРАРХИИ(&Подразделение)
		|	И ВозвратПодарочныхСертификатов.Проведен
		|	И ВозвратПодарочныхСертификатов.Статус = &СтатусПробит
		|	И ВозвратПодарочныхСертификатов.КассаККМ В(&КассаККМ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Заказ,
		|	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ.Партнер КАК ЗаказПартнер,
		|	0 КАК СуммаДокумента,
		|	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ.Дата КАК ЗаказДата,
		|	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ.Валюта КАК ЗаказВалюта,
		|	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.СуммаДокумента КАК СуммаБезнал,
		|	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком КАК ДатаПроведенияБанком
		|ПОМЕСТИТЬ СписокВозвратов_БезналНеВУчетномПериоде
		|ИЗ
		|	Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|		ЛЕВОЕ СОЕДИНЕНИЕ СписокВозвратов_БезналВУчетномПериоде КАК СписокРеализиций_БезналВУчетномПериоде
		|		ПО СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ = СписокРеализиций_БезналВУчетномПериоде.Ссылка
		|ГДЕ
		|	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ.КассаККМ.Подразделение В ИЕРАРХИИ(&Подразделение)
		|	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
		|	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ ССЫЛКА Документ.ВозвратПодарочныхСертификатов
		|	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ.КассаККМ В(&КассаККМ)
		|	И СписокРеализиций_БезналВУчетномПериоде.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокВозвратов_БезналВУчетномПериоде.Ссылка КАК Ссылка,
		|	СписокВозвратов_БезналВУчетномПериоде.Партнер КАК Партнер,
		|	СписокВозвратов_БезналВУчетномПериоде.СуммаДокумента КАК СуммаДокумента,
		|	СписокВозвратов_БезналВУчетномПериоде.Дата КАК Дата,
		|	СписокВозвратов_БезналВУчетномПериоде.Валюта КАК Валюта,
		|	СписокВозвратов_БезналВУчетномПериоде.СуммаБезнал КАК СуммаБезнал,
		|	СписокВозвратов_БезналВУчетномПериоде.ДатаПроведенияБанком КАК ДатаПроведенияБанком
		|ПОМЕСТИТЬ СписокВозвратов
		|ИЗ
		|	СписокВозвратов_БезналВУчетномПериоде КАК СписокВозвратов_БезналВУчетномПериоде
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписокВозвратов_БезналНеВУчетномПериоде.Заказ,
		|	СписокВозвратов_БезналНеВУчетномПериоде.ЗаказПартнер,
		|	0,
		|	СписокВозвратов_БезналНеВУчетномПериоде.ЗаказДата,
		|	СписокВозвратов_БезналНеВУчетномПериоде.ЗаказВалюта,
		|	СписокВозвратов_БезналНеВУчетномПериоде.СуммаБезнал,
		|	СписокВозвратов_БезналНеВУчетномПериоде.ДатаПроведенияБанком
		|ИЗ
		|	СписокВозвратов_БезналНеВУчетномПериоде КАК СписокВозвратов_БезналНеВУчетномПериоде
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВозвратПодарочныхСертификатовПодарочныеСертификаты.ПодарочныйСертификат.Наименование КАК ПодарочныйСертификатНаименование,
		|	ВозвратПодарочныхСертификатовПодарочныеСертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ВозвратПодарочныхСертификатовПодарочныеСертификаты.Сумма КАК Сумма,
		|	СписокВозвратов.Ссылка КАК Ссылка
		|ИЗ
		|	СписокВозвратов КАК СписокВозвратов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратПодарочныхСертификатов.ПодарочныеСертификаты КАК ВозвратПодарочныхСертификатовПодарочныеСертификаты
		|		ПО СписокВозвратов.Ссылка = ВозвратПодарочныхСертификатовПодарочныеСертификаты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокВозвратов.Ссылка КАК Ссылка,
		|	СписокВозвратов.Партнер КАК Партнер,
		|	СписокВозвратов.СуммаДокумента КАК СуммаДокумента,
		|	СписокВозвратов.Дата КАК Дата,
		|	СписокВозвратов.Валюта КАК Валюта,
		|	СписокВозвратов.СуммаБезнал КАК СуммаБезнал,
		|	СписокВозвратов.Ссылка.ВыданоНаличными КАК ВыданоНаличными,
		|	СписокВозвратов.ДатаПроведенияБанком КАК ДатаПроведенияБанком
		|ИЗ
		|	СписокВозвратов КАК СписокВозвратов";
#КонецОбласти	

    Запрос.УстановитьПараметр("КассаККМ", 			КассаККМ);
	Запрос.УстановитьПараметр("КассыККМСО", 		КассыККМСО);
	Запрос.УстановитьПараметр("КонецПериода", 		КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("НачалоПериода", 		НачалоПериода);
	Запрос.УстановитьПараметр("Подразделение", 		Подразделение);
	Запрос.УстановитьПараметр("ТипОплатыPayPal", 	Перечисления.ТипОплатыИМ.ОнлайнPayPal);
	Запрос.УстановитьПараметр("ТипОплатыПони", 		Перечисления.ТипОплатыИМ.Пони);
	Запрос.УстановитьПараметр("ТипОплатыСчет", 		Перечисления.ТипОплатыИМ.Счет);
	Запрос.УстановитьПараметр("СтатусПробит", 		Перечисления.СтатусыЧековККМ.Пробит);
	ЭквайринговыйТерминал = Новый Массив;
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("online"));
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("babochka.ru"));
	ЭквайринговыйТерминал.Добавить(Справочники.ЭквайринговыеТерминалы.НайтиПоКоду("ИМБарниус"));
	
	Запрос.УстановитьПараметр("ЭквайринговыйТерминалOnline", ЭквайринговыйТерминал);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат РезультатЗапроса;
		
КонецФункции
