
&НаСервереБезконтекста
Функция ВыполнитьПроверкуЕстьТоварыКРазмещению(Ссылка)
	
	Возврат АдресноеХранениеBabochka.ВыполнитьПроверкуЕстьТоварыКРазмещению(Ссылка, "Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары");
	
КонецФункции

&НаКлиенте
Процедура BG_СтатусПриИзмененииПеред(Элемент)
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьУсловиеАдресности(Склад, ДатаДокумента)
	
	Возврат Склад.АдресныйСклад
	И Склад.ДатаНачалаВеденияУчетаПоЯчейкам < ДатаДокумента;
	
КонецФункции


&НаСервере
Процедура BG_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	АдресноеХранениеBabochka.ЗаполнитьСтатусЗначениемПодготовлено(Отказ, СтандартнаяОбработка, Объект);
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьКодыМаркировки(Команда)
	
	ОткрытьФорму("РегистрСведений.МаркируемыеТоварыВДокументах.Форма.ФормаСписка", Новый Структура("Документ", Объект.Ссылка), ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ba_СкладПриИзмененииПосле(Элемент)
	//bg     
	Если ПроверитьУсловиеАдресности(Объект.Склад, Объект.Дата) Тогда
		ВидимостьСтатуса = Истина;
	Иначе
		ВидимостьСтатуса = Ложь;
	КонецЕсли;
	Элементы.СтатусАдресноеХранение.Видимость = ВидимостьСтатуса;
	//\\bg
КонецПроцедуры

&НаКлиенте
Процедура ba_СтатусПриИзмененииВместо(Элемент) 
	
	Если ПроверитьУсловиеАдресности(Объект.Склад, Объект.Дата)
		И Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.Отгружен") 
		И Объект.СтатусАдресноеХранение <> ПредопределенноеЗначение("Перечисление.СтатусыОтборовРазмещенийТоваровBabochka.Выполнено") Тогда
		
		Объект.Статус = ТекущийСтатус;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для перевода документа в статус ""Отгружен"", необходимо разместить товары в ячейки и установить статус ""Выполнено""";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;   
	
	
	Если ИспользоватьАдресноеХранение Тогда 
		
		Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтбору")
			И Не (Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.Подготовлен")
			ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтбору")) Тогда
			
			Если Модифицированность
				ИЛИ Не Объект.Проведен Тогда
				НовыйСтатус   = Объект.Статус;
				Объект.Статус = ТекущийСтатус;
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("НовыйСтатус", НовыйСтатус);
				
				ТекстВопроса = НСтр("ru = 'Перед изменением статуса документ будет проведен. Продолжить?'");
				ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриСменеСтатусаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
				
				ПоказатьВопрос(ОписаниеОповещения,
				ТекстВопроса,
				РежимДиалогаВопрос.ОКОтмена,
				,
				КодВозвратаДиалога.Отмена);
				Возврат;
			КонецЕсли;
			
			ИзменитьСтатусНаАдресномСкладе();
			
		ИначеЕсли ТекущийСтатус = ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.Подготовлен")
			И Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтбору") Тогда
			
			ТекстСообщения = НСтр("ru = 'Из статуса ""%Подготовлен%"" ордер можно перевести только в статус ""%КОтбору%"".'");
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Подготовлен%" , ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.Подготовлен"));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КОтбору%" , ПредопределенноеЗначение("Перечисление.СтатусыРасходныхОрдеров.КОтбору"));
			
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Объект.Статус = ТекущийСтатус;
			
		Иначе
			
			СтатусПриИзмененииСервер(Ложь, Неопределено);
			
		КонецЕсли;
	Иначе
		СтатусПриИзмененииСервер(Ложь, Неопределено);
	КонецЕсли;
	
	ТекущийСтатус = Объект.Статус;
	
КонецПроцедуры
