
&НаКлиенте
Процедура ba_КартаЛояльностиОбработкаВыбораВместо(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	Если ПроверитьСтатусКарты(ВыбранноеЗначение) = Ложь Тогда
		ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.КартыЛояльности.ПустаяСсылка");
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	СчитанаКартаЛояльности(Неопределено, ВыбранноеЗначение);
	ЭтоЗаказПостоплаты 	= Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказов.Постоплата");	
	ЭтоБонуснаяКарта 	= КартаБонусная();
	Если ЭтоЗаказПостоплаты И ЭтоБонуснаяКарта Тогда
		Режим = РежимДиалогаВопрос.ОК;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
		ТекстВопроса = НСтр("ru = 'Для вида заказа Постоплата не разрешено использование бонусной карты'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
		Объект.КартаЛояльности = ПредопределенноеЗначение("Справочник.КартыЛояльности.ПустаяСсылка"); 
		Возврат;
	КонецЕсли; 
КонецПроцедуры  

&НаКлиенте
Процедура мтмобновить(Команда)
	ОбновитьМТМ();
	заполнитьпредоплаты();
КонецПроцедуры

&НаКлиенте
&После("НазначитьРучнуюСкидкуДляВыделенныхСтрокЗавершение")
Процедура ba_НазначитьРучнуюСкидкуДляВыделенныхСтрокЗавершение(СуммаРучнойСкидкиНаценки, ДополнительныеПараметры)
	Если СуммаРучнойСкидкиНаценки <> Неопределено Тогда
		Объект.ОтветстветственныйЗаРучСкидку = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
		Объект.РазмерРазрешеннойСкидки = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
&После("НазначитьРучнуюСкидкуЗавершение")
Процедура ba_НазначитьРучнуюСкидкуЗавершение(СуммаРучнойСкидкиНаценки, ДополнительныеПараметры)
	Если СуммаРучнойСкидкиНаценки <> Неопределено Тогда
		Объект.ОтветстветственныйЗаРучСкидку = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
		Объект.РазмерРазрешеннойСкидки = 0;
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура НайтиКартуКлиента(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Предупреждение("Нужно сначала записать документ");
		Возврат
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Клиент", Объект.Партнер);
	ПараметрыФормы.Вставить("ДокументПродажи", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.БонуснаяАвторизация", ПараметрыФормы, ЭтаФорма,,,, Новый ОписаниеОповещения("НайтиКартуКлиентаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры 

&НаКлиенте
Процедура НайтиКартуКлиентаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Объект.КартаЛояльности = Результат.Карта;
		СчитанаКартаЛояльности(Неопределено, Результат.Карта);
	КонецЕсли;
КонецПроцедуры      

&НаКлиенте
Процедура НайтиПоНомеру(Команда)
	Если Не ЗначениеЗаполнено(НомерТелефона) Тогда
		ПоказатьПредупреждение(,"Для поиска введите номер телефона");
		Возврат;
	КонецЕсли;
	НомерТелефона = СтрЗаменить(НомерТелефона,"-",""); 
	НомерТелефона = СтрЗаменить(НомерТелефона,"(","");
	НомерТелефона = СтрЗаменить(НомерТелефона,")","");
	НомерТелефона = СтрЗаменить(НомерТелефона,"+","");
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораКлиента", Новый Структура("НомерТелефона", НомерТелефона),,,,,
					Новый ОписаниеОповещения("НайтиКлиентаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры     
				
&НаКлиенте
Процедура ОбновитьКодПодтверждения(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбновленияКодаПодтверждения", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, "Отправить код по SMS?", РежимДиалогаВопрос.ДаНетОтмена,,,"Обновление кода подтверждения");
КонецПроцедуры     

Процедура ОбновитьМТМ()
	ДанныеМТМ =  ПолучитьДанныеПоМТМ();
	Задаток = СуммаМТМПолучить();
	СуммаВЕвро = ДанныеМТМ.СуммаВЕвро;
	//Остаток = ДанныеМТМ.СуммаЗаказа+ДанныеМТМ.Остаток-Объект.ЗадатокМТМ;
	Элементы.Декорация1.Заголовок = "Сумма заказа: " + ДанныеМТМ.СуммаЗаказа;
	Элементы.Декорация6.Заголовок = "Сумма скидки: " + ДанныеМТМ.СуммаСкидки ;
	Элементы.Декорация7.Заголовок = "Остаток: " + ДанныеМТМ.Остаток;
	Элементы.Декорация8.Заголовок = "Курс УУ: " + ДанныеМТМ.Курс;
	Элементы.Декорация12.Заголовок = "Внесенный задаток: " + Задаток.СуммаМТМЕвро;
КонецПроцедуры

&НаСервере
&После("ОбработатьШтрихкодыСервер")
Процедура ba_ОбработатьШтрихкодыСервер(СтруктураПараметровДействия, КэшированныеЗначения)
	ПроверитьТоварыMarketPlace();
КонецПроцедуры 

&НаКлиенте
Процедура ba_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	ПроверитьТоварыMarketPlace(); 
	ПоказатьВопросОСменеВидаЗаказа();
КонецПроцедуры    

Процедура ПогаситьПромокод()
	ПараметрыПромокодаСкидки = ПараметрыПромокода;
	
	Если ПараметрыПромокодаСкидки = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
		
	Если ПараметрыПромокодаСкидки.Промокод.Персонализирован 
		ИЛИ ПараметрыПромокодаСкидки.Промокод.Одноразовый Тогда
		
		ЗаписьРегистра = РегистрыСведений.ОднократныеПромокодыНаСкидку.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Идентификатор 	= ПараметрыПромокодаСкидки.Идентификатор;
		ЗаписьРегистра.Партнер 			= ПараметрыПромокодаСкидки.Партнер;
		ЗаписьРегистра.НомерТелефона 	= ПараметрыПромокодаСкидки.НомерТелефона;
		ЗаписьРегистра.Промокод 		= ПараметрыПромокодаСкидки.Промокод;
		ЗаписьРегистра.Прочитать();
		
		Попытка
			ЗаписьРегистра.Состояние = Перечисления.СтатусыДействияСкидок.НеДействует;
			ЗаписьРегистра.ДокументДвижения = Объект.Ссылка;
			ЗаписьРегистра.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	Иначе
		//обезличенные запишем с привязкой к покупателю и документу
		ЗаписьРегистра = РегистрыСведений.ОднократныеПромокодыНаСкидку.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Идентификатор 	= ПараметрыПромокодаСкидки.Идентификатор;
		ЗаписьРегистра.Партнер 			= Объект.Партнер;
		//ЗаписьРегистра.НомерТелефона 	= ПараметрыПромокодаСкидки.НомерТелефона;
		ЗаписьРегистра.Промокод 		= ПараметрыПромокодаСкидки.Промокод;
		ЗаписьРегистра.Состояние 		= Перечисления.СтатусыДействияСкидок.НеДействует;
		ЗаписьРегистра.ДокументДвижения = Объект.Ссылка;
		ЗаписьРегистра.ДействуетС 		= Объект.Ссылка.Дата;
		ЗаписьРегистра.ДействуетДо 		= Объект.Ссылка.Дата;
					
		Попытка
			ЗаписьРегистра.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);	
КонецПроцедуры  

&НаКлиенте
Процедура ПодтверждениеПостоплатыЗавершение(Струк, ДополнительныеПараметры) Экспорт
	Если Струк <> Неопределено Тогда  	
		Объект.ОтветстветственныйЗаПостоплату = Струк.Ответственный;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьКодПодтверждения(Команда)
	Элементы.КодПодтвержденияПВЗ.РежимПароля = Ложь;
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаКодаПодтверждения(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда   	
		Если Результат = Объект.КодПодтвержденияПВЗ Тогда
			Элементы.ДекорацияКодПравильный.Видимость = Истина;
			Элементы.ДекорацияКодНеправильный.Видимость = Ложь;
			Элементы.ПроверитьКодПодтверждения.Видимость = Ложь;
		Иначе
			Элементы.ДекорацияКодНеправильный.Видимость = Истина;
			Элементы.ДекорацияКодПравильный.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ba_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	ПогаситьПромокод();
	ПроверитьОрганизацииВСвязанныхДокументах();
КонецПроцедуры 

&НаКлиенте
Процедура ПослеОтветаНаВопросОбновленияКодаПодтверждения(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда   	
		Если Результат = КодВозвратаДиалога.Да Тогда
			Код = ОбновитьКодПодтвержденияНаСервере();
			Отправлено = ОтправитьСМСНаСервере(Код);
			ОписаниеОповещенияПослеВыполнения = Новый ОписаниеОповещения("ПослеОтправкиСМС", ЭтаФорма);
			
			Если Отправлено Тогда
				ПоказатьПредупреждение(ОписаниеОповещенияПослеВыполнения, "SMS успешно отправлено", 5, "BABOCHKA");
			Иначе
				ПоказатьПредупреждение(ОписаниеОповещенияПослеВыполнения, "Ошибка отправки SMS", 5, "BABOCHKA");
			КонецЕсли;
			
		ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
			Код = ОбновитьКодПодтвержденияНаСервере();
			
		ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;
		
		ПоказатьПредупреждение(ОписаниеОповещенияПослеВыполнения, "Требуется записать документ!", 5, "BABOCHKA");

		Элементы.ПоказатьКодПодтверждения.Видимость = Истина;
		Элементы.ПроверитьКодПодтверждения.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры       

&НаКлиенте
Процедура ПослеСчитыванияДанных(Результат = Неопределено, ДопПараметры) Экспорт
	Если ДопПараметры.Свойство("Действие") И ДопПараметры.Действие = "ВыдатьПромокод" Тогда
		ОткрытьФорму("РегистрСведений.ОднократныеПромокодыНаСкидку.ФормаЗаписи", Новый Структура("Партнер", Объект.Партнер),ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат) И ДопПараметры.Свойство("Действие") И ДопПараметры.Действие = "АктивироватьПромокод" Тогда
		ПараметрыПромокодаСкидки = НайтиПромокод(Результат, Объект.Партнер);
			
		Если ПараметрыПромокодаСкидки <> Неопределено Тогда
			ПримененныеСкидки = Объект.СкидкиНаценки.НайтиСтроки(Новый Структура("СкидкаНаценка", ПараметрыПромокодаСкидки.Скидка));
			
			Если ПримененныеСкидки.Количество() = 0 Тогда
				СуммаДоРасчетаСкидок = Объект.Товары.Итог("Сумма");
				
				СтрокаТЧ = Объект.СкидкиНаценки.Добавить();
				СтрокаТЧ.СкидкаНаценка = ПараметрыПромокодаСкидки.Скидка;
				
				Объект.СкидкиРассчитаны = Ложь;
				
				//РАСЧЕТ СКИДОК
				СтруктураПараметры = Новый Структура;
				СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
				СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
				СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
				СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
				
				СтруктураСообщений = РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры); 
								
				Если СтруктураСообщений.Сообщения.Количество() > 0 И СтруктураСообщений.АвтоматическиОткрывать Тогда
					ОткрытьФорму("ОбщаяФорма.СообщенияСкидокНаценок", СтруктураСообщений, ЭтаФорма, УникальныйИдентификатор);
				КонецЕсли;
					
				Если СуммаДоРасчетаСкидок > Объект.Товары.Итог("Сумма") Тогда
					ПоказатьОповещениеПользователя(
					НСтр("ru = 'Промокод'"),
					,
					НСтр("ru = 'Промокод на скидку активирован'"),
					БиблиотекаКартинок.Информация32);
					
					//ПогаситьПромокод(ПараметрыПромокода);
					ПараметрыПромокода = ПараметрыПромокодаСкидки;
					Модифицированность = Истина;
				Иначе
					ПоказатьОповещениеПользователя(
					НСтр("ru = 'Промокод'"),
					,
					НСтр("ru = 'Промокод не применен. Нет подходящих товаров для применения промокода'"),
					БиблиотекаКартинок.Информация32);
					
					//ПогаситьПромокод(ПараметрыПромокода);
					ПараметрыПромокода = Неопределено;
				КонецЕсли;
			Иначе 
				ПоказатьПредупреждение(, "Скидка уже учтена!");	
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ba_ПриОткрытииПосле(Отказ)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыПромокода = НайтиПримененныйПромокод();
		ПроверитьТоварыMarketPlace();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ba_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
	ЭтоЗаказИМ 			= Объект.ВидЗаказа = Перечисления.ВидыЗаказов.ИМ;
	ЭтоЗаказМТМ 		= Объект.ВидЗаказа = Перечисления.ВидыЗаказов.МТМ;
	ЭтоЗаказСотрудник 	= Объект.ВидЗаказа = Перечисления.ВидыЗаказов.Сотрудник;
	
	Элементы.ДоставкаТранспортнойКомпанией.Видимость = ЭтоЗаказИМ;
	Элементы.ТранспортнаяКомпания.Видимость = Элементы.ДоставкаТранспортнойКомпанией.Видимость И Объект.ДоставкаТранспортнойКомпанией;
	Элементы.МТМстр.Видимость 		= ЭтоЗаказМТМ;
	Элементы.Постоплата.Видимость 	= ЭтоЗаказМТМ;
	Элементы.ПродажаФормы.Видимость = ЭтоЗаказСотрудник;
	Элементы.РазрешеноРуководством.Видимость = ЭтоЗаказСотрудник;
	
	Если Объект.Проведен И НЕ РольДоступна("ДобавлениеИзменениеЗаказовКлиентов")
					И НЕ РольДоступна("ПолныеПрава") Тогда
		Для Каждого Элем Из Элементы.Товары.ПодчиненныеЭлементы Цикл 
			Элем.ТолькоПросмотр = Истина;
		КонецЦикла;
		Элементы.Партнер.ТолькоПросмотр = Ложь;
		Элементы.ТоварыВариантОбеспечения.ТолькоПросмотр = Ложь;
		Элементы.ТоварыГруппаОтмена.ТолькоПросмотр = Ложь;
		Элементы.Партнер.ТолькоПросмотр = Ложь;
		Элементы.Подразделение.ТолькоПросмотр = Ложь;
		Элементы.ТоварыПроцентРучнойСкидки.ТолькоПросмотр = НЕ ЭтоЗаказИМ;
	КонецЕсли;

	Если Объект.Проведен Тогда 
		ПроведенныеСтроки = Объект.Товары.Количество();
	Иначе 
		ПроведенныеСтроки = 0;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	КурсыВалютСрезПоследних.Курс
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	Запрос.УстановитьПараметр("Валюта", Справочники.Валюты.НайтиПоКоду("978"));
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда 
		Курс = Выб.Курс;
	КонецЕсли;	
	
	Данные = СуммаМТМПолучить();	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ЗадатокМТМ =  Данные.СуммаМТМЕвро;
		СуммаВЕвро 		  = Данные.СуммаМТМЕвро;
		ОбновитьМТМ();
		заполнитьпредоплаты();
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Склад) и Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Организация = Объект.Склад.Организация;
	КонецЕсли;
	
	ВидимостьКурьеров = Объект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента;
	Элементы.Курьер.Видимость = ВидимостьКурьеров; 
	Элементы.ДанныеДоставки.Видимость = ВидимостьКурьеров; 
	Элементы.ОтвественныйМенеджер.Видимость = ВидимостьКурьеров;
		
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
		ТранспортнаяКомпанияЧисло = 2;
	ИначеЕсли ЗначениеЗаполнено(Объект.ТранспортнаяКомпания)
		И Объект.ТранспортнаяКомпания <> Перечисления.ТранспортныеКомпании.BABOCHKA Тогда 
		ТранспортнаяКомпанияЧисло = 0;
	Иначе
		ТранспортнаяКомпанияЧисло = 1;
	КонецЕсли;
	// Харитонов вопрос требуется ли данный блок
	//УстановитьВидимостьДоставки();
	
	ВидимостьДоставкиВЗаказеКлиента = Бабочка.ПолучитьЗначениеДинамическихНастроек("ВидимостьДоставкиВЗаказеКлиента", Истина);
	
	Элементы.ГруппаПВЗ.Видимость = ЭтоЗаказИМ;
	Элементы.ЖелаемаяДатаОтгрузки.ТолькоПросмотр = НЕ ЭтоЗаказИМ;
	
	Если НЕ ЗначениеЗаполнено(Объект.КодПодтвержденияПВЗ) Тогда
		Элементы.ПроверитьКодПодтверждения.Видимость = Ложь;
		Элементы.ПоказатьКодПодтверждения.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры   

&НаКлиенте
Процедура ПроверитьКодПодтверждения(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаКодаПодтверждения", ЭтаФорма);
	ПоказатьВводСтроки(ОписаниеОповещения,,"Введите код подтверждения", 6);
КонецПроцедуры        

Процедура ПроверитьОрганизацииВСвязанныхДокументах()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаДок.Ссылка КАК ЗаказКлиента,
		|	РеализацияТоваровУслуг.Ссылка КАК РеализацияТоваров
		|ПОМЕСТИТЬ ВТ_Отгрузка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиентаДок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ЗаказКлиентаДок.Ссылка = РеализацияТоваровУслуг.ЗаказКлиента.Ссылка
		|ГДЕ
		|	ЗаказКлиентаДок.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйКассовыйОрдер.Ссылка КАК ПриходныйКассовыйОрдер,
		|	ВТ_Отгрузка.ЗаказКлиента КАК ЗаказКлиента,
		|	ВТ_Отгрузка.РеализацияТоваров КАК РеализацияТоваров
		|ПОМЕСТИТЬ ВТ_ПКО
		|ИЗ
		|	ВТ_Отгрузка КАК ВТ_Отгрузка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
		|		ПО (ПриходныйКассовыйОрдер.ДокументОснование = ВТ_Отгрузка.ЗаказКлиента)
		|ГДЕ
		|	ПриходныйКассовыйОрдер.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка КАК ЭквайринговаяОперация,
		|	ВТ_Отгрузка.ЗаказКлиента КАК ЗаказКлиента,
		|	ВТ_Отгрузка.РеализацияТоваров КАК РеализацияТоваров
		|ПОМЕСТИТЬ ВТ_Эквайринг
		|ИЗ
		|	ВТ_Отгрузка КАК ВТ_Отгрузка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
		|		ПО ВТ_Отгрузка.ЗаказКлиента = ОперацияПоПлатежнойКартеРасшифровкаПлатежа.ОснованиеПлатежа
		|ГДЕ
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен
		|	И ОперацияПоПлатежнойКартеРасшифровкаПлатежа.ОснованиеПлатежа ССЫЛКА Документ.ЗаказКлиента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПКО.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер,
		|	ЕСТЬNULL(ВТ_ПКО.ЗаказКлиента, ВТ_Эквайринг.ЗаказКлиента) КАК ЗаказКлиента,
		|	ЕСТЬNULL(ВТ_ПКО.РеализацияТоваров, ВТ_Эквайринг.РеализацияТоваров) КАК РеализацияТоваров,
		|	ВТ_Эквайринг.ЭквайринговаяОперация КАК ЭквайринговаяОперация
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_ПКО КАК ВТ_ПКО
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Эквайринг КАК ВТ_Эквайринг
		|		ПО ВТ_ПКО.ЗаказКлиента = ВТ_Эквайринг.ЗаказКлиента
		|			И ВТ_ПКО.РеализацияТоваров = ВТ_Эквайринг.РеализацияТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.ЗаказКлиента КАК ЗаказКлиента,
		|	ВТ_Итог.РеализацияТоваров КАК РеализацияТоваров,
		|	ВТ_Итог.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер,
		|	ВТ_Итог.ЭквайринговаяОперация КАК ЭквайринговаяОперация,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_Итог.ПриходныйКассовыйОрдер ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_Итог.ЗаказКлиента.Организация <> ВТ_Итог.ПриходныйКассовыйОрдер.Организация
		|							ИЛИ ВТ_Итог.ЗаказКлиента.Организация <> ВТ_Итог.РеализацияТоваров.Организация
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		КОГДА НЕ ВТ_Итог.ЭквайринговаяОперация ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_Итог.ЗаказКлиента.Организация <> ВТ_Итог.ЭквайринговаяОперация.Организация
		|							ИЛИ ВТ_Итог.ЗаказКлиента.Организация <> ВТ_Итог.РеализацияТоваров.Организация
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		КОГДА НЕ ВТ_Итог.РеализацияТоваров ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_Итог.ЗаказКлиента.Организация <> ВТ_Итог.РеализацияТоваров.Организация
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьОшибки
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Оповестить = Выборка.ЕстьОшибки;
	Иначе
		Оповестить = Ложь;
	КонецЕсли;
	
	Если Оповестить Тогда
		Сообщить("Проверьте правильность заполнения связанных документов! Поле 'Организация' отличается!");
	КонецЕсли;
КонецПроцедуры   

Процедура ПроверитьТоварыMarketPlace()
	Объект.ЕстьТоварыMarketPlace = Ложь;
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл 
		Если НЕ СтрокаТЧ.Отменено Тогда
			Объект.ЕстьТоварыMarketPlace = Объект.ЕстьТоварыMarketPlace ИЛИ СтрокаТЧ.Номенклатура.ЭтоMarketPlace;
		КонецЕсли;	
	КонецЦикла;
    Элементы.ДекорацияMarketPlace.Видимость = Объект.ЕстьТоварыMarketPlace;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Отменено КАК Отменено
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(ВТ_Товары.Номенклатура КАК Справочник.Номенклатура).Реализация КАК Поле1
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|ГДЕ
		|	НЕ ВЫРАЗИТЬ(ВТ_Товары.Отменено КАК БУЛЕВО)
		|	И (ВЫРАЗИТЬ(ВТ_Товары.Номенклатура КАК Справочник.Номенклатура).Реализация = ИСТИНА
		|			ИЛИ ВЫРАЗИТЬ(ВТ_Товары.Номенклатура КАК Справочник.Номенклатура).ФинансоваяОтчетность = ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(ВТ_Товары.Номенклатура КАК Справочник.Номенклатура).Реализация КАК Поле1
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|ГДЕ
		|	НЕ ВЫРАЗИТЬ(ВТ_Товары.Отменено КАК БУЛЕВО)
		|	И ВЫРАЗИТЬ(ВТ_Товары.Номенклатура КАК Справочник.Номенклатура).BG = ИСТИНА
		|	И ВЫРАЗИТЬ(ВТ_Товары.Номенклатура КАК Справочник.Номенклатура).ФинансоваяОтчетность = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить(,"Номенклатура, Отменено"));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();

	Элементы.ТоварНаРеализации.Видимость = НЕ РезультатЗапроса[1].Пустой();
	Элементы.ЗапрещенаПродажа.Видимость = НЕ РезультатЗапроса[2].Пустой();
КонецПроцедуры 

&НаКлиенте
Процедура Промокоды(Команда)  
	Если НЕ Объект.Проведен Тогда
		ПоказатьПредупреждение(,"Добавить промокод можно только в проведенный документ!");
		Возврат;
	КонецЕсли;  
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПромокодыПослеОтветаНаВопрос", ЭтаФорма);
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("АктивироватьПромокод", "Активировать промокод");
	СписокКнопок.Добавить("ДеактивироватьПромокод", "Деактивировать примененный промокод");
	
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
	
	ПоказатьВопрос(ОписаниеОповещения, "Выберите действие", СписокКнопок);
КонецПроцедуры  

&НаКлиенте
Процедура ПромокодыПослеОтветаНаВопрос(Результат, Параметры) Экспорт
	Если Результат <> КодВозвратаДиалога.Отмена Тогда
		СчитатьКодПромокода(Результат);		
	КонецЕсли;	
КонецПроцедуры   

&НаКлиенте
&После("СпособМестоДоставкиПеревозчикПриИзменении")
Процедура ba_СпособМестоДоставкиПеревозчикПриИзменении(Элемент)
	//bg
	ВидимостьКурьеров = Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ДоКлиента");
	Элементы.Курьер.Видимость = ВидимостьКурьеров; 
	Элементы.ДанныеДоставки.Видимость = ВидимостьКурьеров; 
	Элементы.ОтвественныйМенеджер.Видимость = ВидимостьКурьеров;
	Если НЕ ВидимостьКурьеров Тогда
		ФизЛицоПустаяСсылка = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
		
		Объект.Курьер = ФизЛицоПустаяСсылка;
		Объект.СтатусДоставки = ПредопределенноеЗначение("Справочник.СтатусыДоставки.ПустаяСсылка");
		Объект.ОтвественныйМенеджер = ФизЛицоПустаяСсылка;
		Объект.ДатаДоставки = Дата(1,1,1);
	КонецЕсли; 
	//\\
КонецПроцедуры      

&НаКлиенте
Процедура СтатусДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтатусОтгрузить = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить");
	ЕстьНеотгруженныеТовары = Ложь;
	
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.СтатусыДоставки.ПереданоВДоставку") Тогда
		Если Объект.ЗонаДоставки = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка") Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеЗавершение", ЭтаФорма, );
			ПоказатьПредупреждение(ОписаниеОповещения, "Заполните зону доставки!", 5, "Babochka");
			
			ВыбранноеЗначение = Объект.СтатусДоставки;
			
			Возврат;
		КонецЕсли; 
		
		Для Каждого СтрокаТЧ Из Объект.Товары Цикл
			Если СтрокаТЧ.Отменено Тогда
				Продолжить;	
			КонецЕсли; 
			
			Если СтрокаТЧ.ВариантОбеспечения <> СтатусОтгрузить Тогда
				ЕстьНеотгруженныеТовары = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		
		Если ЕстьНеотгруженныеТовары Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеЗавершение", ЭтаФорма, );
			ТекстОповещения = "В документе есть неотгруженные товары!
			|Невозможно изменить статус.";
			ПоказатьПредупреждение(ОписаниеОповещения,ТекстОповещения, 5, "Babochka");
			
			ВыбранноеЗначение = Объект.СтатусДоставки;
			
			Возврат;
		КонецЕсли;
		
		Если НЕ КодыМаркировкиПодобраны() Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеЗавершение", ЭтаФорма, );
			ПоказатьПредупреждение(ОписаниеОповещения, "Заполните коды маркировок. Товары -> Заполнить -> Добавить коды маркировки", 5, "Babochka");
			
			ВыбранноеЗначение = Объект.СтатусДоставки;
			
			Возврат;
		КонецЕсли; 
		
		Если Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОбеспечению") Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеЗавершение", ЭтаФорма, );
			ПоказатьПредупреждение(ОписаниеОповещения, "Статус заказа должен быть К выполнению!", 5, "Babochka");
			
			ВыбранноеЗначение = Объект.СтатусДоставки;
			
			Возврат;
		КонецЕсли;
		
		Объект.ДатаДоставки = ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ba_СчитатьКартуЛояльностиВместо(Команда)  
	Если Объект.Согласован Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Партнер", Объект.Партнер);
	ПараметрыОткрытия.Вставить("Организация", Объект.Организация);
	ПараметрыОткрытия.Вставить("ВидЗаказа", Объект.ВидЗаказа);  
	
	// ЭлектронноеВзаимодействие.СервисEDI
	Если Не РедактированиеРеквизитовEDIКлиентСервер.РеквизитДоступенДляРедактирования(ЭтотОбъект, "Покупатель") Тогда
		ПараметрыОткрытия.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыОткрытия.Вставить("ИзменениеКонтрагентаНедоступно", Истина);
		ПараметрыОткрытия.Вставить("ИзменениеПартнераНедоступно", Истина);
	КонецЕсли;
	// Конец ЭлектронноеВзаимодействие.СервисEDI
	
	ОткрытьФорму(
	"Справочник.КартыЛояльности.Форма.СчитываниеКартыЛояльности",
	ПараметрыОткрытия,
	ЭтаФорма,
	ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры      

&НаКлиенте
Процедура СчитатьКодПромокода(Действие)
	ТекстСообщения = "Сканируйте промокод";
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСчитыванияДанных", ЭтаФорма, Новый Структура("Действие", Действие));
	Если Действие = "АктивироватьПромокод" Тогда
		ПоказатьВводЗначения(ОписаниеОповещения, "", ТекстСообщения);
	ИначеЕсли Действие = "ДеактивироватьПромокод" Тогда
		ОтменитьСкидкиПоПромокоду();	
	Иначе
		ПослеСчитыванияДанных(, Новый Структура("Действие", Действие)); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ba_ТоварыКоличествоУпаковокПриИзмененииПеред(Элемент)
	Если Элементы.Товары.ТекущиеДанные.КоличествоУпаковок <> 1 И Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказов.МТМ") Тогда 
		Элементы.Товары.ТекущиеДанные.КоличествоУпаковок = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ba_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	ПроверитьТоварыMarketPlace();
	ПоказатьВопросОСменеВидаЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура ba_ТоварыПередУдалениемПеред(Элемент, Отказ)
	Если Элементы.Товары.ТекущаяСтрока < ПроведенныеСтроки Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ba_ТоварыПослеУдаленияПосле(Элемент)
	ПроверитьТоварыMarketPlace();
КонецПроцедуры

&НаКлиенте
Процедура ba_ТоварыПриНачалеРедактированияВместо(Элемент, НоваяСтрока, Копирование)
	РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.Товары, ЭтотОбъект);
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ПродажиКлиент.СтрокаНоменклатурыПриНачалеРедактирования(ЭтаФорма, "Товары", ТекущиеДанные, НоваяСтрока, Копирование);
	
	Если НоваяСтрока И Не Копирование
		И Объект.ХозяйственнаяОперация <> ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПоставкаПодПринципала") Тогда
		ТекущиеДанные.Подразделение = Объект.Подразделение;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекущиеДанные.КодСтроки = 0;
		Если Копирование Тогда
			ТекущиеДанные.ID = 0;
			ТекущиеДанные.ВидЦены = ПолучитьВидЦеныРозничная();
		КонецЕсли;
		Если Объект.НеОтгружатьЧастями Тогда
			ТекущиеДанные.ДатаОтгрузки = Объект.ДатаОтгрузки;
		КонецЕсли;
	КонецЕсли;
	
	Если Копирование Тогда
		СтруктураДействий = Новый Структура;
		ДобавитьДействияОбеспеченияНаКлиенте(СтруктураДействий,
		"ВариантОбеспечения,Доступно,СкладОбязателен,ДатаОтгрузкиОбязательна");
		СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус",
		Новый Структура("Склад, ПараметрыУказанияСерий", ТекущиеДанные.Склад, ПараметрыУказанияСерий));
		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, КэшированныеЗначения);
		ОбеспечениеВДокументахКлиентСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	КонецЕсли;
	
	ВзаиморасчетыКлиент.ТабличнаяЧастьПриНачалеРедактирования(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ba_ТоварыПроцентРучнойСкидкиПриИзмененииПосле(Элемент)
	Объект.ОтветстветственныйЗаРучСкидку = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	Объект.РазмерРазрешеннойСкидки = 0;
КонецПроцедуры

&НаКлиенте
Процедура ba_ТоварыСуммаРучнойСкидкиПриИзмененииПосле(Элемент)
	Объект.ОтветстветственныйЗаРучСкидку = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	Объект.РазмерРазрешеннойСкидки = 0;
КонецПроцедуры   

&НаКлиенте
Процедура ТранспортнаяКомпанияЧислоПриИзменении(Элемент)
	УстановитьВидимостьДоставки();
	
	Если ТранспортнаяКомпанияЧисло = 0 Тогда 
		Объект.ДоставкаТранспортнойКомпанией = Истина;
		Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ТранспортнаяКомпания");	
		Объект.ТранспортнаяКомпания = ПредопределенноеЗначение("Перечисление.ТранспортныеКомпании.ПустаяСсылка");
		
	ИначеЕсли ТранспортнаяКомпанияЧисло = 1 Тогда 
		Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ДоКлиента");	
		Объект.ДоставкаТранспортнойКомпанией = Истина;
		Объект.ТранспортнаяКомпания = ПредопределенноеЗначение("Перечисление.ТранспортныеКомпании.BABOCHKA");
		
	ИначеЕсли ТранспортнаяКомпанияЧисло = 2 Тогда
		Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз");
		Объект.ДоставкаТранспортнойКомпанией = Ложь;
		Объект.ТранспортнаяКомпания = ПредопределенноеЗначение("Перечисление.ТранспортныеКомпании.ПустаяСсылка");
	КонецЕсли;
	
	Модифицированность = Истина;
КонецПроцедуры    

Функция РазрешеноИспользоватьПромокод(Промокод, Партнер, РазрешенноеКоличествоПримененийКода)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(1) КАК КоличествоПрименений
		|ИЗ
		|	РегистрСведений.ОднократныеПромокодыНаСкидку КАК ОднократныеПромокодыНаСкидку
		|ГДЕ
		|	ОднократныеПромокодыНаСкидку.Промокод = &Промокод
		|	И ОднократныеПромокодыНаСкидку.Партнер = &Партнер
		|	И ОднократныеПромокодыНаСкидку.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.НеДействует)";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Промокод", Промокод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	КоличествоПрименений = 0;
	
	Пока Выборка.Следующий() Цикл
		КоличествоПрименений = КоличествоПрименений + ?(ЗначениеЗаполнено(Выборка.КоличествоПрименений), Выборка.КоличествоПрименений, 0);
	КонецЦикла;
	
	Возврат КоличествоПрименений < РазрешенноеКоличествоПримененийКода;
КонецФункции

&НаКлиенте
Процедура ЭтоОплатаЧастямиПриИзменении(Элемент)
	Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ДоКлиента");
КонецПроцедуры  

Функция НайтиПримененныйПромокод()
	УстановитьПривилегированныйРежим(Истина);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОднократныеПромокодыНаСкидку.Промокод.Скидка КАК Скидка,
		|	ОднократныеПромокодыНаСкидку.Промокод КАК Промокод,
		|	ОднократныеПромокодыНаСкидку.Идентификатор КАК Идентификатор,
		|	ОднократныеПромокодыНаСкидку.Партнер КАК Партнер,
		|	ОднократныеПромокодыНаСкидку.НомерТелефона КАК НомерТелефона,
		|	ОднократныеПромокодыНаСкидку.Состояние КАК Состояние,
		|	ОднократныеПромокодыНаСкидку.ДействуетС КАК ДействуетС,
		|	ОднократныеПромокодыНаСкидку.ДействуетДо КАК ДействуетДо
		|ИЗ
		|	РегистрСведений.ОднократныеПромокодыНаСкидку КАК ОднократныеПромокодыНаСкидку
		|ГДЕ
		|	ОднократныеПромокодыНаСкидку.Промокод.Статус = ЗНАЧЕНИЕ(перечисление.СтатусыВидовКартЛояльности.действует)
		|	И ОднократныеПромокодыНаСкидку.ДокументДвижения = &ДокументДвижения
		|	И ВЫБОР
		|			КОГДА ОднократныеПромокодыНаСкидку.Промокод.Персонализирован
		|				ТОГДА ОднократныеПромокодыНаСкидку.Партнер = &Партнер
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДокументДвижения", Объект.Ссылка);
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Структура = Новый Структура("Скидка, Промокод, Идентификатор, Партнер, НомерТелефона, Состояние, ДействуетС, ДействуетДо");
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
		Возврат Структура;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции   

&НаСервереБезКонтекста
Функция НайтиКонтрагента(Партнер)
	Возврат Справочники.Контрагенты.НайтиПоРеквизиту("Партнер", Партнер); 
КонецФункции  

Функция ПолучитьДанныеПоМТМ()
	Данные = Новый Структура();
	СуммаРучнойСкидки = 0;
	СуммаАвтоматическойСкидки = 0;
	Сумма = 0;
	Евро = Объект.Валюта;
	Для Каждого Стр Из Объект.Товары Цикл
		Если Стр.Отменено = Ложь Тогда
			СуммаРучнойСкидки = СуммаРучнойСкидки + Стр.СуммаРучнойСкидки; 
			СуммаАвтоматическойСкидки = СуммаАвтоматическойСкидки + Стр.СуммаАвтоматическойСкидки;
			Сумма = Сумма + Стр.Сумма;
		КонецЕсли;
	КонецЦикла;
	СуммаЗаказа = РаботаСКурсамиВалют.ПересчитатьВВалюту(Сумма, Объект.Валюта, Евро, Объект.Дата);
	СуммаСкидки = РаботаСКурсамиВалют.ПересчитатьВВалюту(СуммаРучнойСкидки + СуммаАвтоматическойСкидки, Объект.Валюта, Евро, Объект.Дата);

	Данные.Вставить("СуммаЗаказа", СуммаЗаказа);
	Данные.Вставить("СуммаСкидки", СуммаСкидки);
	
	Запрос = Новый Запрос;
	Запрос.Текст =  ТекстЗапросаОстаткиРасчетов();
		
	Запрос.УстановитьПараметр("ЗаказКлиента", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Остаток = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		  Остаток = ВыборкаДетальныеЗаписи.КОплате;
	КонецЦикла;
	
	Остаток = РаботаСКурсамиВалют.ПересчитатьВВалюту(Остаток, Объект.Валюта, Евро, Объект.Дата);
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РасчетыСКлиентамиОбороты.Регистратор КАК документ,
	               |	-РасчетыСКлиентамиОбороты.СуммаОборот КАК Сумма,
	               |	РасчетыСКлиентамиОбороты.Период КАК дата,
	               |	РасчетыСКлиентамиОбороты.Регистратор.Дата КАК РегистраторДата
	               |ИЗ
	               |	РегистрНакопления.РасчетыСКлиентами.Обороты(, , Регистратор, ОбъектРасчетов.Объект = &ЗаказКлиента) КАК РасчетыСКлиентамиОбороты
	               |ГДЕ
	               |	РасчетыСКлиентамиОбороты.СуммаОборот < 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РегистраторДата УБЫВ";
	Запрос.УстановитьПараметр("ЗаказКлиента", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ДатаДок = Объект.Дата;
	Иначе
		ДатаДок = ТекущаяДатаСеанса();
	КонецЕсли;
	Если НЕ Результат.Пустой() Тогда
		 Выборка = Результат.Выгрузить();
		 ДатаДок = Выборка[0].РегистраторДата;
	КонецЕсли;

	//СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(объект.Валюта, ?(ЗначениеЗаполнено(Объект.Ссылка), объект.Дата, ТекущаяДатаСеанса()));
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчета.Получить(), ДатаДок);
	
	Данные.Вставить("Остаток", Формат(Остаток,"ЧДЦ=0"));
	Данные.Вставить("Курс", Формат(СтруктураКурса.Курс,"ЧДЦ=2"));

	СуммаВЕвро = РаботаСКурсамиВалют.ПересчитатьВВалюту(Объект.ЗадатокМТМ, Объект.Валюта, Евро, Объект.Дата);
	Данные.Вставить("СуммаВЕвро", СуммаВЕвро);
	
	Возврат Данные;
КонецФункции      

Функция СуммаМТМПолучить()
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасчетыСКлиентамиОбороты.Регистратор КАК документ,
	|	-РасчетыСКлиентамиОбороты.СуммаОборот КАК Сумма,
	|	РасчетыСКлиентамиОбороты.Период КАК дата,
	|	РасчетыСКлиентамиОбороты.Регистратор.Дата КАК РегистраторДата
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(, , Регистратор, ОбъектРасчетов.Объект = &ЗаказКлиента) КАК РасчетыСКлиентамиОбороты
	|ГДЕ
	|	РасчетыСКлиентамиОбороты.СуммаОборот < 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегистраторДата УБЫВ";
	Запрос.УстановитьПараметр("ЗаказКлиента", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	СуммаМТМ = 0;
	ДатаДок = Дата(1,1,1);
	Если НЕ Результат.Пустой() Тогда
		 Выборка = Результат.Выгрузить();
		 СуммаМТМ =  Выборка[0].Сумма;
		 ДатаДок = Выборка[0].РегистраторДата;
	КонецЕсли;
	Евро = Объект.Валюта;
	СуммаМТМЕвро = РаботаСКурсамиВалют.ПересчитатьВВалюту(СуммаМТМ, Объект.Ссылка.Валюта, Евро, ДатаДок);
	Данные = Новый Структура();
	Данные.Вставить("СуммаМТМЕвро", Формат(СуммаМТМЕвро,"ЧДЦ=0"));
	
	Возврат Данные;
КонецФункции

&НаКлиенте
Процедура ОтменитьСкидкиПоПромокоду()
	ПримененнаяСкидка = ПолучитьСкидкуПромокодаДляУдаления();
		
	Если УправляемыеСкидки.НайтиПоЗначению(ПримененнаяСкидка) <> Неопределено Тогда
		УправляемыеСкидки.Удалить(УправляемыеСкидки.НайтиПоЗначению(ПримененнаяСкидка));
	КонецЕсли;
	
	СтрокиСоСкидкой = Объект.СкидкиНаценки.НайтиСтроки(Новый Структура("СкидкаНаценка",ПримененнаяСкидка));
	
	Для Каждого Строка Из СтрокиСоСкидкой Цикл	
		Объект.СкидкиНаценки.Удалить(Строка);				
	КонецЦикла;
	
	//РАСЧЕТ СКИДОК
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
	
	СтруктураСообщений = РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
	Если СтруктураСообщений.Сообщения.Количество() > 0 И СтруктураСообщений.АвтоматическиОткрывать Тогда
		ОткрытьФорму("ОбщаяФорма.СообщенияСкидокНаценок", СтруктураСообщений, ЭтаФорма, УникальныйИдентификатор);
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(
	НСтр("ru = 'Промокод'"),
	,
	НСтр("ru = 'Промокод на скидку деактивирован'"),
	БиблиотекаКартинок.Информация32);
	
	ВернутьПромокодВДействие();
	
	ПараметрыПромокода = Неопределено;
	Модифицированность = Истина;
КонецПроцедуры   

&НаСервереБезКонтекста
Функция ПолучитьВидЦеныРозничная()
	 Возврат Справочники.ВидыЦен.НайтиПоНаименованию("Розничная");
КонецФункции 
 
&НаСервере
Процедура УстановитьВидимостьДоставки()
	Если ТранспортнаяКомпанияЧисло = 0 Тогда 
		Элементы.ТранспортнаяКомпания.Видимость = Истина;
		Элементы.Курьер.Видимость = Ложь;
		Элементы.ОтвественныйМенеджер.Видимость = Ложь;
		Элементы.ДанныеДоставки.Видимость = Ложь;
		Элементы.СпособДоставки.Видимость = Истина;
		Элементы.СпособДоставки.ТолькоПросмотр = Ложь;
		Элементы.ДатаДоставки.Видимость = Истина;
		Элементы.ГруппаЗонаВремя1.Видимость = Ложь;
		Элементы.ТранспортнаяКомпания.ТолькоПросмотр = Ложь;
		Элементы.СтраницаСамовывоз.Видимость = Ложь;
		Элементы.СтраницаДоставкаДоПолучателя.Видимость = Ложь;
		Элементы.СтраницаДоставкаПеревозчикомПоАдресу.Видимость = Ложь;
		Элементы.СтраницаДоставкаПеревозчиком.Видимость = Ложь;
		Элементы.СтраницаДоставкаБабочка.Видимость = Истина;
		Элементы.СкладДатаДоставки.Видимость = Ложь;
		Элементы.ДатаДоставки2.Видимость = Ложь;
		
	ИначеЕсли ТранспортнаяКомпанияЧисло = 1 Тогда 
		Элементы.ТранспортнаяКомпания.Видимость = Истина;
		Элементы.ТранспортнаяКомпания.ТолькоПросмотр = Истина;
		Элементы.Курьер.Видимость = Истина;
		Элементы.ОтвественныйМенеджер.Видимость = Истина;
		Элементы.ДанныеДоставки.Видимость = Истина;
		Элементы.СпособДоставки.Видимость = Истина;
		Элементы.СпособДоставки.ТолькоПросмотр = Истина;
		Элементы.ГруппаЗонаВремя1.Видимость = Истина;
		Элементы.СтраницаСамовывоз.Видимость = Ложь;
		Элементы.СтраницаДоставкаДоПолучателя.Видимость = Ложь;
		Элементы.СтраницаДоставкаПеревозчикомПоАдресу.Видимость = Ложь;
		Элементы.СтраницаДоставкаПеревозчиком.Видимость = Ложь;
		Элементы.СтраницаДоставкаБабочка.Видимость = Истина;
		Элементы.СкладДатаДоставки.Видимость = Ложь;
		Элементы.ДатаДоставки2.Видимость = Ложь;
		
	ИначеЕсли ТранспортнаяКомпанияЧисло = 2 Тогда
		Элементы.ТранспортнаяКомпания.Видимость = Ложь;
		Элементы.Курьер.Видимость = Ложь;
		Элементы.ОтвественныйМенеджер.Видимость = Ложь;
		Элементы.ДанныеДоставки.Видимость = Ложь;
		Элементы.СпособДоставки.Видимость = Истина;
		Элементы.СпособДоставки.ТолькоПросмотр = Истина;
		Элементы.ГруппаЗонаВремя1.Видимость = Ложь;
		Элементы.СтраницаСамовывоз.Видимость = Истина;
		Элементы.СтраницаДоставкаДоПолучателя.Видимость = Ложь;
		Элементы.СтраницаДоставкаПеревозчикомПоАдресу.Видимость = Ложь;
		Элементы.СтраницаДоставкаПеревозчиком.Видимость = Ложь;
		Элементы.СтраницаДоставкаБабочка.Видимость = Ложь;
		Элементы.СкладДатаДоставки.Видимость = Истина;
		Элементы.ДатаДоставки2.Видимость = Истина;
	КонецЕсли; 
	
	Элементы.ДоставкаТранспортнойКомпанией.Видимость = Ложь;
КонецПроцедуры   

Функция ОбновитьКодПодтвержденияНаСервере()
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	СлучайноеЧисло = ГСЧ.СлучайноеЧисло(100000, 999999);
	Код = СтрЗаменить(СлучайноеЧисло, " ","");
	Объект.КодПодтвержденияПВЗ = Код;
	Модифицированность = Истина;
	
	Возврат Код;
КонецФункции  

Функция ОтправитьСМСНаСервере(Код)
	Возврат Бабочка.ОтправитьСМС(Объект.Партнер, "0", СтрШаблон("Код подтверждения %1 для получения заказа %2", Код, Объект.НомерПоДаннымКлиента));
КонецФункции  

&НаСервере
Функция ПолучитьСкидкуПромокодаДляУдаления()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ.СкидкаНаценка КАК СкидкаНаценка
		|ПОМЕСТИТЬ ВТ_Скидки
		|ИЗ
		|	&ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Скидки.СкидкаНаценка КАК СкидкаНаценка
		|ИЗ
		|	ВТ_Скидки КАК ВТ_Скидки
		|ГДЕ
		|	(ВЫРАЗИТЬ(ВТ_Скидки.СкидкаНаценка КАК Справочник.СкидкиНаценки)).ЭтоПромокод";
	
	Запрос.УстановитьПараметр("ВТ", Объект.СкидкиНаценки.Выгрузить(,"СкидкаНаценка"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СкидкаНаценка;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции  

&НаСервереБезКонтекста
Функция ПолучитьСпособОплатыОплачен()
	Возврат Справочники._СпособыОплаты.НайтиПоНаименованию("Оплачен");
КонецФункции  
&НаКлиенте
Функция ПоказатьВопросОСменеВидаЗаказа()
	Если Объект.ЕстьТоварыMarketPlace 
		И Объект.ВидЗаказа <> ПредопределенноеЗначение("Перечисление.ВидыЗаказов.ИМ") Тогда
		
		ОповещениеОРезультате =	Новый ОписаниеОповещения("ИзменитьВидЗаказаВопросЗавершение", ЭтотОбъект);
			
		ВариантыОтветов = Новый СписокЗначений;
		ВариантыОтветов.Добавить(Истина, НСтр("ru='Изменить'"));
		ВариантыОтветов.Добавить(Ложь, НСтр("ru='Не изменять'"));
		
		ПоказатьВопрос(ОповещениеОРезультате, НСтр("ru='В документе присутствует товар MarketPlace
													|Изменить вид заказа на ИМ?'"), ВариантыОтветов);
	КонецЕсли;
КонецФункции  

Функция НайтиПромокод(Идентификатор, Партнер)
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОднократныеПромокодыНаСкидку.Промокод.Скидка КАК Скидка,
		|	ОднократныеПромокодыНаСкидку.Промокод КАК Промокод,
		|	ОднократныеПромокодыНаСкидку.Идентификатор КАК Идентификатор,
		|	ОднократныеПромокодыНаСкидку.Партнер КАК Партнер,
		|	ОднократныеПромокодыНаСкидку.НомерТелефона КАК НомерТелефона,
		|	ОднократныеПромокодыНаСкидку.Состояние КАК Состояние,
		|	ОднократныеПромокодыНаСкидку.ДействуетС КАК ДействуетС,
		|	ОднократныеПромокодыНаСкидку.ДействуетДо КАК ДействуетДо
		|ИЗ
		|	РегистрСведений.ОднократныеПромокодыНаСкидку КАК ОднократныеПромокодыНаСкидку
		|ГДЕ
		|	ОднократныеПромокодыНаСкидку.Промокод.Статус = ЗНАЧЕНИЕ(перечисление.СтатусыВидовКартЛояльности.действует)
		|	И ОднократныеПромокодыНаСкидку.Идентификатор = &Идентификатор
		|	И ВЫБОР
		|			КОГДА ОднократныеПромокодыНаСкидку.Промокод.Персонализирован
		|				ТОГДА ОднократныеПромокодыНаСкидку.Партнер = &Партнер
		|		Иначе Истина КОНЕЦ
		|	    |";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
		
	Если Выборка.Следующий() Тогда
		Если Выборка.Состояние <> Перечисления.СтатусыДействияСкидок.Действует
			ИЛИ Выборка.ДействуетС >= ТекущаяДатаСеанса() 
			ИЛИ КонецДня(Выборка.ДействуетДо) <= ТекущаяДатаСеанса() Тогда
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Срок действия промокода истёк";
			Сообщение.Сообщить();
			УстановитьПривилегированныйРежим(Ложь);
	
			Возврат Неопределено;
		КонецЕсли;
		Если Выборка.Промокод.КоличествоПримененийКода = 0 
			ИЛИ (Выборка.Промокод.КоличествоПримененийКода > 0 
				И РазрешеноИспользоватьПромокод(Выборка.Промокод, Партнер, Выборка.Промокод.КоличествоПримененийКода)) Тогда
			
			Структура = Новый Структура("Скидка, Промокод, Идентификатор, Партнер, НомерТелефона, Состояние, ДействуетС, ДействуетДо");
			ЗаполнитьЗначенияСвойств(Структура, Выборка);
			
			УстановитьПривилегированныйРежим(Ложь);
	
			Возврат Структура;
		КонецЕсли;
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Промокод не найден";
	
	Если НЕ РезультатЗапроса.Пустой() И Выборка.Промокод.КоличествоПримененийКода > 0 Тогда
		Сообщение.Текст = "Превышено количество применений промокода!";
	КонецЕсли;
		
	Сообщение.Сообщить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Неопределено;
КонецФункции

Процедура ВернутьПромокодВДействие()
	ПараметрыПромокодаСкидки = ПараметрыПромокода;
	
	Если ПараметрыПромокодаСкидки = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПромокодаСкидки.Промокод.Персонализирован 
		ИЛИ ПараметрыПромокодаСкидки.Промокод.Одноразовый Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ЗаписьРегистра = РегистрыСведений.ОднократныеПромокодыНаСкидку.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Идентификатор 	= ПараметрыПромокодаСкидки.Идентификатор;
		ЗаписьРегистра.Партнер 			= ПараметрыПромокодаСкидки.Партнер;
		ЗаписьРегистра.НомерТелефона 	= ПараметрыПромокодаСкидки.НомерТелефона;
		ЗаписьРегистра.Промокод 		= ПараметрыПромокодаСкидки.Промокод;
		ЗаписьРегистра.Прочитать();
		
		Попытка
			ЗаписьРегистра.Состояние = Перечисления.СтатусыДействияСкидок.Действует;
			ЗаписьРегистра.ДокументДвижения = Неопределено;
			ЗаписьРегистра.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	Иначе
		//обезличенные запишем с привязкой к покупателю и документу
		УстановитьПривилегированныйРежим(Истина);
		
		Выборка = РегистрыСведений.ОднократныеПромокодыНаСкидку.Выбрать(Новый Структура("Идентификатор", ПараметрыПромокодаСкидки.Идентификатор));
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ДокументДвижения 	= Объект.Ссылка 
				И Выборка.Партнер 			= Объект.Партнер
				И Выборка.Промокод 			= ПараметрыПромокодаСкидки.Промокод Тогда
				
				Запись = Выборка.ПолучитьМенеджерЗаписи();
				Запись.Удалить();
				Прервать;

			КонецЕсли;
			
		КонецЦикла;
				
		УстановитьПривилегированныйРежим(Ложь);	
	КонецЕсли;
КонецПроцедуры

Функция КартаБонусная()
	Возврат ЗначениеЗаполнено(Объект.КартаЛояльности.Владелец.БонуснаяПрограммаЛояльности);
КонецФункции

Функция заполнитьпредоплаты()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасчетыСКлиентамиОбороты.Регистратор КАК документ,
	               |	-РасчетыСКлиентамиОбороты.СуммаОборот КАК Сумма,
	               |	РасчетыСКлиентамиОбороты.Период  как дата
	               |ИЗ
	               |	РегистрНакопления.РасчетыСКлиентами.Обороты(, , Регистратор, ОбъектРасчетов.Объект = &ЗаказКлиента) КАК РасчетыСКлиентамиОбороты
	               |ГДЕ
	               |	РасчетыСКлиентамиОбороты.СуммаОборот < 0";
	Запрос.УстановитьПараметр("ЗаказКлиента", Объект.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Предоплаты.Загрузить(ТЗ);
КонецФункции

Функция ТекстЗапросаОстаткиРасчетов()
	Возврат  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентами.СуммаКонечныйОстаток > 0
	|			ТОГДА РасчетыСКлиентами.СуммаКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДолгКлиента,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентами.СуммаКонечныйОстаток < 0
	|			ТОГДА -РасчетыСКлиентами.СуммаКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НашДолг,
	|	РасчетыСКлиентами.СуммаКонечныйОстаток КАК СальдоДолга,
	|	РасчетыСКлиентами.ОплачиваетсяКонечныйОстаток КАК Оплачивается,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентами.КОплатеКонечныйОстаток > 0
	|			ТОГДА РасчетыСКлиентами.КОплатеКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КОплате,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентами.КОплатеКонечныйОстаток < 0
	|				И (РасчетыСКлиентами.ОбъектРасчетов.Объект ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|					ИЛИ РасчетыСКлиентами.ОбъектРасчетов.Объект ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента)
	|			ТОГДА -РасчетыСКлиентами.КОплатеКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КВозвратуДС,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентами.КОтгрузкеКонечныйОстаток < 0
	|			ТОГДА -РасчетыСКлиентами.КОтгрузкеКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КОтгрузке,
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентами.ОтгружаетсяКонечныйОстаток > 0
	|			ТОГДА РасчетыСКлиентами.ОтгружаетсяКонечныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Отгружается
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.ОстаткиИОбороты(, , , , ) КАК РасчетыСКлиентами
	|		{ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|		ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики}
	|ГДЕ
	|	АналитикаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|	И (РасчетыСКлиентами.КОплатеКонечныйОстаток <> 0
	|			ИЛИ РасчетыСКлиентами.КОтгрузкеКонечныйОстаток <> 0
	|			ИЛИ РасчетыСКлиентами.ОтгружаетсяКонечныйОстаток <> 0
	|			ИЛИ РасчетыСКлиентами.СуммаКонечныйОстаток <> 0)
	|	И РасчетыСКлиентами.ОбъектРасчетов.Объект = &ЗаказКлиента";

КонецФункции

Функция ПроверитьСтатусКарты(ВыбранноеЗначение)
	Если ВыбранноеЗначение.Статус = Перечисления.СтатусыКартЛояльности.Аннулирована Тогда
		Возврат Ложь
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ВидЗаказПриИзменении(Элемент)
	
	ЭтоЗаказИМ = Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказов.ИМ");
	ЭтоЗаказМТМ = Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказов.МТМ");
	ЭтоЗаказСотрудник = Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказов.Сотрудник");
	                   
	элементы.МТМстр.Видимость = ЭтоЗаказМТМ;
	Элементы.Постоплата.Видимость = ЭтоЗаказМТМ;
	элементы.РазрешеноРуководством.Видимость = ЭтоЗаказСотрудник;
	элементы.ПродажаФормы.Видимость = ЭтоЗаказСотрудник;
    //bg
	Если Объект.ВидЗаказа = ПредопределенноеЗначение("Перечисление.ВидыЗаказов.Постоплата") Тогда
		Если ЗначениеЗаполнено(Объект.КартаЛояльности) И КартаБонусная() Тогда
			
			Режим = РежимДиалогаВопрос.ОК;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
			ТекстВопроса = НСтр("ru = 'Для вида заказа Постоплата не разрешено использование бонусной карты'");
			ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
			Объект.КартаЛояльности = ПредопределенноеЗначение("Справочник.КартыЛояльности.ПустаяСсылка"); 
        	РассчитатьСкидкиНаценкиКлиент();	
		КонецЕсли; 	
	КонецЕсли; 	
	Если Объект.ВидЗаказа <> ПредопределенноеЗначение("Перечисление.ВидыЗаказов.Сотрудник") 
		И Объект.ПродажаФормы Тогда
		Объект.ПродажаФормы = Ложь;
	КонецЕсли; 	
    
	Элементы.ЖелаемаяДатаОтгрузки.ТолькоПросмотр = Не ЭтоЗаказИМ;

КонецПроцедуры    


&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт


КонецПроцедуры



&НаКлиенте
Процедура ВвестиОтветственного(Команда)
	ручнаяскидка = Ложь;
	объект.ОтветстветственныйЗаРучСкидку = предопределенноезначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	объект.РазмерРазрешеннойСкидки = 0;
	
	МассивСкидок = Новый Массив();
	Для Каждого стр Из Объект.Товары Цикл
		МассивСкидок.Добавить(стр.ПроцентРучнойСкидки);
	КонецЦикла;
	
	СкидкаДокумента = Бабочка.МаксимумСкидки(МассивСкидок);
	
	ПараметрыОткрытияФормы = Новый Структура;
	струк = новый структура();
	
	
	струк.Вставить("скидка", СкидкаДокумента);//?(СкидкаДокумента > СкидкаБонусами, СкидкаДокумента, СкидкаБонусами)); 
	
	ПараметрыОткрытияФормы.Вставить("скидка", СкидкаДокумента);//?(СкидкаДокумента > СкидкаБонусами, СкидкаДокумента, СкидкаБонусами));
	ПараметрыОткрытияФормы.Вставить("ТекстСообщенияТелеграм", ПолучитьТекстСообщения());
	
	ОткрытьФорму("ОбщаяФорма.ПодтверждениеОтветственного",
	ПараметрыОткрытияФормы,
	ЭтотОбъект,,,,
	Новый ОписаниеОповещения("ПодтверждениеСкидкиЗавершение", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	
КонецПроцедуры 



&НаКлиенте
Процедура ПодтверждениеСкидкиЗавершение(струк, ДополнительныеПараметры) Экспорт
	
	если струк <> неопределено тогда  	
		Объект.ОтветстветственныйЗаРучСкидку = струк.ответственный;
		объект.РазмерРазрешеннойСкидки = струк.размерскидки;
		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		РассчитатьСкидкиНаценки(Неопределено);
	конецесли;
	
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьТекстСообщения()
	
	ПС = Символы.ПС;
	
	ТекстСообщения = "<b>Бутик:</b> "+Строка(Объект.Склад) +ПС+
					"<b>Клиент:</b> "+Строка(Объект.Партнер) +ПС+
					"<b>Кассир:</b> "+Строка(ПользователиКлиентСервер.ТекущийПользователь()) +ПС+
					"<b>Товары:</b>"+ПС;
	
	Сч = 1;
	ЕстьСкидкаПоСтрокам = Ложь;
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		Если СтрокаТЧ.ПроцентРучнойСкидки > 0 Тогда
			ТекстСообщения = ТекстСообщения + Строка(Сч)+". "+СтрокаТЧ.Номенклатура+
							"("+Строка(ПолучитьКоллекцию(СтрокаТЧ.Номенклатура))+")"+ 
							" Сумма скидки: "+ Строка(СтрокаТЧ.СуммаРучнойСкидки)+" ("+Строка(СтрокаТЧ.ПроцентРучнойСкидки)+"%)"+ПС;
			Сч = Сч + 1;
			ЕстьСкидкаПоСтрокам = Истина;
		КонецЕсли; 	
	КонецЦикла; 
	
	Если НЕ ЕстьСкидкаПоСтрокам Тогда
		ТекстСообщения = "";	
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции    

&НаСервереБезКонтекста
Функция ПолучитьКоллекцию(Номенклатура)
	Возврат Номенклатура.КоллекцияНоменклатуры;
КонецФункции


&НаКлиенте
Процедура Зарезервировать(Команда)
	Для Каждого стр Из Объект.Товары Цикл
		стр.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада");
	КонецЦикла;
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ДатаДокумента", Объект.Дата);
	ОткрытьФорму("ОбщаяФорма.BG_РезервСОтветственным",
		ПараметрыОткрытияФормы,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ЗарезервироватьЗавершение", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	КонецПроцедуры  
	
	
&НаКлиенте
Процедура ЗарезервироватьЗавершение(струк, ДополнительныеПараметры) Экспорт
		
	если струк <> неопределено тогда  	
		Объект.ОтветстветственныйЗаРезерв = струк.ответственный;
		объект.ЖелаемаяДатаОтгрузки = струк.ДатаРезерва;
		Модифицированность = Истина;
	конецесли;
	
КонецПроцедуры    


&НаКлиенте
Процедура ВвестиОтветственногоПостоплата(Команда)
	ручнаяскидка = Ложь;
	объект.ОтветстветственныйЗаПостоплату = предопределенноезначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	СкидкаДокумента = 19;   //уменьшение процента с 49% на 20
	
	ПараметрыОткрытияФормы = Новый Структура;
	струк = новый структура();
	
	струк.Вставить("скидка", СкидкаДокумента); 
		
	ПараметрыОткрытияФормы.Вставить("скидка", СкидкаДокумента);
	ОткрытьФорму("ОбщаяФорма.ПодтверждениеОтветственного",
		ПараметрыОткрытияФормы,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ПодтверждениеПостоплатыЗавершение", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецПроцедуры       
	


&НаСервере
Функция КодыМаркировкиПодобраны()
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗТовары.Номенклатура КАК Номенклатура,
		|	ТЗТовары.Характеристика КАК Характеристика,
		|	&Ссылка КАК Ссылка,
		|	ТЗТовары.Отменено КАК Отменено
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&ТЗТовары КАК ТЗТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА МаркируемыеТоварыВЗаказеКлиента.ШтрихкодУпаковки ЕСТЬ NULL
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеВнесенаМаркировка
		|ПОМЕСТИТЬ ВТМаркировка
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МаркируемыеТоварыВЗаказеКлиента КАК МаркируемыеТоварыВЗаказеКлиента
		|		ПО ВТТовары.Ссылка = МаркируемыеТоварыВЗаказеКлиента.ЗаказКлиента
		|			И ВТТовары.Номенклатура = МаркируемыеТоварыВЗаказеКлиента.Номенклатура
		|			И ВТТовары.Характеристика = МаркируемыеТоварыВЗаказеКлиента.Характеристика
		|ГДЕ
		|	(ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).ОсобенностьУчета = Значение(Перечисление.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция)
		|	ИЛИ ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).ОсобенностьУчета = Значение(Перечисление.ОсобенностиУчетаНоменклатуры.Духи)
		|	ИЛИ ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).ОсобенностьУчета = Значение(Перечисление.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность)
		|	ИЛИ ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).ОсобенностьУчета = Значение(Перечисление.ОсобенностиУчетаНоменклатуры.ПродукцияМаркируемаяДляГИСМ))
		|	И НЕ ВТТовары.Отменено
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТМаркировка.НеВнесенаМаркировка КАК НеВнесенаМаркировка
		|ИЗ
		|	ВТМаркировка КАК ВТМаркировка
		|ГДЕ
		|	ВТМаркировка.НеВнесенаМаркировка > 0";
	
	ТЗТовары = Объект.Товары.выгрузить();
	ТЗТовары = ТЗТовары.Скопировать(, "Номенклатура, Характеристика, Отменено");
	
	Запрос.УстановитьПараметр("ТЗТовары", ТЗТовары);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиенте
Процедура ДобавитьКодыМаркировки(Команда)
	
	ОткрытьФорму("РегистрСведений.МаркируемыеТоварыВЗаказеКлиента.Форма.ФормаСписка", Новый Структура("ЗаказКлиента", Объект.Ссылка), ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОчиститьЗаписиМаркируемыхТоваров(Номенклатура, Характеристика)
	
	Выборка = РегистрыСведений.МаркируемыеТоварыВЗаказеКлиента.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЗаказКлиента = Объект.Ссылка
			И Выборка.Номенклатура = Номенклатура
			И Выборка.Характеристика = Характеристика Тогда
			
			Запись = Выборка.ПолучитьМенеджерЗаписи();
			Запись.Удалить();
			
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

 &НаКлиенте
Процедура ДобавитьУпаковку(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		Предупреждение("Запишите документ!");
		Возврат;
	КонецЕсли; 
	ОткрытьФорму("РегистрСведений.УчетУпаковки.Форма.ФормаСпискаДляОткрытия", Новый Структура("ДокументОснование", Объект.Ссылка), ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДобавитьОплатуБонуснымиБалламиЗавершение")
Процедура ba_ДобавитьОплатуБонуснымиБалламиЗавершение(Результат, ДополнительныеПараметры)

	Если Не ЗначениеЗаполнено(Результат) Тогда
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		Возврат;
	КонецЕсли;

	ПрименитьОплатуБонуснымиБалламиКлиент(Результат.АдресВоВременномХранилище);
    #Удаление
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	#КонецУдаления
	#Вставка 
	РассчитатьСкидкиНаценкиКлиент();
	#КонецВставки

КонецПроцедуры

&НаКлиенте
Процедура ba_ПробитьЧекПВЗ(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаказКлиента", Объект.Ссылка);
	ОткрытьФорму("Обработка.АРМ_ПунктВыдачиЗаказа.Форма.Форма", ПараметрыФормы);
КонецПроцедуры



	
	









