
&НаСервере
Процедура ПриОткрытииНаСервере(Заявка)
	
	Если (Заявка.СДЭКТипДоставки = Перечисления._ТипыДоставки.ДверьСклад
		ИЛИ Заявка.СДЭКТипДоставки = Перечисления._ТипыДоставки.ДоСклада) 
		И НЕ ЗначениеЗаполнено(Заявка.СДЭКПунктВыдачиЗаказа) Тогда
		ЕстьОшибки = Истина;
		Ошибки = "Пункт выдачи заказа должен быть заполнен!";
	КонецЕсли;
	
	Результат = ПроверитьЗаполнениеПолейСДЭК(Заявка);
	ЕстьОшибкиЗаполнения = Результат.ЕстьОшибкиЗаполнения;
	
	Если ЕстьОшибкиЗаполнения Тогда
		
		Если ЗначениеЗаполнено(Результат.СписокОшибок) Тогда
			Ошибки = "Для отправки заказа необходимо заполнить все поля!"+Символы.ПС + Результат.СписокОшибок;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат.ОшибкаНесоответствияОплат) Тогда
			Ошибки = Результат.ОшибкаНесоответствияОплат;
		КонецЕсли;
		
		Элементы.Отправить.Доступность = Ложь;
		
	КонецЕсли; 

	Если НЕ ЭтоВызовКурьера
		И ЗначениеЗаполнено(Заявка.СДЭКНомер) Тогда
		Ошибки = "Uuid заполнен, заявка уже выгружена. ";
		Элементы.Отправить.Доступность = Ложь;
	КонецЕсли; 
	
	Если ЭтоВызовКурьера
		И ЗначениеЗаполнено(Заявка.СДЭКНомерЗаявкиКурьера) Тогда
		
		Ошибки = "Заявка уже выгружена. ";
		Элементы.ОтправитьВызовКурьера.Доступность = Ложь;
		
	КонецЕсли;

КонецПроцедуры

Функция ПроверитьЗаполнениеПолейСДЭК(Заявка)
	
	Результат = Новый Структура();
	СписокОшибок = "";
	ОшибкаСтатусОплачен = "";
	ОшибкаНесоответствияОплат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаДоставку.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) КАК ФИОПолучателя,
		|	ЗаявкаНаДоставку.АдресДоставки = """" КАК АдресДоставки,
		|	ЗаявкаНаДоставку.СДЭКГородДоставки = ЗНАЧЕНИЕ(Справочник.ГородаСДЭК.ПустаяСсылка) КАК ГородКуда,
		|	ЗаявкаНаДоставку.СтраховатьГруз = ЛОЖЬ КАК ИспользуетсяСтрахованиеГруза,
		|	ЗаявкаНаДоставку.СДЭКТипДоставки = ЗНАЧЕНИЕ(Перечисление._ТипыДоставки.ПустаяСсылка) КАК ТипДоставки,
		|	ЗаявкаНаДоставку.НомерПоДаннымКлиента = """" КАК НомерНаСайте,
		|	ЗаявкаНаДоставку.ТранспортнаяКомпания <> ЗНАЧЕНИЕ(Перечисление.ТранспортныеКомпании.CDEK) КАК ТранспортнаяКомпания,
		|	ЗаявкаНаДоставку.СуммаНаложенногоПлатежа КАК СуммаНаложенногоПлатежа,
		|	ЗаявкаНаДоставку.НаложенныйПлатеж КАК НаложенныйПлатеж
		|ИЗ
		|	Документ.ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
		|ГДЕ
		|	ЗаявкаНаДоставку.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОплаты, 0) КАК ПроцентОплаты
		|ИЗ
		|	Документ.ЗаявкаНаДоставку.Заказы КАК ЗаявкаНаДоставкуЗаказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
		|		ПО ЗаявкаНаДоставкуЗаказы.Заказ = СостоянияЗаказовКлиентов.Заказ
		|ГДЕ
		|	ЗаявкаНаДоставкуЗаказы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаДоставкуТовары.Заказ) КАК КОЛИЧЕСТВО
		|ИЗ
		|	Документ.ЗаявкаНаДоставку.Товары КАК ЗаявкаНаДоставкуТовары
		|ГДЕ
		|	ЗаявкаНаДоставкуТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ПартнерыКонтактнаяИнформация.Представление, """") КАК Телефон
		|ИЗ
		|	Документ.ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|		ПО ЗаявкаНаДоставку.Партнер = ПартнерыКонтактнаяИнформация.Ссылка
		|			И (ПартнерыКонтактнаяИнформация.Тип = &Тип)
		|			И (ПартнерыКонтактнаяИнформация.Вид = &Вид)
		|ГДЕ
		|	ЗаявкаНаДоставку.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.ФИОПолучателя Тогда
			СписокОшибок = СписокОшибок +"ФИО получателя, ";	
		КонецЕсли;
		Если Выборка.АдресДоставки Тогда
			СписокОшибок = СписокОшибок +"адрес доставки, ";	
		КонецЕсли;
		Если Выборка.ГородКуда Тогда
			СписокОшибок = СписокОшибок +"город, ";	
		КонецЕсли;
		Если Выборка.ТипДоставки Тогда
			СписокОшибок = СписокОшибок +"тип доставки, ";	
		КонецЕсли;
		Если Выборка.НомерНаСайте Тогда
			СписокОшибок = СписокОшибок +"номер на сайте, ";	
		КонецЕсли;
		Если Выборка.ТранспортнаяКомпания Тогда
			СписокОшибок = СписокОшибок +"транспортная компания, ";	
		КонецЕсли;
		
	КонецЕсли; 
	
	Выборка = РезультатЗапроса[3].Выбрать();

	Если Выборка.Следующий() Тогда
		Если Выборка.Телефон ="" Тогда
			СписокОшибок = СписокОшибок +"телефон партнера, ";
		КонецЕсли; 
	КонецЕсли;
	
	Если Прав(СписокОшибок, 2) = ", " Тогда
		СписокОшибок = Лев(СписокОшибок, СтрДлина(СписокОшибок)-2);	
	КонецЕсли; 
	
	Выборка = РезультатЗапроса[1].Выбрать();

	Если Выборка.Следующий() Тогда
		Если Выборка.ПроцентОплаты < 100 
			И НЕ Заявка.НаложенныйПлатеж Тогда
			ОшибкаНесоответствияОплат = "Заказ не оплачен, должна стоять галка Наложенный платеж.";
		КонецЕсли; 
		Если Выборка.ПроцентОплаты >= 100 
			И Заявка.НаложенныйПлатеж Тогда
			ОшибкаНесоответствияОплат = "Заказ оплачен, снимите галку Наложенный платеж.";
		КонецЕсли; 
	КонецЕсли;
	
	Выборка = РезультатЗапроса[2].Выбрать();

	Если Выборка.Следующий() Тогда
		Если Выборка.Количество > 1 Тогда
			ОшибкаНесоответствияОплат = "Отправка заявки рассчитано для одного Заказа. Удалите лишние.";
		КонецЕсли; 
	КонецЕсли;
			
	ЕстьОшибкиЗаполнения = ЗначениеЗаполнено(СписокОшибок) ИЛИ ЗначениеЗаполнено(ОшибкаНесоответствияОплат);
	Результат.Вставить("ЕстьОшибкиЗаполнения", ЕстьОшибкиЗаполнения);
	Результат.Вставить("СписокОшибок", СписокОшибок);
	Результат.Вставить("ОшибкаНесоответствияОплат", ОшибкаНесоответствияОплат);

	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заявка") Тогда
		Заявка = Параметры.Заявка;	
	КонецЕсли;
	
	Если Параметры.Свойство("ЭтоОтправкаВозврата") Тогда
		Элементы.ОтправкаСДЭК.Видимость = НЕ Параметры.ЭтоОтправкаВозврата;
		Элементы.ВызовКурьера.Видимость = Параметры.ЭтоОтправкаВозврата;
		ЭтоВызовКурьера = Параметры.ЭтоОтправкаВозврата;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере(Заявка);
	
	ОтправлятьНаТестовыйСервер = ЭтоОтправкаНаТестовыйСервер();
	Если ОтправлятьНаТестовыйСервер Тогда
		URL = "api.edu.cdek.ru";  //Тестовый
	Иначе
		URL = "api.cdek.ru";      //Рабочий
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоОтправкаНаТестовыйСервер()
	Возврат Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_ОтправкаНаТестовыйСервер", Истина);	
КонецФункции
 
&НаСервере
Функция СформироватьТекстЗапросаДляОтправки()
	
	Результат = ПолучитьДанныеЗаказа(); 
	ВыборкаШапка = Результат.ВыборкаШапка;
	ВыборкаШапка.Следующий();
	ТЗМаркировка = Результат.ТЗМаркировка;
	
	ВыборкаМесто = Результат.ВыборкаТовары;
	
	Заказ  = СоздатьОбъектXDTO("order");
	Заказ.number =  ВыборкаШапка.number;
	Заказ.comment =  ВыборкаШапка.ПримечаниеТК;
	
	Отправитель = СоздатьОбъектXDTO("location");
	Отправитель.city = "Санкт-Петербург";
	Отправитель.address = "Невский пр-кт, дом № 153А, помещение 20Н";
	Отправитель.code = "137";
	
	Заказ.from_location = Отправитель;
	
	Если Заявка.СДЭКТипДоставки = Перечисления._ТипыДоставки.ДверьСклад
		ИЛИ Заявка.СДЭКТипДоставки = Перечисления._ТипыДоставки.ДоСклада Тогда
		Заказ.delivery_point = ВыборкаШапка.КодПВЗ;
	Иначе
		
		Получатель = СоздатьОбъектXDTO("location");
		Получатель.city = ВыборкаШапка.ГородДоставкиНаименование;
		Получатель.address = ВыборкаШапка.АдресДоставки;
		Получатель.code = ВыборкаШапка.ГородДоставкиКод;
		
		Заказ.to_location = Получатель;
			
	КонецЕсли;
	
	ЕстьДинамическаяДоставка = Ложь;
	ЕстьЧастичнаяДоставка = Ложь;
	
	ДопУслугиЗаявки = Заявка.СДЭКДопУслуги.Получить();
	
	Если ТипЗнч(ДопУслугиЗаявки) = Тип("СписокЗначений") Тогда
		Для каждого СтрокаДопУслуга Из ДопУслугиЗаявки Цикл
			Если СтрокаДопУслуга.Значение.КодУслуги = "PART_DELIV" Тогда
				ЕстьЧастичнаяДоставка = Истина;	
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;  
	
	ЕстьДинамическаяДоставка = ЕстьЧастичнаяДоставка 
					И (Заявка.СДЭКТипДоставки = Перечисления._ТипыДоставки.ДверьДверь ИЛИ Заявка.СДЭКТипДоставки = Перечисления._ТипыДоставки.ДоДвери)
					И Заявка.НаложенныйПлатеж;
					
	ЗаказКлиента = Заявка.Заказы[0].Заказ; 
	КартаЛояльности = ЗаказКлиента.КартаЛояльности;  //тикет 48249
	Если ЗначениеЗаполнено(КартаЛояльности) Тогда
		ВидКарты = КартаЛояльности.Владелец.Наименование;
		Если ВидКарты = "Premium 5%"
			ИЛИ ВидКарты = "Platinum 15%"
			ИЛИ ВидКарты = "VIP 20%" Тогда
		    ЕстьДинамическаяДоставка = Ложь; 
		КонецЕсли;
	КонецЕсли;
	
	Пока ВыборкаМесто.Следующий() Цикл
		ВыборкаТовары = ВыборкаМесто.Выбрать();
		
		Упаковка = СоздатьОбъектXDTO("packages");
		Упаковка.number = "bar-001"+Строка(ВыборкаМесто.Место);
		
		Упаковка.height = 17;
		Упаковка.length = 42;
		Упаковка.width  = 33;
		КоличествоТовараВУпаковке = 0;
		
		Пока ВыборкаТовары.Следующий() Цикл
			
			Если ВыборкаТовары.НоменклатураКод = "Ц0000120605" 
				И ЕстьДинамическаяДоставка Тогда //убираем доставку из товаров
				Продолжить;
			КонецЕсли; 
			
			Товар = СоздатьОбъектXDTO("item");
			ЗаполнитьЗначенияСвойств(Товар, ВыборкаТовары);	
			Товар.name = СтрЗаменить(Товар.name, "&", ""); 
			
			СуммаОплатыПриПолучении = СоздатьОбъектXDTO("payment");
			Если ВыборкаШапка.НаложенныйПлатеж Тогда    
				СуммаОплатыПриПолучении.value = Товар.cost;	
			Иначе
				СуммаОплатыПриПолучении.value = 0;	
			КонецЕсли; 
			Товар.cost = Товар.amount;//Товар.cost; объявленную стоимость занижаем, чтобы страховка была низкой	
			
			Если ВыборкаТовары.НоменклатураКод = "Ц0000120605" Тогда //"доставка ИМ" не может иметь объявленную ценность
				Товар.cost = 0;
				Товар.name = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_НазваниеДоставки", "Доставка ИМ при выкупе менее 15000руб");
			КонецЕсли;
			Товар.payment = СуммаОплатыПриПолучении;
			
			Если ВыборкаТовары.МаркируемыйТовар Тогда
				 
				Если ВыборкаТовары.amount > 1 Тогда
					Сообщить("Для маркируемых товаров количество в строке не должно превышать 1 шт: "+ВыборкаТовары.name+"
							|Выгрузка невозможна.");
					Возврат 0;	
				КонецЕсли;   
				НайденныеСтроки = ТЗМаркировка.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ЗаказКлиента", 
											ВыборкаТовары.Номенклатура,ВыборкаТовары.Характеристика,ВыборкаТовары.Заказ));
											
				Если НайденныеСтроки.Количество() Тогда
					НайденнаяСтрока = НайденныеСтроки[0];
					
					Если НЕ ВыборкаТовары.ЭтоМех Тогда
						РазобранныйШтрихкодСтруктурой = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(НайденнаяСтрока.ШтрихкодУпаковки.ЗначениеШтрихкода);
						hex_code = СтрЗаменить(Строка(РазобранныйШтрихкодСтруктурой.РеквизитКодаТовараHEX), " ", "");
		
						Товар.marking = hex_code;
						ТЗМаркировка.Удалить(НайденнаяСтрока);
					КонецЕсли; 
					
				Иначе
					Сообщить("Не внесен код маркировки для товара "+ВыборкаТовары.name+" 
					|Выгрузка невозможна.");
					Возврат 0;
				КонецЕсли; 
			КонецЕсли; 
			Упаковка.items.Добавить(Товар);
			
			КоличествоТовараВУпаковке = КоличествоТовараВУпаковке + ВыборкаТовары.amount;
			
		КонецЦикла; 
		
		Упаковка.weight = КоличествоТовараВУпаковке * 700;
		
		Если ЕстьДинамическаяДоставка Тогда
			
			Товар = СоздатьОбъектXDTO("item");
			Товар.ware_key = "Ц0000120605";
			Товар.cost = 0;
			Товар.weight = 10;
			Товар.amount = 1;
			Товар.name = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_НазваниеДинамическойДоставки", "Доставка при полном отказе");
			
			СуммаОплатыПриПолучении = СоздатьОбъектXDTO("payment");
			СуммаОплатыПриПолучении.value = 0;	
			
			Товар.payment = СуммаОплатыПриПолучении;
			
			Упаковка.items.Добавить(Товар);	 
			Упаковка.weight = Упаковка.weight +10;
			
		КонецЕсли;  
		
		
		Заказ.packages.Добавить(Упаковка);
	
	КонецЦикла;
	
	Получатель = СоздатьОбъектXDTO("client");
	Получатель.name = ВыборкаШапка.ПартнерНаименование;
	
	Телефон = СоздатьОбъектXDTO("phone");
	Телефон.number = ВыборкаШапка.НомерТелефона;
	Если ЗначениеЗаполнено(Телефон.number) И НЕ СтрНачинаетсяС(Телефон.number, "+") Тогда
		Телефон.number = "+"+Телефон.number;
	КонецЕсли; 
	
	Получатель.phones.Добавить(Телефон);
	
	Заказ.recipient = Получатель;
	
	Отправитель = СоздатьОбъектXDTO("sender");
	Отправитель.name = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_КонтактноеЛицо", "");
	Отправитель.company = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_Продавец", "");
	Phone_отправитель = СоздатьОбъектXDTO("phone");
	Phone_отправитель.number = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_ПродавецТелефон", "");
    Отправитель.phones.Добавить(Phone_отправитель);
	
	Заказ.sender = Отправитель;
	
	ДопУслугиЗаявки = Заявка.СДЭКДопУслуги.Получить();
	
	Если ТипЗнч(ДопУслугиЗаявки) = Тип("СписокЗначений") Тогда
		Для каждого СтрокаДопУслуга Из ДопУслугиЗаявки Цикл
			
			ДопУслуга = СоздатьОбъектXDTO("service");
			ДопУслуга.code = СтрокаДопУслуга.Значение.КодУслуги;
			Если ДопУслуга.code = "PACKAGE_1" Тогда
				ДопУслуга.parameter = Заявка.КоличествоМест;
			Иначе
				ДопУслуга.parameter = 0;
			КонецЕсли; 
			
			Заказ.services.Добавить(ДопУслуга);
			
		КонецЦикла; 
	КонецЕсли; 
	
	Если ЕстьДинамическаяДоставка Тогда
		
		СтоимостьДинамическойДоставки = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_СтоимостьДинамическойДоставки", 900);
		
		ДинамическаяДоставка = СоздатьОбъектXDTO("delivery_recipient_cost_adv");	
		ДинамическаяДоставка.sum = СтоимостьДинамическойДоставки;
		ДинамическаяДоставка.threshold = 0;  //при полном отказе + строка в ТЧ товары
		
		Заказ.delivery_recipient_cost_adv.Добавить(ДинамическаяДоставка);
		
		ДинамическаяДоставка = СоздатьОбъектXDTO("delivery_recipient_cost_adv");	
		ДинамическаяДоставка.sum = СтоимостьДинамическойДоставки;
		ДинамическаяДоставка.threshold = 30000;
		
		Заказ.delivery_recipient_cost_adv.Добавить(ДинамическаяДоставка);
	

    КонецЕсли;
			
	Заказ.tariff_code = ВыборкаШапка.КодТарифа;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьJSON(ЗаписьJSON, Заказ);
	
	СтрокаЗапроса = ЗаписьJSON.Закрыть();
	
	СтрокаЗапроса = Прав(СтрокаЗапроса, СтрДлина(СтрокаЗапроса)-13);
	СтрокаЗапроса = Лев(СтрокаЗапроса, СтрДлина(СтрокаЗапроса)-1);
	
КонецФункции

Функция ПолучитьДанныеЗаказа()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПартнерыКонтактнаяИнформация.НомерТелефона) КАК НомерТелефона
		|ПОМЕСТИТЬ ТелефонПартнера
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.Ссылка = &Партнер
		|	И ПартнерыКонтактнаяИнформация.Тип = &Тип
		|	И ПартнерыКонтактнаяИнформация.Вид = &Вид
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаНаДоставку.Комментарий КАК comment,
		|	ЗаявкаНаДоставку.Партнер.Наименование КАК ПартнерНаименование,
		|	"""" КАК Отправитель,
		|	ЗаявкаНаДоставку.НомерПоДаннымКлиента КАК number,
		|	ЕСТЬNULL(ЗаявкаНаДоставку.СДЭКГородДоставки.КодГорода, 0) КАК ГородДоставкиКод,
		|	ЕСТЬNULL(ЗаявкаНаДоставку.СДЭКГородДоставки.Наименование, """") КАК ГородДоставкиНаименование,
		|	ВЫРАЗИТЬ(ЗаявкаНаДоставку.АдресДоставки КАК СТРОКА(255)) КАК АдресДоставки,
		|	ЗаявкаНаДоставку.НаложенныйПлатеж КАК НаложенныйПлатеж,
		|	ЗаявкаНаДоставку.СтраховатьГруз КАК СтраховатьГруз,
		|	ЕСТЬNULL(ТелефонПартнера.НомерТелефона, """") КАК НомерТелефона,
		|	ЕСТЬNULL(ЗаявкаНаДоставку.СДЭКВыбранныйТариф.КодТарифа, 0) КАК КодТарифа,
		|	ЗаявкаНаДоставку.СДЭКДопУслуги КАК СДЭКДопУслуги,
		|	ЗаявкаНаДоставку.ПримечаниеТК КАК ПримечаниеТК,
		|	ЕСТЬNULL(ЗаявкаНаДоставку.СДЭКПунктВыдачиЗаказа.КодПВЗ, """") КАК КодПВЗ
		|ИЗ
		|	Документ.ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТелефонПартнера КАК ТелефонПартнера
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ЗаявкаНаДоставку.Ссылка = &Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаНаДоставкуТовары.Номенклатура.Код КАК ware_key,
		|	ЗаявкаНаДоставкуТовары.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ЗаявкаНаДоставкуТовары.Характеристика.НаименованиеПолное, """") КАК name,
		|	ВЫРАЗИТЬ(ЗаявкаНаДоставкуТовары.Сумма / ЗаявкаНаДоставкуТовары.Количество КАК ЧИСЛО(15, 2)) КАК cost,
		|	ЗаявкаНаДоставкуТовары.Количество КАК amount,
		|	700 КАК weight,
		|	ЗаявкаНаДоставкуТовары.Место КАК Место,
		|	ЗаявкаНаДоставкуТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция)
		|		ИЛИ ЗаявкаНаДоставкуТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Духи)
		|		ИЛИ ЗаявкаНаДоставкуТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность)
		|		ИЛИ ЗаявкаНаДоставкуТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПродукцияМаркируемаяДляГИСМ) КАК МаркируемыйТовар,
		|	ЗаявкаНаДоставкуТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПродукцияМаркируемаяДляГИСМ) КАК ЭтоМех,
		|	ЗаявкаНаДоставкуТовары.Номенклатура КАК Номенклатура,
		|	ЗаявкаНаДоставкуТовары.Характеристика КАК Характеристика,
		|	ЗаявкаНаДоставкуТовары.Заказ КАК Заказ,
		|	ЗаявкаНаДоставкуТовары.Номенклатура.Код КАК НоменклатураКод
		|ИЗ
		|	Документ.ЗаявкаНаДоставку.Товары КАК ЗаявкаНаДоставкуТовары
		|ГДЕ
		|	ЗаявкаНаДоставкуТовары.Ссылка = &Заявка
		|ИТОГИ ПО
		|	Место
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаркируемыеТоварыВЗаказеКлиента.ЗаказКлиента КАК ЗаказКлиента,
		|	МаркируемыеТоварыВЗаказеКлиента.Номенклатура КАК Номенклатура,
		|	МаркируемыеТоварыВЗаказеКлиента.Характеристика КАК Характеристика,
		|	МаркируемыеТоварыВЗаказеКлиента.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	МаркируемыеТоварыВЗаказеКлиента.Серия КАК Серия
		|ИЗ
		|	РегистрСведений.МаркируемыеТоварыВЗаказеКлиента КАК МаркируемыеТоварыВЗаказеКлиента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаДоставку.Товары КАК ЗаявкаНаДоставкуТовары
		|		ПО МаркируемыеТоварыВЗаказеКлиента.ЗаказКлиента = ЗаявкаНаДоставкуТовары.Заказ
		|			И МаркируемыеТоварыВЗаказеКлиента.Номенклатура = ЗаявкаНаДоставкуТовары.Номенклатура
		|			И МаркируемыеТоварыВЗаказеКлиента.Характеристика = ЗаявкаНаДоставкуТовары.Характеристика
		|ГДЕ
		|	ЗаявкаНаДоставкуТовары.Ссылка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("ВидНоменклатурыУслуги", Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуги"));
	Запрос.УстановитьПараметр("Партнер", Заявка.Партнер);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = РезультатЗапроса[1].Выбрать();
	ВыборкаТовары = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТЗМаркировка = РезультатЗапроса[3].Выгрузить();
	
	Возврат Новый Структура("ВыборкаШапка, ВыборкаТовары, ТЗМаркировка", ВыборкаШапка, ВыборкаТовары, ТЗМаркировка);
	
КонецФункции

Функция СоздатьОбъектXDTO(ТипОбъекта)
	
	ТипДанных = ФабрикаXDTO.Тип("http://www.CDEK.org", ТипОбъекта);
	Результат = ФабрикаXDTO.Создать(ТипДанных);
	
	Возврат Результат;
	
КонецФункции

Функция ОтправитьНаСайтЗаказ()
	
	Попытка
		
		Токен = "Bearer "+ Константы.СДЭКТокен.Получить();
		HTTPСоединение = Новый HTTPСоединение(URL, , , , , , Новый ЗащищенноеСоединениеOpenSSL(), );
		HTTPЗапрос = Новый HTTPЗапрос("/v2/orders/");
		
		HTTPЗапрос.Заголовки.Вставить("Authorization", Токен); 
	    HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса); 
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
		
		Поток = Ответ.ПолучитьТелоКакПоток();
		Кодировка = "utf-8"; 

		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.ОткрытьПоток(Поток, Кодировка); 
		Результат = ПрочитатьJSON(ЧтениеJSON);
		ОтветСервера = Ответ.ПолучитьТелоКакСтроку("UTF-8"); // ЧтениеJSON.Закрыть();
		
		Если ТипЗнч(Результат) = Тип("Структура") 
			И Результат.Свойство("requests") Тогда
			
			request = Результат.requests[0];
			Если request.state = "ACCEPTED" Тогда
				Если Результат.Свойство("entity") 
					И Результат.entity.Свойство("uuid") Тогда
					
					Uuid_ = Результат.entity.uuid;
					ЗаявкаОбъект = Заявка.ПолучитьОбъект();
					ЗаявкаОбъект.СДЭКUuid = Uuid_;
					ЗаявкаОбъект.Записать();
					
				КонецЕсли; 		
			КонецЕсли; 
			Если request.state = "INVALID"
				И request.type = "AUTH" Тогда
				АвторизацияНаСервере();
				Возврат Истина;
			КонецЕсли; 
			Если request.Свойство("errors") Тогда
				errors = request.errors[0];
				Ошибки = errors.message;
			КонецЕсли; 
		КонецЕсли;
		
		Request = СериализацияЗначения(СтрокаЗапроса);
	    ПреобразоватьИЗаписатьЛог(Request, Результат, ОтветСервера, "СДЭК Регистрация заказа", "Заявка "+Заявка.Номер);
		
		Возврат Ложь;
	Исключение
		
        Request = СериализацияЗначения(ОписаниеОшибки());
	    ПреобразоватьИЗаписатьЛог(Request, Результат, ОтветСервера, "СДЭК Регистрация заказа", "Заявка "+Заявка.Номер);
		
		Возврат Ложь;
		
    КонецПопытки;
КонецФункции

Функция СериализацияЗначения(ЗначениеПараметра)
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("СписокXDTO")
		 Или ТипЗнч(ЗначениеПараметра) = Тип("ОбъектXDTO")
		 Или ТипЗнч(ЗначениеПараметра) = Тип("ЗначениеXDTO") Тогда
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ЗначениеПараметра);
		Результат = ЗаписьXML.Закрыть();
	Иначе
		Результат = XMLСтрока(ЗначениеПараметра);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьИЗаписатьЛог(Request, Response, ResponseСтрокой, ИмяМетода, НаименованиеЛога)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	Попытка
		ЗаписатьJSON(ЗаписьJSON, Response);
		ОтветСДЭК = ЗаписьJSON.Закрыть();
	Исключение
	    ОтветСДЭК = ResponseСтрокой;
	КонецПопытки; 
	
	
	ЗаписатьЛог(НаименованиеЛога, Request, ОтветСДЭК, ИмяМетода, Заявка);
		
КонецФункции
 
Процедура ЗаписатьЛог(НаименованиеЛога, Request, Response, ИмяМетода, Основание)

	ЛогЗаписи = Справочники.ЛогиОбменовСВнешнимиСистемами.СоздатьЗапись(НаименованиеЛога);
	ЛогЗаписи.ДобавитьПараметр("Request", Request);
	ЛогЗаписи.ДобавитьПараметр("Response", Response);
	ЛогЗаписи.ТипДанных = ИмяМетода;
	ЛогЗаписи.Основание = Основание;
	ЛогЗаписи.Записать();   		

КонецПроцедуры

Процедура АвторизацияНаСервере()
	
	Если ОтправлятьНаТестовыйСервер Тогда
		Account 	= "EMscd6r9JnFiQ3bLoyjJY6eM78JrJceI";//Константы._Account.Получить();
		Password 	= "PjLZkKBHEiLK3YsjtNrt3TGNG0ahs3kG"; //Константы._Secure_password.Получить();
		Grant_type 	= "client_credentials";
	Иначе	
		Account 	= Константы.СДЭКAccount.Получить();
		Password 	= Константы.СДЭКSecure_password.Получить();
		Grant_type 	= "client_credentials";
	КонецЕсли; 
	
	HTTPСоединение = Новый HTTPСоединение(URL, , , , , , Новый ЗащищенноеСоединениеOpenSSL(), );
	СтрокаПараметров = "grant_type="+Grant_type+"&client_id=" +Account+"&client_secret="+Password;
	HTTPЗапрос = Новый HTTPЗапрос("/v2/oauth/token?"+СтрокаПараметров);

	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);

	Поток = Ответ.ПолучитьТелоКакПоток();
	Кодировка = "utf-8"; 

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(Поток, Кодировка); 
	Результат = ПрочитатьJSON(ЧтениеJSON);
	Если ТипЗнч(Результат) = Тип("Структура") 
		И Результат.Свойство("access_token") Тогда
		
		Константы.СДЭКТокен.Установить(Результат.access_token);
		
	КонецЕсли; 

	ОтветСервера = Ответ.ПолучитьТелоКакСтроку("UTF-8"); // ЧтениеJSON.Закрыть();

КонецПроцедуры

&НаСервере
Процедура ПолучитьИнформациюПоЗаказуНаСервере(ЭтоВозврат = Ложь)
	
	Токен = "Bearer "+ Константы.СДЭКТокен.Получить();
		
	HTTPСоединение = Новый HTTPСоединение(URL, , , , , , Новый ЗащищенноеСоединениеOpenSSL(), );
	
	Метод = "/v2/orders/"+?(ЭтоВозврат, Заявка.СДЭКUuidЗаявкиКурьера, Заявка.СДЭКUuid);
	HTTPЗапрос = Новый HTTPЗапрос(Метод);

	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен); 
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса); 
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);

	Поток = Ответ.ПолучитьТелоКакПоток();
	Кодировка = "utf-8"; 

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(Поток, Кодировка); 
	Результат = ПрочитатьJSON(ЧтениеJSON);
	
	Если ТипЗнч(Результат) = Тип("Структура") 
		И Результат.Свойство("entity") Тогда
		
		cdek_number = "";
		АктуальныйСтатус = "";
		
		entity = Результат.entity;
		Если ТипЗнч(entity) = Тип("Структура") 
			И entity.Свойство("cdek_number") Тогда
			
			cdek_number = entity.cdek_number;
			Номер = cdek_number; 		
		КонецЕсли; 
		total_sum = 0;
		Если ТипЗнч(entity) = Тип("Структура") 
			И entity.Свойство("delivery_detail") Тогда
			Если entity.delivery_detail.Свойство("total_sum") Тогда
				total_sum = entity.delivery_detail.total_sum;
			КонецЕсли; 
		КонецЕсли; 
		
		Если ТипЗнч(entity) = Тип("Структура")
			И entity.Свойство("statuses") Тогда
			
			Для каждого Статус Из entity.statuses Цикл
				АктуальныйСтатус = Статус.name;
				СтатусДоставки = АктуальныйСтатус;
				Прервать;	
			КонецЦикла;
			
		КонецЕсли; 
		
		Если cdek_number <> "" 
			ИЛИ АктуальныйСтатус <> "" Тогда
			
			НомерЗаявкиКурьера = cdek_number;
			СтатусДоставкиВозвратТК = АктуальныйСтатус;
					
			ЗаявкаОбъект = Заявка.ПолучитьОбъект();
			Если ЭтоВозврат Тогда
				ЗаявкаОбъект.НомерВозвратаСДЭК = cdek_number;
				ЗаявкаОбъект.СтатусДоставкиВозвратТК = АктуальныйСтатус;
				ЗаявкаОбъект.СуммаУслугВозвратСДЭК = total_sum;
			Иначе
				ЗаявкаОбъект.СДЭКНомер = cdek_number;
				ЗаявкаОбъект.СтатусДоставкиТК = АктуальныйСтатус;
				ЗаявкаОбъект.СуммаУслугСДЭК = total_sum;
			КонецЕсли;
			ЗаявкаОбъект.Записать();
			
		КонецЕсли; 
				
	КонецЕсли; 
	Если ТипЗнч(Результат) = Тип("Структура") 
		И Результат.Свойство("requests") Тогда
		
		request = Результат.requests[0];
		Если request.state = "INVALID"
			И request.type = "AUTH" Тогда
			АвторизацияНаСервере();
		КонецЕсли; 
		Если request.Свойство("errors")
			И ТипЗнч(request.errors) = Тип("Массив") Тогда
			
			Если Ошибки <> "" Тогда
				Ошибки = Ошибки+Символы.ПС;	
			КонецЕсли; 
				
			Для каждого СтрокаОшибка Из request.errors Цикл
				Ошибки = Ошибки + СтрокаОшибка.message+Символы.ПС;	
			КонецЦикла; 
			
		КонецЕсли;
	КонецЕсли; 
	
	ОтветСервера = Ответ.ПолучитьТелоКакСтроку("UTF-8");
	
	Request = СериализацияЗначения("URL: "+URL+"/"+Метод);
    Если ЭтоВозврат Тогда
		ИмяМетода = "СДЭК Информация по заказу возвратной накладной";
	Иначе
		ИмяМетода = "СДЭК Информация по заказу";
	КонецЕсли; 
    ПреобразоватьИЗаписатьЛог(Request, Результат, ОтветСервера, ИмяМетода, "Заявка "+Заявка.Номер);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Ошибки = "";
	ЭтоОтправкаЗаказа = Истина;
	
	СформироватьТекстЗапросаДляОтправки();
	ТребуетсяПереотправкаИзЗаТокена = ОтправитьНаСайтЗаказ();
	
	Если ТребуетсяПереотправкаИзЗаТокена Тогда
		ОтправитьНаСайтЗаказ();
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Uuid_) Тогда
		Таймер(1);
		ПолучитьИнформациюПоЗаказуНаСервере();
	КонецЕсли; 
		
	Если Ошибки = "" Тогда
		Закрыть();	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Таймер(КоличествоСекунд)
	
	НачалоОтсчета = ТекущаяДата();
	КонецОтсчета = НачалоОтсчета+КоличествоСекунд;
	
	УсловиеПрерывания = Истина;
	Пока УсловиеПрерывания Цикл
		Если ТекущаяДата()>КонецОтсчета Тогда
			УсловиеПрерывания = Ложь;	
		КонецЕсли; 		
	КонецЦикла; 
	
КонецФункции
 
&НаКлиенте
Процедура Обновить(Команда)
	ПолучитьИнформациюПоЗаказуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Результат = Новый Структура();
	Результат.Вставить("Uuid", Uuid_);
	Результат.Вставить("Номер", Номер);
	Результат.Вставить("СтатусДоставки", СтатусДоставки);
	Результат.Вставить("ЭтоОтправкаЗаказа", ЭтоОтправкаЗаказа);
	Результат.Вставить("НомерЗаявкиКурьера", НомерЗаявкиКурьера);
	Результат.Вставить("СтатусДоставкиВозврат", СтатусДоставкиВозвратТК);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьВызовКурьераНаСервере()
	
	СформироватьТекстВозвратаНаСервере();
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Возврат;	
	КонецЕсли; 
	ОтправитьЗаявкуНаВызовКурьера();
	
КонецПроцедуры

Функция ПолучитьИнформациюКурьерНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Заявка.СДЭКUuidЗаявкиКурьера) Тогда
		Возврат 0;	
	КонецЕсли; 
	
	Токен = "Bearer "+ Константы.СДЭКТокен.Получить();
		
	HTTPСоединение = Новый HTTPСоединение(URL, , , , , , Новый ЗащищенноеСоединениеOpenSSL(), );
	
	Метод = "/v2/intakes/"+Заявка.СДЭКUuidЗаявкиКурьера;
	HTTPЗапрос = Новый HTTPЗапрос(Метод);

	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен); 
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса); 
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	ОтветСервера = Ответ.ПолучитьТелоКакСтроку();

	Поток = Ответ.ПолучитьТелоКакПоток();
	Кодировка = "utf-8"; 

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(Поток, Кодировка); 
	Результат = ПрочитатьJSON(ЧтениеJSON);
	
	Если ТипЗнч(Результат) = Тип("Структура") 
		И Результат.Свойство("entity") Тогда
		
		entity = Результат.entity;
		Если ТипЗнч(entity) = Тип("Структура") 
			И entity.Свойство("intake_number") Тогда
			
			ЗаявкаОбъект = Заявка.ПолучитьОбъект();
			ЗаявкаОбъект.СДЭКНомерЗаявкиКурьера = entity.intake_number;
			ЗаявкаОбъект.СДЭКЗаявкаНаВызовКурьераОтправлена = Истина;
			ЗаявкаОбъект.Записать();
			НомерЗаявкиКурьера = entity.intake_number;
		КонецЕсли; 
						
	КонецЕсли; 
	
	Если ТипЗнч(Результат) = Тип("Структура") 
		И Результат.Свойство("requests") Тогда
		
		request = Результат.requests[0];
		Если request.state = "INVALID"
			И request.type = "AUTH" Тогда
			АвторизацияНаСервере();
		КонецЕсли; 
		Ошибки = "";
		Если request.Свойство("errors")
			И ТипЗнч(request.errors) = Тип("Массив") Тогда
			
			Для каждого СтрокаОшибка Из request.errors Цикл
				Ошибки = Ошибки+СтрокаОшибка.message+Символы.ПС;	
			КонецЦикла; 
			
		КонецЕсли;
	КонецЕсли; 
	
	ОтветСервера = Ответ.ПолучитьТелоКакСтроку("UTF-8");
	
	Request = СериализацияЗначения("URL: "+URL+"/"+Метод);
    ПреобразоватьИЗаписатьЛог(Request, Результат, ОтветСервера, "СДЭК Информация по заявке", "Заявка "+Заявка.Номер);
	
КонецФункции
 
Функция ОтправитьЗаявкуНаВызовКурьера()
	
	Попытка
	
		Токен = "Bearer "+ Константы.СДЭКТокен.Получить();
		HTTPСоединение = Новый HTTPСоединение(URL, , , , , , Новый ЗащищенноеСоединениеOpenSSL(), );
		HTTPЗапрос = Новый HTTPЗапрос("/v2/orders/");
		
		HTTPЗапрос.Заголовки.Вставить("Authorization", Токен); 
	    HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса); 
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
		
		Поток = Ответ.ПолучитьТелоКакПоток();
		Кодировка = "utf-8"; 

		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.ОткрытьПоток(Поток, Кодировка); 
		Результат = ПрочитатьJSON(ЧтениеJSON);
		ОтветСервера = Ответ.ПолучитьТелоКакСтроку("UTF-8"); // ЧтениеJSON.Закрыть();
		
		Если ТипЗнч(Результат) = Тип("Структура") 
			И Результат.Свойство("requests") Тогда
			
			request = Результат.requests[0];
			Если request.state = "ACCEPTED" Тогда
				Если Результат.Свойство("entity") 
					И Результат.entity.Свойство("uuid") Тогда
					
					ЗаявкаОбъект = Заявка.ПолучитьОбъект();
					ЗаявкаОбъект.СДЭКUuidЗаявкиКурьера = Результат.entity.uuid;
					ЗаявкаОбъект.Записать();
					
				КонецЕсли; 		
			КонецЕсли; 
			Если request.state = "INVALID"
				И request.type = "AUTH" Тогда
				АвторизацияНаСервере();
			КонецЕсли; 
		КонецЕсли; 
		Если ТипЗнч(Результат) = Тип("Структура") 
			И Результат.Свойство("errors") Тогда
			
			errors = Результат.errors[0];
			Ошибки = errors.message; 
		КонецЕсли;
		Если  ТипЗнч(Результат) = Тип("Структура") 
			И Результат.Свойство("requests") Тогда
			requests = Результат.requests;
			Если ТипЗнч(requests) = Тип("Массив") Тогда
				request = requests[0];	
				Если request.Свойство("errors") Тогда
					errors = request.errors[0];	
					Ошибки = errors.message;
				КонецЕсли; 
			КонецЕсли; 
			
		КонецЕсли;
		Request = СериализацияЗначения(СтрокаЗапроса);
	    ПреобразоватьИЗаписатьЛог(Request, Результат, ОтветСервера, "СДЭК Регистрация заказа возвратной накладной", "Заявка "+Заявка.Номер);
	
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	ПолучитьИнформациюПоЗаказуНаСервере(Истина);
	
КонецФункции
 
&НаСервере
Функция СформироватьТекстВозвратаНаСервере()
	
	Ошибки = "";
	СтрокаЗапроса = "";
	
	Результат = ПолучитьДанныеЗаказаВозвратнаяНакладная(); 
	ВыборкаШапка = Результат.ВыборкаШапка;
	ВыборкаШапка.Следующий();
	ТЗМаркировка = Результат.ТЗМаркировка;
	
	ВыборкаМесто = Результат.ВыборкаТовары;
	Если ВыборкаМесто.Количество() = 0 Тогда
		Ошибки = "Нет товаров к отправке";
		Возврат 0;	
	КонецЕсли; 
	
	Заказ  = СоздатьОбъектXDTO("order");
	Заказ.number =  ВыборкаШапка.number;
	Заказ.comment =  ВыборкаШапка.ПримечаниеТК;
	
	Отправитель = СоздатьОбъектXDTO("location");
	Отправитель.city = ВыборкаШапка.ГородОтправки;
	Отправитель.address = ВыборкаШапка.АдресОтправки;
	Отправитель.code = ВыборкаШапка.КодГородаОтправки;
	
	Заказ.from_location = Отправитель;
	
	Если Заявка.СДЭКВыбранныйТарифВозвратнаяНакладная.РежимДоставки = Перечисления._ТипыДоставки.ДверьСклад
		ИЛИ Заявка.СДЭКВыбранныйТарифВозвратнаяНакладная.РежимДоставки = Перечисления._ТипыДоставки.ДоСклада Тогда
		Заказ.delivery_point = ВыборкаШапка.КодПВЗ;
	Иначе
		
		Получатель = СоздатьОбъектXDTO("location");
		Получатель.city = ВыборкаШапка.ГородДоставкиНаименование;
		Получатель.address = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_Адрес","");//ВыборкаШапка.АдресДоставки;
		Получатель.code = ВыборкаШапка.ГородДоставкиКод;
		
		Заказ.to_location = Получатель;
			
	КонецЕсли;
	
	Пока ВыборкаМесто.Следующий() Цикл
		ВыборкаТовары = ВыборкаМесто.Выбрать();
		
		Упаковка = СоздатьОбъектXDTO("packages");
		Упаковка.number = "bar-001"+Строка(ВыборкаМесто.Место);
		
		Упаковка.height = 17;
		Упаковка.length = 42;
		Упаковка.width  = 33;
		КоличествоТовараВУпаковке = 0;
		
		Пока ВыборкаТовары.Следующий() Цикл
		
			Товар = СоздатьОбъектXDTO("item");
			ЗаполнитьЗначенияСвойств(Товар, ВыборкаТовары);	
			
			СуммаОплатыПриПолучении = СоздатьОбъектXDTO("payment");
			Если ВыборкаШапка.НаложенныйПлатеж Тогда
				СуммаОплатыПриПолучении.value = Товар.cost;	
			Иначе
				СуммаОплатыПриПолучении.value = 0;	
			КонецЕсли; 
			Если ВыборкаТовары.НоменклатураКод = "Ц0000120605" Тогда //"доставка ИМ" не может иметь объявленную ценность
				Товар.cost = 0;
				Товар.name = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_НазваниеДоставки", "Доставка ИМ при выкупе менее 15000руб");;
			КонецЕсли;
			Товар.payment = СуммаОплатыПриПолучении;
			
			Если ВыборкаТовары.МаркируемыйТовар Тогда
				 
				Если ВыборкаТовары.amount > 1 Тогда
					Сообщить("Для маркируемых товаров количество в строке не должно превышать 1 шт: "+ВыборкаТовары.name+"
							|Выгрузка невозможна.");
					Возврат 0;	
				КонецЕсли;   
				НайденныеСтроки = ТЗМаркировка.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ЗаказКлиента", 
											ВыборкаТовары.Номенклатура,ВыборкаТовары.Характеристика,ВыборкаТовары.Заказ));
											
				Если НайденныеСтроки.Количество() Тогда
					НайденнаяСтрока = НайденныеСтроки[0];
					
					Если НЕ ВыборкаТовары.ЭтоМех Тогда
						РазобранныйШтрихкодСтруктурой = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(НайденнаяСтрока.ШтрихкодУпаковки.ЗначениеШтрихкода);
						hex_code = СтрЗаменить(Строка(РазобранныйШтрихкодСтруктурой.РеквизитКодаТовараHEX), " ", "");
		
						Товар.marking = hex_code;	
					КонецЕсли; 
					
				Иначе
					Сообщить("Не внесен код маркировки для товара "+ВыборкаТовары.name+" 
					|Выгрузка невозможна.");
					Возврат 0;
				КонецЕсли; 
			КонецЕсли; 
			Упаковка.items.Добавить(Товар);
			
			КоличествоТовараВУпаковке = КоличествоТовараВУпаковке + ВыборкаТовары.amount;
			
		КонецЦикла;
		Упаковка.weight = КоличествоТовараВУпаковке * 700;
		
		Заказ.packages.Добавить(Упаковка);
	
	КонецЦикла;
	
	Получатель = СоздатьОбъектXDTO("client");
	Получатель.name = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_Продавец", ""); 
	
	Телефон = СоздатьОбъектXDTO("phone");
	Телефон.number = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_ТелефонКомпании", "");
	Если ЗначениеЗаполнено(Телефон.number) И НЕ СтрНачинаетсяС(Телефон.number, "+") Тогда
		Телефон.number = "+"+Телефон.number;
	КонецЕсли; 
	
	Получатель.phones.Добавить(Телефон);
	
	Заказ.recipient = Получатель;
	
	Отправитель = СоздатьОбъектXDTO("sender");
	Отправитель.company = ВыборкаШапка.ПартнерНаименование;
	Отправитель.name = ВыборкаШапка.ПартнерНаименование;
	
	Телефон = СоздатьОбъектXDTO("phone");
	Телефон.number = ВыборкаШапка.НомерТелефона;
	Если ЗначениеЗаполнено(Телефон.number) И НЕ СтрНачинаетсяС(Телефон.number, "+") Тогда
		Телефон.number = "+"+Телефон.number;
	КонецЕсли; 
	
	Отправитель.phones.Добавить(Телефон);
	Отправитель.passport_requirements_satisfied = Ложь;
	
	Заказ.sender = Отправитель;
	
	Seller = СоздатьОбъектXDTO("client");
	Seller.name = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_Продавец", "");
	Заказ.Seller = Seller;
	
	ДопУслугиЗаявки = Заявка.СДЭКДопУслугиВозвратнаяНакладная.Получить();
	
	Если ТипЗнч(ДопУслугиЗаявки) = Тип("СписокЗначений") Тогда
		Для каждого СтрокаДопУслуга Из ДопУслугиЗаявки Цикл
			
			ДопУслуга = СоздатьОбъектXDTO("service");
			ДопУслуга.code = СтрокаДопУслуга.Значение.КодУслуги;
			Если ДопУслуга.code = "PACKAGE_1" Тогда
				ДопУслуга.parameter = Заявка.КоличествоМест;
			Иначе
				ДопУслуга.parameter = 0;
			КонецЕсли; 
			
			Заказ.services.Добавить(ДопУслуга);
			
		КонецЦикла; 
	КонецЕсли; 
	
	Заказ.tariff_code = ВыборкаШапка.КодТарифа;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьJSON(ЗаписьJSON, Заказ);
	
	СтрокаЗапроса = ЗаписьJSON.Закрыть();
	
	СтрокаЗапроса = Прав(СтрокаЗапроса, СтрДлина(СтрокаЗапроса)-13);
	СтрокаЗапроса = Лев(СтрокаЗапроса, СтрДлина(СтрокаЗапроса)-1);
	
КонецФункции

Функция ПолучитьДанныеЗаказаВозвратнаяНакладная()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаДоставку.Комментарий КАК comment,
		|	ЗаявкаНаДоставку.СДЭКОтправительВозвратнойНакладной КАК ПартнерНаименование,
		|	ЗаявкаНаДоставку.НомерПоДаннымКлиента + ""_return"" КАК number,
		|	137 КАК ГородДоставкиКод,
		|	""Санкт-Петербург"" КАК ГородДоставкиНаименование,
		|	ЗаявкаНаДоставку.СДЭКАдресВозвратнойНакладной КАК АдресОтправки,
		|	ЗаявкаНаДоставку.НаложенныйПлатеж КАК НаложенныйПлатеж,
		|	ЗаявкаНаДоставку.СтраховатьГруз КАК СтраховатьГруз,
		|	ЗаявкаНаДоставку.СДЭКТелефонВозвратнойНакладной КАК НомерТелефона,
		|	ЕСТЬNULL(ЗаявкаНаДоставку.СДЭКВыбранныйТарифВозвратнаяНакладная.КодТарифа, 0) КАК КодТарифа,
		|	ЗаявкаНаДоставку.СДЭКДопУслуги КАК СДЭКДопУслуги,
		|	ЗаявкаНаДоставку.ПримечаниеТК КАК ПримечаниеТК,
		|	""191167, Санкт-Петербург г, вн.тер. г. муниципальный округ Лиговка-Ямская, пр-кт Невский, д. 153"" КАК АдресДоставки,
		|	ЕСТЬNULL(ЗаявкаНаДоставку.СДЭКГородДоставки.КодГорода, 0) КАК КодГородаОтправки,
		|	ЕСТЬNULL(ЗаявкаНаДоставку.СДЭКГородДоставки.Наименование, """") КАК ГородОтправки
		|ИЗ
		|	Документ.ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
		|ГДЕ
		|	ЗаявкаНаДоставку.Ссылка = &Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаНаДоставкуТовары.Номенклатура.Код КАК ware_key,
		|	ЗаявкаНаДоставкуТовары.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ЗаявкаНаДоставкуТовары.Характеристика.НаименованиеПолное, """") КАК name,
		|	ЗаявкаНаДоставкуТовары.Сумма КАК cost,
		|	ЗаявкаНаДоставкуТовары.Количество КАК amount,
		|	700 КАК weight,
		|	ЗаявкаНаДоставкуТовары.Место КАК Место,
		|	ЗаявкаНаДоставкуТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция)
		|		ИЛИ ЗаявкаНаДоставкуТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Духи)
		|		ИЛИ ЗаявкаНаДоставкуТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность)
		|		ИЛИ ЗаявкаНаДоставкуТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПродукцияМаркируемаяДляГИСМ) КАК МаркируемыйТовар,
		|	ЗаявкаНаДоставкуТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПродукцияМаркируемаяДляГИСМ) КАК ЭтоМех,
		|	ЗаявкаНаДоставкуТовары.Номенклатура КАК Номенклатура,
		|	ЗаявкаНаДоставкуТовары.Характеристика КАК Характеристика,
		|	ЗаявкаНаДоставкуТовары.Заказ КАК Заказ,
		|	ЗаявкаНаДоставкуТовары.Номенклатура.Код КАК НоменклатураКод
		|ИЗ
		|	Документ.ЗаявкаНаДоставку.Товары КАК ЗаявкаНаДоставкуТовары
		|ГДЕ
		|	ЗаявкаНаДоставкуТовары.Ссылка = &Заявка
		|	И ЗаявкаНаДоставкуТовары.ВозвратКурьером
		|ИТОГИ ПО
		|	Место
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаркируемыеТоварыВЗаказеКлиента.ЗаказКлиента КАК ЗаказКлиента,
		|	МаркируемыеТоварыВЗаказеКлиента.Номенклатура КАК Номенклатура,
		|	МаркируемыеТоварыВЗаказеКлиента.Характеристика КАК Характеристика,
		|	МаркируемыеТоварыВЗаказеКлиента.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	МаркируемыеТоварыВЗаказеКлиента.Серия КАК Серия
		|ИЗ
		|	РегистрСведений.МаркируемыеТоварыВЗаказеКлиента КАК МаркируемыеТоварыВЗаказеКлиента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаДоставку.Товары КАК ЗаявкаНаДоставкуТовары
		|		ПО МаркируемыеТоварыВЗаказеКлиента.ЗаказКлиента = ЗаявкаНаДоставкуТовары.Заказ
		|			И МаркируемыеТоварыВЗаказеКлиента.Номенклатура = ЗаявкаНаДоставкуТовары.Номенклатура
		|			И МаркируемыеТоварыВЗаказеКлиента.Характеристика = ЗаявкаНаДоставкуТовары.Характеристика
		|ГДЕ
		|	ЗаявкаНаДоставкуТовары.Ссылка = &Заявка
		|	И ЗаявкаНаДоставкуТовары.ВозвратКурьером
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЗаявкаНаДоставкуТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.ЗаявкаНаДоставку.Товары КАК ЗаявкаНаДоставкуТовары
		|ГДЕ
		|	ЗаявкаНаДоставкуТовары.Ссылка = &Заявка
		|	И ЗаявкаНаДоставкуТовары.ВозвратКурьером";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("ВидНоменклатурыУслуги", Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуги"));
	Запрос.УстановитьПараметр("Партнер", Заявка.Партнер);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = РезультатЗапроса[0].Выбрать();
	ВыборкаТовары = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТЗМаркировка = РезультатЗапроса[2].Выгрузить();
	ВыборкаКоличествоТоваров = РезультатЗапроса[3].Выбрать();
	
	Если ВыборкаКоличествоТоваров.Следующий() Тогда
		КоличествоТоваров = ВыборкаКоличествоТоваров.Количество;
	Иначе
		КоличествоТоваров = 0;
	КонецЕсли; 
	
	Возврат Новый Структура("ВыборкаШапка, ВыборкаТовары, ТЗМаркировка, КоличествоТоваров", ВыборкаШапка, ВыборкаТовары, ТЗМаркировка, КоличествоТоваров);
	
КонецФункции
 
&НаКлиенте
Процедура ОтправитьВызовКурьера(Команда)
	ОтправитьВызовКурьераНаСервере();
КонецПроцедуры

