 
Процедура ПроверитьЗадолженностьПоДокументуОснованию(Отказ)
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту
        И РасшифровкаПлатежа.Количество() > 0 Тогда

		ДокОснование 		= РасшифровкаПлатежа[0].Заказ;
		СуммаВзаиморасчетов = РасшифровкаПлатежа[0].СуммаВзаиморасчетов;
		
		Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РасчетыСКлиентамиОстатки.ЗаказКлиента КАК ЗаказКлиента,
				|	РасчетыСКлиентамиОстатки.ЗаказКлиента.ХозяйственнаяОперация КАК ЗаказКлиентаХозяйственнаяОперация,
				|	РасчетыСКлиентамиОстатки.СуммаОстаток КАК СуммаОстаток,
				|	РасчетыСКлиентамиОстатки.КОплатеОстаток КАК КОплатеОстаток
				|ИЗ
				|	РегистрНакопления.РасчетыСКлиентами.Остатки(&ДатаДокумента, ЗаказКлиента = &ДокументОснование {(ЗаказКлиента В (&ЗаказКлиентаОтбор)) КАК Поле2}) КАК РасчетыСКлиентамиОстатки";
			
			Запрос.УстановитьПараметр("ДатаДокумента", 		Дата);
			Запрос.УстановитьПараметр("ДокументОснование", 	ДокОснование);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				Отказ = Истина;
				ВызватьИсключение НСтр("ru='По данному возврату нет задолженности!'");
				Возврат;
			КонецЕсли; 
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				//Задолженность к выплате должна быть отрицательная
				ОстатокЗадолженности = ВыборкаДетальныеЗаписи.СуммаОстаток;
				Если ОстатокЗадолженности > 0 Тогда
					Отказ = Истина;
					ВызватьИсключение НСтр("ru='По данному возврату нет задолженности!'");
					Возврат;
                ИначеЕсли -ОстатокЗадолженности < СуммаВзаиморасчетов Тогда 
					Отказ = Истина;
					ВызватьИсключение НСтр("ru='Сумма взаиморасчетов превышает остаток задолженности!'");
					Возврат;
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&После("ИнициализироватьДокумент")
Процедура ba_ИнициализироватьДокумент(ДанныеЗаполнения)
	//++babochka
	Подразделение = Бабочка.ПолучитьПодразделение();
	ЭквайринговыйТерминал = Справочники.ЭквайринговыеТерминалы.ПустаяСсылка();
	//--babochka
КонецПроцедуры

&Перед("ОбработкаПроведения")
Процедура ba_ОбработкаПроведения(Отказ, РежимПроведения)
	//++babochka
	ПроверитьЗадолженностьПоДокументуОснованию(Отказ);
	//--babochka
КонецПроцедуры
