
&После("ИнициализироватьДокумент")
Процедура ba_ИнициализироватьДокумент(ДанныеЗаполнения)
	//++babochka
	Подразделение = Бабочка.ПолучитьПодразделение(); 
	//--babochka	 
КонецПроцедуры

&После("ПередЗаписью")
Процедура ba_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//babochka++
	ПроверитьТаблицуТоваров(Отказ);
	//babochka--
КонецПроцедуры  



Процедура ПроверитьТаблицуТоваров(Отказ)
	
	ПроверятьПриходникНаСоответствиеТоваровВПеремещении = Бабочка.ПолучитьЗначениеДинамическихНастроек("ПроверятьПриходникНаСоответствиеТоваровВПеремещении", Ложь);
	Если НЕ ПроверятьПриходникНаСоответствиеТоваровВПеремещении Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Распоряжение) <> Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Возврат;
	КонецЕсли;
	
	ВТ_Товары = Товары.Выгрузить(,"Номенклатура, Характеристика");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_ДанныеДокумента
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура,
		|	ВТ_ДанныеДокумента.Характеристика КАК Характеристика
		|ИЗ
		|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|		ПО ВТ_ДанныеДокумента.Номенклатура = ПеремещениеТоваровТовары.Номенклатура
		|			И ВТ_ДанныеДокумента.Характеристика = ПеремещениеТоваровТовары.Характеристика
		|			И ПеремещениеТоваровТовары.Ссылка = &ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваровТовары.Номенклатура ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Товары", ВТ_Товары);
	Запрос.УстановитьПараметр("ПеремещениеТоваров", Распоряжение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Отказ = НЕ РезультатЗапроса.Пустой();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = СтрШаблон("Позиции '%1, %2' нет в перемещении товаров.", Выборка.Номенклатура, Выборка.Характеристика);
		Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное);	
	КонецЦикла;
	
КонецПроцедуры

&Перед("ОбработкаПроведения")
Процедура ba_ОбработкаПроведения(Отказ, РежимПроведения)
	//++babochka 
	Если Склад.АдресныйСклад 
		И Склад.ДатаНачалаВеденияУчетаПоЯчейкам < Дата Тогда
		
		АдресноеХранениеBabochka.ОтразитьТоварыВЯчейкахПО(Ссылка, Движения, Отказ, "Документ.ПриходныйОрдерНаТовары.Товары");
		Если СтатусАдресноеХранение <> Перечисления.СтатусыОтборовРазмещенийТоваровBabochka.Выполнено Тогда  
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	//--babochka
КонецПроцедуры



