 
Функция ЗаполнитьХарактеристики(ХарактеристикиДанныеДляСоздания, ИндексНачала, РазмерПорции, Характеристики, ЗагружатьТолькоНовыеОбъекты) Экспорт 
	
	Для Сч = 1 По РазмерПорции Цикл
		
		Индекс = ?(Сч=1,ИндексНачала,Индекс+1);
		
		НоменклатураСсылка = НайтиОбъектПоGUID(ХарактеристикиДанныеДляСоздания[Индекс].НоменклатураСсылка, "Номенклатура");
		Если НЕ ЗначениеЗаполнено(НоменклатураСсылка) Тогда 
			Возврат Неопределено;
		КонецЕсли;
		
		НовыйGUID = Новый УникальныйИдентификатор(ХарактеристикиДанныеДляСоздания[Индекс].Ссылка); 	
		ЭлементСсылка = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(НовыйGUID);
		
		Отбор = Новый Структура("Ссылка", ХарактеристикиДанныеДляСоздания[Индекс].Ссылка); 
		СтрСсылочныхДанных = Характеристики.НайтиСтроки(Отбор); 
		
		Если ЗначениеЗаполнено(ЭлементСсылка.ВерсияДанных) И ЗагружатьТолькоНовыеОбъекты Тогда 
			Продолжить;
		ИначеЕсли ЗначениеЗаполнено(ЭлементСсылка.ВерсияДанных) Тогда
			ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
		Иначе                                                     		
			ЭлементОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			ЭлементОбъект.УстановитьСсылкуНового(ЭлементСсылка);  	
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭлементОбъект, ХарактеристикиДанныеДляСоздания[Индекс], "ПометкаУдаления,Код,ШтрихкодПроизводителя,
		|Наименование,НаименованиеПолное,ГуидИз10,ID_MarketPlace,ВыгружатьВИМ_MarketPlace,Предзаказ,
		|КоличествоДнейНаИзготовление,ДопХарактеристика"); 
		
		Если ЗначениеЗаполнено(ХарактеристикиДанныеДляСоздания[Индекс].ЦветКод) Тогда
			Если ЗначениеЗаполнено(СтрСсылочныхДанных[0].ЦветКод_ссылка) Тогда
				ЭлементОбъект.Цвет = СтрСсылочныхДанных[0].ЦветКод_ссылка;
			Иначе
				СообщитьНеНайденСсылочныйТип("ЦветКод", ХарактеристикиДанныеДляСоздания[Индекс].ЦветКод);
			КонецЕсли; 
		КонецЕсли;  
		Если ЗначениеЗаполнено(ХарактеристикиДанныеДляСоздания[Индекс].КодТНВЭД) Тогда  
			Если ЗначениеЗаполнено(СтрСсылочныхДанных[0].КодТНВЭД_ссылка) Тогда
				ЭлементОбъект.КодТНВЭД = СтрСсылочныхДанных[0].КодТНВЭД_ссылка;
			Иначе
				СообщитьНеНайденСсылочныйТип("КодТНВЭД", ХарактеристикиДанныеДляСоздания[Индекс].КодТНВЭД);
			КонецЕсли; 
		КонецЕсли;
		ЭлементОбъект.Владелец = НоменклатураСсылка;
		ЭлементОбъект.Размер = НайтиОбъектПоGUID(ХарактеристикиДанныеДляСоздания[Индекс].Размер, "РазмернаяСеткаБабочка");	
		ЭлементОбъект.КодЦвета = НайтиОбъектПоGUID(ХарактеристикиДанныеДляСоздания[Индекс].КодЦвета, "КодыЦветовБабочка");	
		
		ЭлементОбъект.Записать();   		
		
		Если ХарактеристикиДанныеДляСоздания[Индекс].Штрихкоды <> Неопределено Тогда 
			
			Если ТипЗнч(ХарактеристикиДанныеДляСоздания[Индекс].Штрихкоды) = Тип("Массив") Тогда
				Для каждого Штрихкод Из ХарактеристикиДанныеДляСоздания[Индекс].Штрихкоды Цикл
					ЗаполнитьШтрихкод(Штрихкод, НоменклатураСсылка, ЭлементОбъект.Ссылка);		
				КонецЦикла;	
				
			Иначе
				ЗаполнитьШтрихкод(ХарактеристикиДанныеДляСоздания[Индекс].Штрихкоды, НоменклатураСсылка, ЭлементОбъект.Ссылка);	
			КонецЕсли;
			
		КонецЕсли;  
		
	КонецЦикла;
	
КонецФункции  


Функция НайтиОбъектПоGUID(GUID, ТипМетаданных)
	
	Если GUID = ""
		ИЛИ GUID = "00000000-0000-0000-0000-000000000000" 
		ИЛИ GUID = Неопределено ИЛИ СтрДлина(GUID) <> 36  Тогда
		
		Возврат Справочники[ТипМетаданных].ПустаяСсылка();	
		
	КонецЕсли;
	
	НовыйGUID = Новый УникальныйИдентификатор(GUID); 	
	ОбъектСсылка = Справочники[ТипМетаданных].ПолучитьСсылку(НовыйGUID);
	
	Если ЗначениеЗаполнено(ОбъектСсылка.ВерсияДанных) Тогда
		Возврат ОбъектСсылка;
	Иначе
		Сообщить(СтрШаблон("Не найден тип объекта %1 с гуидом %2", ТипМетаданных, GUID));
		Возврат Справочники[ТипМетаданных].ПустаяСсылка();	
	КонецЕсли;
	
КонецФункции 

Функция ЗаполнитьШтрихкод(Штрихкод, Номенклатура, Характеристика)
	
	Если НЕ ЗначениеЗаполнено(Штрихкод) Тогда
		Возврат 0;	
	КонецЕсли; 
	
	//используем Набор, чтобы не регистрировать к обмену
	Набор = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
	Набор.Отбор.Штрихкод.Установить(Штрихкод);  
	Набор.Прочитать();
	
	Если Набор.Количество() Тогда
		Для каждого СтрокаРС Из Набор Цикл
			СтрокаРС.Номенклатура = Номенклатура; 
			СтрокаРС.Характеристика = Характеристика;
		КонецЦикла;
	Иначе
		Запись = Набор.Добавить();
		Запись.Номенклатура = Номенклатура; 
		Запись.Характеристика = Характеристика;
		Запись.Штрихкод = Штрихкод; 
	КонецЕсли;  
	
	Набор.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	Набор.Записать();
	
КонецФункции  

Процедура СообщитьНеНайденСсылочныйТип(ТипДанных, гуид) 
	Сообщить(СтрШаблон("Не найден объект с типо данных %1 по наименованию %2", ТипДанных, гуид));
КонецПроцедуры



#Область ЛогированиеВТг        
#Область Регламентное_задание

//============================================================
//************************************************************
Функция СформироватьВложение(тзЖурнал) Экспорт    
    
    //Макет           = ПреобразоватьТекстВДом(ПолучитьМакет("Макет").ПолучитьТекст());
    Макет           = ПреобразоватьТекстВДом(ПолучитьОписаниеCSS());
    
    ЗаОдинДень      = НачалоДня(тзЖурнал[0].Дата) = НачалоДня(тзЖурнал[тзЖурнал.Количество()-1].Дата);
    
    // Установим заголовок
    Если ЗаОдинДень Тогда
        Заголовок       = СтрШаблон("Выгрузка ошибок из журнала регистрации за %1 для базы: %2"
            , Формат(тзЖурнал[0].Дата, "ДФ='d MMM yyyy ''г.'''")
            , СтрокаСоединенияИнформационнойБазы() 
        );
    Иначе
        Заголовок       = СтрШаблон("Выгрузка ошибок из журнала регистрации с %1 по %2 для базы: %3"
            , Формат(тзЖурнал[0].Дата, "ДФ='d MMM yyyy ''г.'''")
            , Формат(тзЖурнал[тзЖурнал.Количество()-1].Дата, "ДФ='d MMM yyyy ''г.'''")
            , СтрокаСоединенияИнформационнойБазы() 
        );        
    КонецЕсли;
    Макет.Заголовок = Заголовок;
    Макет.ПолучитьЭлементПоИдентификатору("information").ТекстовоеСодержимое  
                    = Заголовок;
    Макет.Нормализовать();
    Вложение        = ПреобразоватьДомВТекст(Макет);
                  
    ТелоТаблицы     = "";
    Для Каждого Строка Из тзЖурнал Цикл
        ТелоТаблицы = ТелоТаблицы + СтрШаблон("
            |<tr>
            |    <th scope=""row"">%1</td>
            |    <td class=""tooltip"">%2<span class=""classic"">%3</span></td>
            |    <td class=""tooltip"">%4<span class=""classic"">%5</span></td>
            |</tr>"
            , Формат(Строка.Дата, ?(ЗаОдинДень, "ДФ='H:mm:ss'", "ДФ='d MMM yyyy '' г.</br>''H:mm:ss'")) // Дата  
            , Строка.Компьютер + "</br>" + Строка.ПредставлениеПриложения + "</br>" + Строка.ИмяПользователя // Компьютер / ПредставлениеПриложения / ИмяПользователя 
            , СтрЗаменить(Строка.Комментарий, Символы.ПС, "</br>") // Комментарий  
            , Строка.Событие + "</br>" + Строка.Метаданные + "</br>" + Строка.Данные // Событие / Метаданные / Данные 
            , Строка.ПредставлениеСобытия + "</br>" + Строка.ПредставлениеМетаданных + "</br>" + Строка.ПредставлениеДанных // ПредставлениеСобытия / ПредставлениеМетаданных / ПредставлениеДанных 
            );
    КонецЦикла;
    Вложение    = СтрЗаменить(Вложение, "<!--ТелоТаблицы-->", ТелоТаблицы); 
    Возврат Вложение;   
КонецФункции // СформироватьВложение()
//************************************************************
Процедура ОтправитьСообщениеВТелеграм(Сообщение,ИдентификаторПолучателя) Экспорт
    
    Токен  = Бабочка.ПолучитьЗначениеДинамическихНастроек("ИдентификаторTelegramАнтон", 
			"8582904975:AAEk98PHupl7Pl-Zx9TyftCNZPWXW1kILGU"); ;
    // Сформировать соединение и запрос
    Соединение  = ПолучитьСоединение();
    Адрес       = СтрШаблон("/bot%1/sendMessage?chat_id=%2&parse_mode=HTML&text=%3"
                , Токен
                , ИдентификаторПолучателя
                , КодироватьСтроку(Сообщение, СпособКодированияСтроки.КодировкаURL, "UTF8"));
    Заголовки   = Новый Соответствие;
    Запрос      = Новый HTTPЗапрос(Адрес, Заголовки);
    
    // GET
    Ответ       = Соединение.Получить(Запрос);
    
    // Разбор ответа
    Если Ответ.КодСостояния <> 200 Тогда 
        ВызватьИсключение СтрШаблон("Ошибка отправки сообщения в телеграм.
            |Код состояния: %1
            |Тело: %2"
            , Ответ.КодСостояния
            , Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8)
        ); 
    КонецЕсли;   
КонецПроцедуры // ОтправитьСообщениеВТелеграм()
//************************************************************
Процедура ОтправитьВложениеВТелеграм(Знач Вложение,ИдентификаторПолучателя, ПутьКФайлу, ДатаНачала) Экспорт
    // Сформировать тело запроса
    Токен                   = "828255299:AAFw9yglXi_oxT8vzO328bUSUTEZt_QMI4U"; // 000000000:XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX   BabochkaReport_bot  //bg

    Разделитель         = "----" + Строка(Новый УникальныйИдентификатор());
    Вложение            = СтрШаблон(
        "--%1
        |Content-Disposition: form-data; name=""chat_id""
        |
        |%2
        |--%1
        |Content-Disposition: form-data; name=""document""; filename=""%3""
        |
        |%4
        |--%1--
        |"
        , Разделитель // boundary
        , ИдентификаторПолучателя // Получатель
        , Формат(ДатаНачала, "ДФ='yyyyddMM''.html'''") // Имя файла
        , Вложение // Тело файла
    );   
    //ПутьКФайлу          = ПолучитьИмяВременногоФайла("post");
    //ПутьКФайлу          = "\\10.0.111.110\Obmen\exchange\Telegram\telegramKA.post";    //bg
    тд                  = Новый ТекстовыйДокумент;
    тд.УстановитьТекст(Вложение);
    тд.Записать(ПутьКФайлу, КодировкаТекста.UTF8);

    // Сформировать соединение и запрос
    Соединение			= ПолучитьСоединение();
    Заголовки			= Новый Соответствие;
    Заголовки.Вставить("Content-Type", "multipart/form-data; boundary=" + Разделитель);
    Адрес               = СтрШаблон("/bot%1/sendDocument", Токен);
    Запрос				= Новый HTTPЗапрос(Адрес, Заголовки);
    Запрос.УстановитьИмяФайлаТела(ПутьКФайлу);    

    // POST
    Ответ               = Соединение.ОтправитьДляОбработки(Запрос);    

    // Разбор ответа
    Если Ответ.КодСостояния <> 200 Тогда 
        ВызватьИсключение СтрШаблон("Ошибка отправки вложения в телеграм.
            |Код состояния: %1
            |Тело: %2"
            , Ответ.КодСостояния
            , Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8)
        ); 
    КонецЕсли;
    
    //УдалитьФайлы(ПутьКФайлу);
КонецПроцедуры // ОтправитьВложениеВТелеграм()
//************************************************************
Функция ПолучитьСоединение()    
    
    // ПРОКСИ +
	ПроксиПротокол          = "https"; // пустая строка или неопределено - прокси не используются, для socks5 - https
	ПроксиСервер            = "socks5://196.18.3.247";//"77.83.28.64"; // socks5://domain.tld
	ПроксиПорт              = 8000; // 1080
	ПроксиПользователь      = "0Xxzs5";//"FdnM87"; // user
	ПроксиПароль            = "AsC6jy";//"mS7qND"; // password 

    Прокси      = Новый ИнтернетПрокси(Истина);
    Если ТипЗнч(ПроксиПротокол) = Тип("Строка") И Не ПустаяСтрока(ПроксиПротокол) Тогда
        Прокси.Установить(ПроксиПротокол, ПроксиСервер, ПроксиПорт, ПроксиПользователь, ПроксиПароль, Ложь);
    КонецЕсли;
	
	SSL         = Новый ЗащищенноеСоединениеOpenSSL();
    
    Соединение = Новый HTTPСоединение("api.telegram.org",443 , , , , , Новый ЗащищенноеСоединениеOpenSSL, );
   
    
    Возврат Соединение;
КонецФункции // ПолучитьСоединение()

#КонецОбласти
//////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////
#Область Вспомогательные_функции

Функция ПолучитьОписаниеCSS()
	Возврат "<!DOCTYPE HTML PUBLIC ""-//W3C//DTD HTML 4.01//EN"" 
    |  ""http://www.w3.org/TR/html4/strict.dtd"">
    |<html>
    |  <head>
    |    <meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"">
    |    <title>Журнал регистрации</title>
    |    <style>      
    |      .container {
    |        margin: 0 auto;
    |        width: 100%;
    |      }

    |      @media only screen and (min-width: 601px) {
    |        .container {
    |          width: 95%;
    |        }
    |      }

    |      @media only screen and (min-width: 993px) {
    |        .container {
    |          width: 90%;
    |        }
    |      }
    |      .deep-orange {
    |        background-color: #ff5722 !important;
    |      }
    |      
    |      table, th, td {
    |        border: none;
    |      }

    |      table {
    |        width: 100%;
    |        display: table;
    |        border-collapse: collapse;
    |        border-spacing: 0;
    |      }

    |      table.striped tr {
    |        border-bottom: none;
    |      }

    |      table.striped > tbody > tr:nth-child(odd) {
    |        background-color: rgba(242, 242, 242, 0.5);
    |      }

    |      table.striped > tbody > tr > td {
    |        border-radius: 0;
    |      }

    |      table.highlight > tbody > tr {
    |        -webkit-transition: background-color .25s ease;
    |        transition: background-color .25s ease;
    |      }

    |      table.highlight > tbody > tr:hover {
    |        background-color: rgba(255, 87, 34, 0.5);
    |      }

    |      table.centered thead tr th {
    |        text-align: center;
    |      }

    |      tr {
    |        border-bottom: 1px solid rgba(0, 0, 0, 0.12);
    |      }

    |      td, th {
    |        padding: 15px 5px;
    |        display: table-cell;
    |        text-align: left;
    |        vertical-align: middle;
    |        border-radius: 2px;
    |      }

    |      @media only screen and (max-width: 992px) {
    |        table.responsive-table {
    |          width: 100%;
    |          border-collapse: collapse;
    |          border-spacing: 0;
    |          display: block;
    |          position: relative;
    |          /* sort out borders */
    |        }
    |        table.responsive-table td:empty:before {
    |          content: '\00a0';
    |        }
    |        table.responsive-table th,
    |        table.responsive-table td {
    |          margin: 0;
    |          vertical-align: top;
    |        }
    |        table.responsive-table th {
    |          text-align: left;
    |        }
    |        table.responsive-table thead {
    |          display: block;
    |          float: left;
    |        }
    |        table.responsive-table thead tr {
    |          display: block;
    |          padding: 0 10px 0 0;
    |        }
    |        table.responsive-table thead tr th::before {
    |          content: ""\00a0"";
    |        }
    |        table.responsive-table tbody {
    |          display: block;
    |          width: auto;
    |          position: relative;
    |          overflow-x: auto;
    |          white-space: nowrap;
    |        }
    |        table.responsive-table tbody tr {
    |          display: inline-block;
    |          vertical-align: top;
    |        }
    |        table.responsive-table th {
    |          display: block;
    |          text-align: right;
    |        }
    |        table.responsive-table td {
    |          display: block;
    |          min-height: 1.25em;
    |          text-align: left;
    |        }
    |        table.responsive-table tr {
    |          border-bottom: none;
    |          padding: 0 10px;
    |        }
    |        table.responsive-table thead {
    |          border: 0;
    |          border-right: 1px solid rgba(0, 0, 0, 0.12);
    |        }

    |        table span.badge {
    |          display: inline-block;
    |          float: none;
    |          margin-left: auto;
    |        } 
    |      }
    |      
    |        h1, h2, h3, h4, h5, h6 {
    |          font-weight: 400;
    |          line-height: 1.3;
    |        }
    |        
    |        h1 a, h2 a, h3 a, h4 a, h5 a, h6 a {
    |          font-weight: inherit;
    |        }

    |        h3 {
    |          font-size: 0.75rem;
    |          line-height: 75%;
    |          margin: 1.9466666667rem 0 1.168rem 0;
    |        }
    |        
    |        .right-align {
    |          text-align: right;
    |        }

    |        .right {
    |          float: right !important;
    |        }
    |             
    |        .tooltip {
    |          border-bottom: 1px dotted #000000;
    |          color: #000000; outline: none;
    |          cursor: help; text-decoration: none;
    |          position: relative;
    |        }        
    |        .tooltip span {
    |          margin-left: -999em;
    |          position: absolute;
    |        }        
    |        .tooltip:hover span {
    |          font-family: Calibri, Tahoma, Geneva, sans-serif;
    |          position: absolute;
    |          left: 1em;
    |          top: 2em;
    |          z-index: 99;
    |          margin-left: 0; 
    |          overflow-wrap: break-word;  /* не поддерживает IE, Firefox; является копией word-wrap */ 
    |          word-wrap: break-word;
    |          word-break: normal;  /* не поддерживает Opera12.14, значение keep-all не поддерживается IE, Chrome */ 
    |          line-break: auto;  /* нет поддержки для русского языка */ 
    |          hyphens: manual;  /* значение auto не поддерживается Chrome */ 
    |          width: 500px;
    |        }
    |        .tooltip:hover img {
    |          border: 0;
    |          margin: -10px 0 0 -55px;
    |          float: left;
    |          position: absolute;
    |        }
    |        .tooltip:hover em {
    |          font-family: Candara, Tahoma, Geneva, sans-serif;
    |          font-size: 1.2em;
    |          font-weight: bold;   Функ
    |          display: block;
    |          padding: 0.2em 0 0.6em 0;
    |        }
    |        .classic { 
    |            padding: 0.8em 1em;
    |            border-radius: 5px 5px;
    |            background: #FFFFAA; border: 1px solid #FFAD33;
    |            -moz-border-radius: 5px;
    |            -webkit-border-radius: 5px;
    |            box-shadow: 5px 5px 5px rgba(0, 0, 0, 0.1);
    |            -webkit-box-shadow: 5px 5px rgba(0, 0, 0, 0.1);
    |            -moz-box-shadow: 5px 5px rgba(0, 0, 0, 0.1); 
    |        }
    |        .custom { padding: 0.5em 0.8em 0.8em 2em; }
    |        * html a:hover { background: transparent; }        
    |    </style>
    |  </head>
    |  <body>
    |    <div class=""container"">
    |      <h3 id=""information"">Информация</h3>      
    |      <table class=""highlight striped centered"" width=""100%"" height=""100%"">
    |        <caption></caption>
    |        <thead>
    |          <tr>
    |            <th scope=""col"" width=""120px"">Время</th>
    |            <th scope=""col"">Компьютер / Приложение / Пользователь</th>
    |            <th scope=""col"">Событие / Метаданные / Данные</th>
    |          </tr>
    |        </thead>
    |        <tbody id=""events"">
    |          <!--ТелоТаблицы-->
    |        </tbody>
    |      </table>
    |      </br>
    |      <p style=""padding: 75px 0;"">&nbsp;</p>
    |    </div>
    |  </body>
    |</html>";
    
КонецФункции
 
Процедура ОшибкаРегламентногоЗадания(ОписаниеОшибки)    
    ОписаниеОшибки  = СтрШаблон("Ошибка регламентной отправки журнала регистрации.
    |Описание ошибки: %1", ОписаниеОшибки);
    ЗаписьЖурналаРегистрации("Отправка в Telegram" 
        , УровеньЖурналаРегистрации.Ошибка
        , Неопределено
        , Неопределено
        , ОписаниеОшибки);
    Сообщение       = Новый СообщениеПользователю;
    Сообщение.Текст = ОписаниеОшибки;
    Сообщение.Сообщить();
    ВызватьИсключение ОписаниеОшибки;
    Возврат;
КонецПроцедуры // ОшибкаРегламентногоЗадания()
//************************************************************
Функция ПреобразоватьТекстВДом(Текст)
   ЧтениеHTML       = Новый ЧтениеHTML;
   ЧтениеHTML.УстановитьСтроку(Текст);
   ПостроительDOM   = Новый ПостроительDOM;
   Возврат ПостроительDOM.Прочитать(ЧтениеHTML);
КонецФункции // ПреобразоватьТекстВДом()
//************************************************************
Функция ПреобразоватьДомВТекст(ЭлементДом)
    ЗаписьDOM   = Новый ЗаписьDOM; 
    ЗаписьHTML  = Новый ЗаписьHTML;
    ЗаписьHTML.УстановитьСтроку(); 
    ЗаписьDOM.Записать(ЭлементДом, ЗаписьHTML);
    Возврат ЗаписьHTML.Закрыть();
КонецФункции // ПреобразоватьДомВТекст()

#КонецОбласти


#КонецОбласти  

Процедура ЗагрузитьПорциюЦенВРегистр(ТаблицаЦен, ИндексНачала, РазмерПорции, ДатаПериода, ДокСсылка) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокСсылка);
	
	Для Сч = 1 По РазмерПорции Цикл

        Индекс = ?(Сч=1, ИндексНачала, Индекс+1);
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ДатаПериода;
		ЗаполнитьЗначенияСвойств(Запись, ТаблицаЦен[Индекс], "Номенклатура, Характеристика, ВидЦены, Цена, Валюта, Упаковка");
	КонецЦикла;  
	
	ИмяСобытия = "Загрузка цен в потоке";
	Попытка
		НаборЗаписей.Записать(Ложь);
	Исключение  
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия,
		УровеньЖурналаРегистрации.Ошибка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),,Истина);
		ВызватьИсключение
		"Ошибка в потоке. ИндексНачала=" + ИндексНачала
		+ ", РазмерПорции=" + РазмерПорции
		+ ", Текст=" + ОписаниеОшибки();	
	КонецПопытки;
	
КонецПроцедуры




