
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура ba_ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка)

	//++ Локализация
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);

	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ЧекККМ") Тогда
		ЧекККМЛокализация.ПроверитьВозможностьВводаНаОсновании(ДанныеЗаполнения);
		#Вставка
		//babochka++    
		Если ТипЗнч(Объект) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
			Документы.ВозвратТоваровОтКлиента.ЗаполнитьШтрихкодыУпаковокТоваровЧекККМ(ДанныеЗаполнения, Объект);
		КонецЕсли;
		//babochka--
		#КонецВставки
		ЗаполнитьДокументНаОснованииЧекаККМ(
		Объект,
		ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ВходящаяТранспортнаяОперацияВЕТИС") Тогда

		ИнтеграцияВЕТИСУТ.ЗаполнитьВозвратТоваровОтКлиентаНаОснованииВходящейТранспортнойОперацииВЕТИС(Объект, ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ПриемкаТоваровИСМП") Тогда

		ИнтеграцияИСМПУТ.ЗаполнитьВозвратТоваровОтКлиентаНаОснованииПриемкиТоваровИСМП(Объект, ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ПогашениеСДИЗЗЕРНО") Тогда

		ИнтеграцияЗЕРНОУТ.ЗаполнитьВозвратТоваровОтКлиентаНаОснованииПогашенияСДИЗЗЕРНО(Объект, ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.НакладнаяСАТУРН") Тогда

		ИнтеграцияСАТУРНУТ.ЗаполнитьВозвратТоваровОтКлиентаНаОснованииНакладнаяСАТУРН(Объект, ДанныеЗаполнения);

	КонецЕсли;
	//-- Локализация

КонецПроцедуры