&НаСервереБезКонтекста
Функция СчетИМ()
	Возврат Справочники.БанковскиеСчетаОрганизаций.НайтиПоНаименованию("ИМ");
КонецФункции

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура BG_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.ТипОплатыИМ.Видимость = Объект.ОплатаИМ;
	Элементы.ТипПлатежногоДокумента.Видимость = Не Объект.ОплатаИМ;
	Элементы.ГруппаПроведеноБанком.Видимость = Не Объект.ОплатаИМ;
	Элементы.БанковскийСчет.Видимость = Не Объект.ОплатаИМ;
	Элементы.ГруппаПеречислениеВБюджет.Видимость = Не Объект.ОплатаИМ;
КонецПроцедуры

&НаКлиенте
Процедура BG_ОплатаИМПриИзмененииПосле(Элемент)
	Элементы.ТипОплатыИМ.Видимость = Объект.ОплатаИМ;
	Элементы.ТипПлатежногоДокумента.Видимость = Не Объект.ОплатаИМ;
	Элементы.ГруппаПроведеноБанком.Видимость = Не Объект.ОплатаИМ;
	Элементы.БанковскийСчет.Видимость = Истина;
	Элементы.ГруппаПеречислениеВБюджет.Видимость = Не Объект.ОплатаИМ;

	Объект.ТипПлатежногоДокумента = ПредопределенноеЗначение("Перечисление.ТипыПлатежныхДокументов.ПлатежноеПоручение");
	Объект.ПроведеноБанком = Истина;
	Объект.ДатаПроведенияБанком = ?(Объект.Дата = Дата("00010101"), ТекущаяДата(), Объект.Дата);
	Объект.НомерВходящегоДокумента = 1;
	Объект.ДатаВходящегоДокумента = ?(Объект.Дата = Дата("00010101"), ТекущаяДата(), Объект.Дата);
	Объект.БанковскийСчет = СчетИМ();
	Объект.ОплатаПоЗаявкам = Ложь;
КонецПроцедуры

#КонецОбласти
