функция счетИМ();
	возврат справочники.БанковскиеСчетаОрганизаций.НайтиПоНаименованию("ИМ");
конецфункции

&НаСервере
Процедура BG_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//вера  для удобства ИМ
	элементы.ТипОплатыИМ.Видимость = объект.ОплатаИМ;
	элементы.ТипПлатежногоДокумента.Видимость = не объект.ОплатаИМ;
	элементы.ГруппаПроведеноБанком.Видимость = не объект.ОплатаИМ;
	элементы.БанковскийСчет.Видимость = не объект.ОплатаИМ;
	элементы.ГруппаПеречислениеВБюджет.Видимость = не объект.ОплатаИМ;
	//\\
КонецПроцедуры

&НаКлиенте
Процедура BG_ОплатаИМПриИзмененииПосле(Элемент)
	элементы.ТипОплатыИМ.Видимость = объект.ОплатаИМ; 
	элементы.ТипПлатежногоДокумента.Видимость = не объект.ОплатаИМ;
	элементы.ГруппаПроведеноБанком.Видимость = не объект.ОплатаИМ;
	элементы.БанковскийСчет.Видимость = Истина;//не объект.ОплатаИМ;
	элементы.ГруппаПеречислениеВБюджет.Видимость = не объект.ОплатаИМ;
	Объект.ТипПлатежногоДокумента = предопределенноезначение("Перечисление.ТипыПлатежныхДокументов.ПлатежноеПоручение");
	объект.ПроведеноБанком = истина;
	объект.ДатаПроведенияБанком = ?(объект.дата = дата("00010101"), текущаядата(),объект.дата);
	объект.НомерВходящегоДокумента = 1;
	Объект.ДатаВходящегоДокумента =?(объект.дата = дата("00010101"), текущаядата(),объект.дата);
	объект.БанковскийСчет = счетИМ();
	объект.ОплатаПоЗаявкам = ложь;
КонецПроцедуры
	