

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	МодификацияКонфигурацииПереопределяемый.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	УстановитьВидимостьДоставки();
	СДЭКТипДоставкиПриИзмененииНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ОтправлятьНаТестовыйСервер = ЭтоОтправкаНаТестовыйСервер();
	Если ОтправлятьНаТестовыйСервер Тогда
		URL = "api.edu.cdek.ru";  //Тестовый СДЭК
	Иначе
		URL = "api.cdek.ru";      //Рабочий СДЭК
	КонецЕсли; 
	ИнтервалДоставкиПоСПБПриИзменении(Неопределено); 
	УстановитьВидимостьПечати();

	//ИнтервалПриИзменении(Неопределено);
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ЭтоОтправкаНаТестовыйСервер()
	Возврат Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_ОтправкаНаТестовыйСервер", Истина);	
КонецФункции

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти 

#Область Служебные

#Область Заказы

&НаСервере
Процедура ДобавитьТоварыЗаказаСервер(Заказ)
	
	ДокО = РеквизитФормыВЗначение("Объект");
	ДокО.ДобавитьТоварыЗаказаСервер(Заказ);
	ЗначениеВРеквизитФормы(ДокО, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТоварыЗаказа()
	
	ТД = Элементы.Заказы.ТекущиеДанные;
	Если ТД <> Неопределено  Тогда
		ДобавитьТоварыЗаказаСервер(ТД.Заказ);
	КонецЕсли; 
	
	УстановитьОтборСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыЗаказПриИзменении(Элемент)
	
	ДобавитьТоварыЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДобавитьТоварыЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПередУдалением(Элемент, Отказ)
	
	ТД = Элементы.Заказы.ТекущиеДанные;
	ТекЗаказ = ТД.Заказ;
	Объект.АдресДоставки = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПослеУдаления(Элемент)

	Если Не ЗначениеЗаполнено(ТекЗаказ) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("Заказ", ТекЗаказ));
	Для каждого Строка Из МассивСтрок Цикл
		Объект.Товары.Удалить(Строка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрок()
	
	ВыделенныеСтроки = Элементы.Заказы.ВыделенныеСтроки;
	Если ВыделенныеСтроки = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	Если ВыделенныеСтроки.Количество() > 1 Тогда
		
		МассивЗаказов = Новый Массив;
		Для каждого Строка Из ВыделенныеСтроки Цикл
			СтрокаЗаказа = Объект.Заказы.Получить(Строка);
			Если СтрокаЗаказа <> Неопределено Тогда
				МассивЗаказов.Добавить(СтрокаЗаказа.Заказ);	
			КонецЕсли; 					
		КонецЦикла; 
		ОбработатьВыделениеСтрокЗаказа(МассивЗаказов);
		
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("ОтображатьСтроку", Истина);
		
		Возврат;
		
	КонецЕсли; 
	
	ТекущиеДанные = Элементы.Заказы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.Заказ) Тогда
			Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Заказ",ТекущиеДанные.Заказ);
		Иначе
			Элементы.Товары.ОтборСтрок = Неопределено;
		КонецЕсли;
	Иначе
		Элементы.Товары.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработатьВыделениеСтрокЗаказа(СписокЗаказов)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	 |	Таб.Номенклатура КАК Номенклатура,
	 |	Таб.Характеристика КАК Характеристика,
	 |	Таб.Упаковка КАК Упаковка,
	 |	Таб.КоличествоУпаковок КАК КоличествоУпаковок,
	 |	Таб.Количество КАК Количество,
	 |	Таб.Цена КАК Цена,
	 |	Таб.Сумма КАК Сумма,
	 |	Таб.СтавкаНДС КАК СтавкаНДС,
	 |	Таб.СуммаНДС КАК СуммаНДС,
	 |	Таб.СуммаСНДС КАК СуммаСНДС,
	 |	Таб.Заказ КАК Заказ,
	 |	Таб.НомерСтрокиЗаказа КАК НомерСтрокиЗаказа,
	 |	Таб.Отменено КАК Отменено,
	 |	ЛОЖЬ КАК ОтображатьСтроку
	 |ПОМЕСТИТЬ Данные
	 |ИЗ
	 |	&ТекТаб КАК Таб
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Данные.Заказ КАК Заказ
	 |ПОМЕСТИТЬ ЗаказыДляОтбора
	 |ИЗ
	 |	Данные КАК Данные
	 |ГДЕ
	 |	Данные.Заказ В(&СписокЗаказов)
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	Данные.Заказ
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Данные.Номенклатура КАК Номенклатура,
	 |	Данные.Характеристика КАК Характеристика,
	 |	Данные.Упаковка КАК Упаковка,
	 |	Данные.КоличествоУпаковок КАК КоличествоУпаковок,
	 |	Данные.Количество КАК Количество,
	 |	Данные.Цена КАК Цена,
	 |	Данные.Сумма КАК Сумма,
	 |	Данные.СтавкаНДС КАК СтавкаНДС,
	 |	Данные.СуммаНДС КАК СуммаНДС,
	 |	Данные.СуммаСНДС КАК СуммаСНДС,
	 |	Данные.Заказ КАК Заказ,
	 |	Данные.НомерСтрокиЗаказа КАК НомерСтрокиЗаказа,
	 |	Данные.Отменено КАК Отменено,
	 |	ВЫБОР
	 |		КОГДА ЗаказыДляОтбора.Заказ ЕСТЬ NULL
	 |			ТОГДА ЛОЖЬ
	 |		ИНАЧЕ ИСТИНА
	 |	КОНЕЦ КАК ОтображатьСтроку
	 |ИЗ
	 |	Данные КАК Данные
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыДляОтбора КАК ЗаказыДляОтбора
	 |		ПО Данные.Заказ = ЗаказыДляОтбора.Заказ";
	
	 Запрос.УстановитьПараметр("ТекТаб", Объект.Товары.Выгрузить());
	 Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);
	 Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	 
КонецФункции
 
&НаКлиенте
Процедура ЗаказыПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборСтрок();
	
КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура ОбщийПодбор(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПодобратьЗаказыЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Документ.ЗаявкаНаДоставку.Форма.Форма", , ЭтаФорма,,,,
				ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Функция ПодобратьЗаказыЗавершение(РезультатЗакрытия, Дополнительныепараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат 0;	
	КонецЕсли; 
	
	Если РезультатЗакрытия.Свойство("АдресВХРезультатЗакрытия") Тогда
		ОбщийПодборЗавершениеСервер(РезультатЗакрытия.АдресВХРезультатЗакрытия);
	КонецЕсли; 
	
	Модифицированность = Истина;
 	
КонецФункции

&НаСервере
Функция ОбщийПодборЗавершениеСервер(АдресВХ)
	
	РезультатЗакрытия = ПолучитьИзВременногоХранилища(АдресВХ);
	
	Для каждого Заказ Из РезультатЗакрытия Цикл
		
		МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("Заказ", Заказ));
		Для каждого Строка Из МассивСтрок Цикл
			Объект.Товары.Удалить(Строка);
		КонецЦикла;
		
		МассивСтрок = Объект.Заказы.НайтиСтроки(Новый Структура("Заказ", Заказ));
		Для каждого Строка Из МассивСтрок Цикл
			Объект.Заказы.Удалить(Строка);
		КонецЦикла;
		
		СтрокаЗаказ = Объект.Заказы.Добавить();
		СтрокаЗаказ.Заказ = Заказ;
		
		
		ДобавитьТоварыЗаказаСервер(Заказ);
		
	КонецЦикла; 
	
	Если Заказ <> Неопределено Тогда
		
		Если ТипЗнч(Заказ) <> Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			Объект.Партнер = Заказ.Партнер;
			Если НЕ ЗначениеЗаполнено(Объект.АдресДоставки) Тогда
				Объект.АдресДоставки = ПолучитьАдресИзПартнера();		
			КонецЕсли;
		КонецЕсли;
		Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Объект.НомерПоДаннымКлиента = Заказ.НомерПоДаннымКлиента;
		Иначе
			Объект.НомерПоДаннымКлиента = Заказ.Номер; 
		КонецЕсли;    	
		
	КонецЕсли;   
	
КонецФункции

Функция ПолучитьАдресИзПартнера()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартнерыКонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.Тип = &Тип
		|	И ПартнерыКонтактнаяИнформация.Вид = &Вид
		|	И ПартнерыКонтактнаяИнформация.Ссылка = &Партнер";
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресПартнера);
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;  
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Представление;	
	КонецЦикла;   
	
КонецФункции

&НаКлиенте
Процедура ИнтервалПриИзменении(Элемент)

	ВремяИнтервала = Объект.Интервал;
	ПозицияДвоеточия = СтрНайти(ВремяИнтервала, ":");
	Если Объект.Интервал = "" Тогда
		Возврат;	
	КонецЕсли;
	Объект.ВремяДоставкиС = Дата(Лев(ВремяИнтервала, ПозицияДвоеточия-1)); 
	Объект.ВремяДоставкиПо = Дата(Сред(ВремяИнтервала, ПозицияДвоеточия+1, СтрДлина(ВремяИнтервала)));
	
	Возврат; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортнаяКомпанияПриИзменении(Элемент)
	
	УстановитьВидимостьДоставки();
	УстановитьВидимостьПечати();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоставки()
	
	ЭтоСДЭК = Объект.ТранспортнаяКомпания = Перечисления.ТранспортныеКомпании.CDEK;
	Элементы.Доставка.Видимость = ЭтоСДЭК;
	
	ЭтоLPOST = Объект.ТранспортнаяКомпания = Перечисления.ТранспортныеКомпании.LPOST;
	Элементы.ДоставкаЛПост.Видимость = ЭтоLPOST;
	Элементы.ОкруглитьСумму.Видимость = ЭтоLPOST;
	Самовывоз = ЗначениеЗаполнено(Объект.ЛПостПунктВыдачи);
	Элементы.ЛПостПунктВыдачиЗаказа.Видимость = ЗначениеЗаполнено(Объект.ЛПостПунктВыдачи);

	ЭтоДоставкаBABOCHKA = Объект.ТранспортнаяКомпания = Перечисления.ТранспортныеКомпании.BABOCHKA;
	Элементы.Курьер.Видимость = ЭтоДоставкаBABOCHKA;
	Элементы.ГруппаСтатус.Видимость = ЭтоДоставкаBABOCHKA;
	Элементы.ГруппаПолучатель.Видимость = ЭтоДоставкаBABOCHKA;
	
КонецПроцедуры
 
&НаКлиенте
Процедура НаложенныйПлатежПриИзменении(Элемент)
	
	Если Объект.НаложенныйПлатеж Тогда
		Объект.СуммаНаложенногоПлатежа = Объект.Товары.Итог("Сумма");
	Иначе
		Объект.СуммаНаложенногоПлатежа = 0;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуСтрахования()
	
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Товары.Номенклатура КАК Номенклатура,
	//	|	Товары.Сумма КАК Сумма,
	//	|	Товары.Цена КАК Цена,
	//	|	Товары.Количество КАК Количество
	//	|ПОМЕСТИТЬ ВТТовары
	//	|ИЗ
	//	|	&Товары КАК Товары
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	СУММА(ВТТовары.Цена * ВТТовары.Количество) КАК Сумма
	//	|ИЗ
	//	|	ВТТовары КАК ВТТовары
	//	|ГДЕ
	//	|	ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры <> &Услуги";
	//
	//Запрос.УстановитьПараметр("Услуги", Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуги"));
	//Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить(, "Номенклатура, Сумма, Цена, Количество"));
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	Возврат Выборка.Сумма;
	//КонецЦикла;
	
	//Возврат 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА((ЗаказКлиентаТовары.Цена - ЗаказКлиентаТовары.СуммаАвтоматическойСкидки) * ЗаказКлиентаТовары.Количество) КАК Сумма,
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|	И НЕ ЗаказКлиентаТовары.Отменено
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Заказы[0].Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;		
	КонецЕсли;
	
	Возврат 0;  
	
КонецФункции

&НаКлиенте
Процедура СтраховатьГрузПриИзменении(Элемент)
	
	Если Объект.СтраховатьГруз Тогда
		Объект.СуммаСтрахования = ПолучитьСуммуСтрахования();
	Иначе 
		Объект.СуммаСтрахования = 0;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.СДЭКДопУслуги = Новый ХранилищеЗначения(ДопУслугиСДЭК);
	ТекущийОбъект.СДЭКДопУслугиВозвратнаяНакладная = Новый ХранилищеЗначения(ДопУслугиСДЭКВозвратнаяНакладная);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДопУслугиСДЭК = ТекущийОбъект.СДЭКДопУслуги.Получить();
	ДопУслугиСДЭКВозвратнаяНакладная = ТекущийОбъект.СДЭКДопУслугиВозвратнаяНакладная.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьЛогОбмена(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОснованиеОтбор", Параметры.Ключ);
	
	ОткрытьФорму(
		"Справочник.ЛогиОбменовСВнешнимиСистемами.Форма.ФормаСпискаДляОснования",
		ПараметрыОткрытия,
		ЭтаФорма,
		УникальныйИдентификатор,
		,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура КоличествоМестПриИзменении(Элемент)
	
	КоличествоМестПриИзмененииНаСервере(); 
 
КонецПроцедуры

&НаСервере
Функция КоличествоМестПриИзмененииНаСервере()

	Возврат 0; //хотят заполнять вручную, задача 37851
	
	Если Объект.КоличествоМест <= 1 Тогда
		Для каждого СтрокаТЧ Из Объект.Товары Цикл
			СтрокаТЧ.Место = 1;			
		КонецЦикла;
	Иначе
		КоличествоСтрок = Объект.Товары.Итог("Количество");
		РассчитанноеКолвоТовараВУпаковке = Цел(КоличествоСтрок/Объект.КоличествоМест)+1;
		КолвоТовараВУпаковке = РассчитанноеКолвоТовараВУпаковке;
		НомерМеста = 1;
		
		Для каждого СтрокаТЧ Из Объект.Товары Цикл
			Если КолвоТовараВУпаковке <= 0 Тогда
				КолвоТовараВУпаковке = РассчитанноеКолвоТовараВУпаковке;
				НомерМеста = НомерМеста + 1;
			КонецЕсли; 
			
			СтрокаТЧ.Место = НомерМеста;
			КолвоТовараВУпаковке = КолвоТовараВУпаковке - СтрокаТЧ.Количество;
			
		КонецЦикла;
		
	КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоляТК(Команда)
	
	//Объект.СтраховатьГруз = Истина;
	//СтраховатьГрузПриИзменении(Неопределено);
	
	ЗаполнитьПоляТКНаСервере();
	
	Если Объект.СтатусОплатыЗаказа = "Не оплачен" Тогда
		Объект.НаложенныйПлатеж = Истина;
		НаложенныйПлатежПриИзменении(Неопределено);
	Иначе
		Объект.НаложенныйПлатеж = Ложь;
		объект.СуммаНаложенногоПлатежа = 0;
	КонецЕсли; 
	
	Объект.КоличествоМест = 1;
	КоличествоМестПриИзменении(Неопределено);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляТКНаСервере()
	
	Если Объект.Заказы.Количество() > 1 Тогда
		Сообщить("Заполнение полей рассчитано для одного Заказа. Удалите лишние.");
		Возврат;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияЗаказовКлиентов.ПроцентОплаты КАК ПроцентОплаты
		|ИЗ
		|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
		|ГДЕ
		|	СостоянияЗаказовКлиентов.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Объект.Заказы[0].Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Объект.СтатусОплатыЗаказа = "Не оплачен";	
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.СтатусОплатыЗаказа = ?(Выборка.ПроцентОплаты>=100, "Оплачен", "Не оплачен");
	КонецЦикла;
	
	
	ОбъектРасчетов = Объект.Заказы[0].Заказ;
	Если ТипЗнч(ОбъектРасчетов) = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
		ИЛИ (ТипЗнч(ОбъектРасчетов) = Тип("ДокументСсылка.ЧекККМ") 
		И ОбъектРасчетов.Статус = Перечисления.СтатусыЧековККМ.Пробит) Тогда
		 
		Объект.СтатусОплатыЗаказа = "Оплачен";	
	КонецЕсли; 
	
	ТД = ТекущаяДата(); 
	ВремяТекущее = ТД - НачалоДня(ТД); 
	Если ВремяТекущее > 15*3600+15*60 Тогда   //Время > 15:15
		Объект.СДЭКДатаЗабораГруза = КонецДня(ТекущаяДата())+1;
		Объект.СДЭКВремяЗабораГрузаС = Дата(1,1,1) + 14*3600;
		Объект.СДЭКВремяЗабораГрузаПо = Дата(1,1,1) + 17*3600;
	Иначе
		Объект.СДЭКДатаЗабораГруза = НачалоДня(ТД);
		Объект.СДЭКВремяЗабораГрузаС = Дата(1,1,1) + Час(ТД)*3600 + 15*60;
		Объект.СДЭКВремяЗабораГрузаПо = Объект.СДЭКВремяЗабораГрузаС + 3*3600;
	КонецЕсли; 
	
	Доставка = Справочники.Номенклатура.НайтиПоКоду("Ц0000120605");
	НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Доставка));
	ЕстьДоставка = НайденныеСтроки.Количество() > 0;
	ЗаказОплачен = Объект.СтатусОплатыЗаказа = "Оплачен";
	
	Объект.ПримечаниеТК = "Частичная доставка Примерка, частичный выкуп, вежливый курьер.";
	
	СДЭК_Примечание = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_Примечание", "Оплата доставки ТОЛЬКО при выкупе менее 15000руб., вежливый курьер.");
	Если ЕстьДоставка И НЕ ЗаказОплачен Тогда
		Объект.ПримечаниеТК = СДЭК_Примечание;	
	КонецЕсли; 
	Если НЕ ЕстьДоставка И НЕ ЗаказОплачен Тогда
		Объект.ПримечаниеТК = "Вежливый курьер."	
	КонецЕсли; 
	Если ЗаказОплачен Тогда
		Объект.ПримечаниеТК = "Вежливый курьер, возможен частичный возврат."	
	КонецЕсли; 
	
		
	Объект.СДЭКВыбранныйТариф = Справочники.ТарифыСДЭКИМ.НайтиПоРеквизиту("КодТарифа", "136");
	Объект.СДЭКТипДоставки = Объект.СДЭКВыбранныйТариф.РежимДоставки;
	
	//++babochka тикет 48145
	//ИзменитьПримечаниеСДЭК();
    //--babochka
	
	ДопУслугиСДЭК.Очистить();
	ДополнительныеУслугиСДЭК = Справочники.ДополнительныеУслугиСДЭК;
	ДопУслугиСДЭК.Добавить(ДополнительныеУслугиСДЭК.НайтиПоРеквизиту("КодУслуги", "TRYING_ON"));
	
	Если Объект.Товары.Итог("Количество") > 1 Тогда
		
		ДопУслугиСДЭК.Добавить(ДополнительныеУслугиСДЭК.НайтиПоРеквизиту("КодУслуги", "PART_DELIV"));
		
	КонецЕсли; 
	
	//ДопУслугиСДЭК.Добавить(ДополнительныеУслугиСДЭК.НайтиПоРеквизиту("КодУслуги", "INSURANCE"));
	
	Если ЗначениеЗаполнено(Объект.АдресДоставки) Тогда
		Город = НайтиГородПоИндексуНаСервере();
	Иначе
		Город = Справочники.ГородаСДЭК.ПустаяСсылка();
	КонецЕсли;
	Если ЗначениеЗаполнено(Город) Тогда
		Объект.СДЭКГородДоставки = Город;	
	Иначе
		Адрес = Объект.АдресДоставки;
		ГородСтрокой ="";
		ГородСтрокой = НайтиГород(Адрес, "городской округ");
		
		Если ГородСтрокой = "" Тогда
			НачалоПоиска = СтрНайти(Адрес, "Россия");
			Если НачалоПоиска > 0 Тогда
				ГородСтрокой = Сред(Адрес, СтрНайти(Адрес," ",,НачалоПоиска,1)+1, СтрНайти(Адрес,",",,НачалоПоиска,2)-СтрНайти(Адрес," ",,НачалоПоиска,1)-1);
			КонецЕсли;
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ГородаСДЭК.Наименование КАК Наименование,
			|	ГородаСДЭК.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ГородаСДЭК КАК ГородаСДЭК
			|ГДЕ
			|	ГородаСДЭК.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", ГородСтрокой);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		КоличествоГородов = Выборка.Количество();
		
		Если КоличествоГородов > 1 Тогда
			Если ГородСтрокой = "Москва" Тогда
				Объект.СДЭКГородДоставки = Справочники.ГородаСДЭК.НайтиПоКоду("000005052");
			Иначе
				Сообщить("Найдено несколько городов в справочнике СДЭК для "+ГородСтрокой+", выберите город вручную");	
			КонецЕсли;
			 
		Иначе
			Если Выборка.Следующий() Тогда
				Объект.СДЭКГородДоставки = Выборка.Ссылка;	
			Иначе
				Сообщить("Город не найден, заполните вручную.");
				Объект.СДЭКГородДоставки = Справочники.ГородаСДЭК.ПустаяСсылка();
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Функция НайтиГородПоИндексуНаСервере()
	
	Город = Справочники.ГородаСДЭК.ПустаяСсылка();
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Объект.АдресДоставки," ");
	Индекс = "";
	Если МассивСтрок.Количество() Тогда
		Индекс = МассивСтрок[0];	
	КонецЕсли; 
	
	ТолькоЦифрыВСтроке = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Индекс);
	
	Если ТолькоЦифрыВСтроке Тогда
		
	    Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ГородаСДЭК.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ГородаСДЭК КАК ГородаСДЭК
			|ГДЕ
			|	ГородаСДЭК.Индексы ПОДОБНО &Индекс";
		
		Запрос.УстановитьПараметр("Индекс", "%"+Индекс+"%");
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Город = Выборка.Ссылка;	
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат Город;
	
КонецФункции

Функция НайтиГород(ИсходнаяСтрока, СтрокаИсправления)
    ГородСтрокой="";

	НачальнаяПозиция = СтрНайти(ИсходнаяСтрока, СтрокаИсправления);
	Если НачальнаяПозиция > 0 Тогда
		Если Прав(СтрокаИсправления, 1) = " " Тогда
			НачальнаяПозиция = НачальнаяПозиция-1;
		КонецЕсли; 
	
		ПозицияКонец = СтрНайти(ИсходнаяСтрока,",",,НачальнаяПозиция);
		ГородСтрокой = Сред(ИсходнаяСтрока, НачальнаяПозиция+1+СтрДлина(СтрокаИсправления), ПозицияКонец-НачальнаяПозиция-1-СтрДлина(СтрокаИсправления));
		
	КонецЕсли;

	Возврат ГородСтрокой;
	
КонецФункции

&НаСервере
Процедура СДЭКТипДоставкиПриИзмененииНаСервере()
	
	Если Объект.СДЭКТипДоставки = Перечисления._ТипыДоставки.ДверьСклад
		ИЛИ Объект.СДЭКТипДоставки = Перечисления._ТипыДоставки.ДоСклада Тогда
		Элементы.СДЭКПунктВыдачиЗаказа.Видимость = Истина;
	Иначе	
		Объект.СДЭКПунктВыдачиЗаказа = Справочники.ПунктыВыдачиЗаказовСДЭК.ПустаяСсылка();
		Элементы.СДЭКПунктВыдачиЗаказа.Видимость = Ложь;
	КонецЕсли;
	//ИзменитьПримечаниеСДЭК();
	
КонецПроцедуры

Функция ИзменитьПримечаниеСДЭК()
	
	//++babochka тикет 48145
	Если Объект.СДЭКТипДоставки = Перечисления._ТипыДоставки.ДоСклада Тогда
		Объект.ПримечаниеТК = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_ПримечаниеСкладСклад", "");	
	КонецЕсли;
    Если Объект.СДЭКТипДоставки = Перечисления._ТипыДоставки.ДверьСклад Тогда
		Объект.ПримечаниеТК = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_ПримечаниеСкладДверь", "");	
	КонецЕсли;
    //--babochka

КонецФункции

&НаКлиенте
Процедура СДЭКТипДоставкиПриИзменении(Элемент)
	СДЭКТипДоставкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВСДЭК(Команда)
	
	Если Модифицированность Тогда
		ЭтотОбъект.Записать();	
	КонецЕсли; 
	
	Если НЕ Объект.Проведен Тогда
		Сообщить("Проведите сначала документ!");
		Возврат;	
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Заявка", Объект.Ссылка);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОтправкаСДЭКЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Документ.ЗаявкаНаДоставку.Форма.ФормаОтправки", ПараметрыОткрытия, ЭтаФорма,,,,
				ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Функция ОтправкаСДЭКЗавершение(РезультатЗакрытия, Дополнительныепараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		Если РезультатЗакрытия.ЭтоОтправкаЗаказа Тогда
			Объект.СДЭКUuid = РезультатЗакрытия.Uuid;
			Объект.СДЭКНомер = РезультатЗакрытия.Номер;
			Объект.СтатусДоставкиТК = РезультатЗакрытия.СтатусДоставки;
		
		Иначе	
			Объект.СДЭКНомер = РезультатЗакрытия.Номер;
			Объект.СтатусДоставкиТК = РезультатЗакрытия.СтатусДоставки;
		
		КонецЕсли; 
		
	КонецЕсли; 
	
	ЭтаФорма.Прочитать();			
	
КонецФункции

&НаКлиенте
Процедура ДопУслугиСДЭКПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеТарифы(Команда)
	
	Если Модифицированность Тогда
		ЭтотОбъект.Записать();	
	КонецЕсли; 
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Заявка", Объект.Ссылка);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("РасчетТарифовЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Документ.ЗаявкаНаДоставку.Форма.ДоступныеТарифы", ПараметрыОткрытия, ЭтаФорма,,,,
				ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Функция РасчетТарифовЗавершение(РезультатЗакрытия, Дополнительныепараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(РезультатЗакрытия.ТарифВБазе) Тогда
			
			Объект.СДЭКВыбранныйТариф = РезультатЗакрытия.ТарифВБазе;
			Объект.СДЭКТипДоставки = ПолучитьТипДоставки(РезультатЗакрытия.ТарифВБазе);
			//ИзменитьПримечаниеСДЭК();
		КонецЕсли; 
		
		Модифицированность = Истина;			
	
	КонецЕсли; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТипДоставки(ТарифВБазе)
	Возврат ТарифВБазе.РежимДоставки;	
КонецФункции

&НаКлиенте
Процедура СДЭКПунктВыдачиЗаказаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    ПараметрыОткрытия = Новый Структура("Город", Объект.СДЭКГородДоставки);
    ОткрытьФорму("Справочник.ПунктыВыдачиЗаказовСДЭК.Форма.ФормаВыбора", ПараметрыОткрытия, Элемент);
    
КонецПроцедуры

#Область ОбменСДЭК

&НаСервере
Функция СериализацияЗначения(ЗначениеПараметра)
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("СписокXDTO")
		 Или ТипЗнч(ЗначениеПараметра) = Тип("ОбъектXDTO")
		 Или ТипЗнч(ЗначениеПараметра) = Тип("ЗначениеXDTO") Тогда
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ЗначениеПараметра);
		Результат = ЗаписьXML.Закрыть();
	Иначе
		Результат = XMLСтрока(ЗначениеПараметра);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьИЗаписатьЛог(Request, Response, ResponseСтрокой, ИмяМетода, НаименованиеЛога)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	Попытка
		ЗаписатьJSON(ЗаписьJSON, Response);
		ОтветСДЭК = ЗаписьJSON.Закрыть();
	Исключение
	    ОтветСДЭК = ResponseСтрокой;
	КонецПопытки; 
	
	
	ЗаписатьЛог(НаименованиеЛога, Request, ОтветСДЭК, ИмяМетода, Объект.Ссылка);
		
КонецФункции
 
Процедура ЗаписатьЛог(НаименованиеЛога, Request, Response, ИмяМетода, Основание)

	ЛогЗаписи = Справочники.ЛогиОбменовСВнешнимиСистемами.СоздатьЗапись(НаименованиеЛога);
	ЛогЗаписи.ДобавитьПараметр("Request", Request);
	ЛогЗаписи.ДобавитьПараметр("Response", Response);
	ЛогЗаписи.ТипДанных = ИмяМетода;
	ЛогЗаписи.Основание = Основание;
	ЛогЗаписи.Записать();   		

КонецПроцедуры

Процедура АвторизацияНаСервере()
	
	ОтправлятьНаТестовыйСервер = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_ОтправкаНаТестовыйСервер", Истина);
	
	Если ОтправлятьНаТестовыйСервер Тогда
		Account 	= "EMscd6r9JnFiQ3bLoyjJY6eM78JrJceI";//Константы._Account.Получить();
		Password 	= "PjLZkKBHEiLK3YsjtNrt3TGNG0ahs3kG"; //Константы._Secure_password.Получить();
		Grant_type 	= "client_credentials";
	Иначе	
		Account 	= Константы.СДЭКAccount.Получить();
		Password 	= Константы.СДЭКSecure_password.Получить();
		Grant_type 	= "client_credentials";
	КонецЕсли; 
	
	HTTPСоединение = Новый HTTPСоединение(URL, , , , , , Новый ЗащищенноеСоединениеOpenSSL(), );
	СтрокаПараметров = "grant_type="+Grant_type+"&client_id=" +Account+"&client_secret="+Password;
	HTTPЗапрос = Новый HTTPЗапрос("/v2/oauth/token?"+СтрокаПараметров);

	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);

	Поток = Ответ.ПолучитьТелоКакПоток();
	Кодировка = "utf-8"; 

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(Поток, Кодировка); 
	Результат = ПрочитатьJSON(ЧтениеJSON);
	Если ТипЗнч(Результат) = Тип("Структура") 
		И Результат.Свойство("access_token") Тогда
		
		Константы.СДЭКТокен.Установить(Результат.access_token);
		
	КонецЕсли; 

	ОтветСервера = Ответ.ПолучитьТелоКакСтроку("UTF-8"); // ЧтениеJSON.Закрыть();

КонецПроцедуры

&НаСервере
Функция ОбновитьСтатусНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.СДЭКUuid) Тогда
		Возврат Истина;	
	КонецЕсли; 
	
	Токен = "Bearer "+ Константы.СДЭКТокен.Получить();
		
	HTTPСоединение = Новый HTTPСоединение(URL, , , , , , Новый ЗащищенноеСоединениеOpenSSL(), );
	
	Метод = "/v2/orders/"+Объект.СДЭКUuid;
	HTTPЗапрос = Новый HTTPЗапрос(Метод);

	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен); 
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	Ответ = HTTPСоединение.Получить(HTTPЗапрос);

	Поток = Ответ.ПолучитьТелоКакПоток();
	Кодировка = "utf-8"; 

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(Поток, Кодировка); 
	Результат = ПрочитатьJSON(ЧтениеJSON);
	
	ОтветФункции = Ложь;
	
	Если ТипЗнч(Результат) = Тип("Структура") 
		И Результат.Свойство("entity") Тогда
		
		cdek_number = "";
		АктуальныйСтатус = "";
		
		entity = Результат.entity;
		
		Если ТипЗнч(entity) = Тип("Структура")
			И entity.Свойство("statuses") Тогда
			
			Для каждого Статус Из entity.statuses Цикл
				АктуальныйСтатус = Статус.name;
				СтатусДоставки = АктуальныйСтатус;
				Прервать;
			КонецЦикла;
			
			ОтветФункции = Истина;
		КонецЕсли; 
		
		Если АктуальныйСтатус <> "" 
			И Объект.СтатусДоставкиТК <> АктуальныйСтатус Тогда
			
			Объект.СтатусДоставкиТК = АктуальныйСтатус;
			
		КонецЕсли;
		
		Если entity.Свойство("delivery_detail") Тогда
			delivery_detail = entity.delivery_detail;
			Если ТипЗнч(delivery_detail) = Тип("Структура") 
				И delivery_detail.Свойство("total_sum") Тогда
				Объект.СуммаУслугСДЭК = delivery_detail.total_sum;
			КонецЕсли;
		КонецЕсли; 
		Вес = 0;
		Если entity.Свойство("packages") Тогда
			packages = entity.packages;
			Если ТипЗнч(packages) = Тип("Массив") Тогда
				Для каждого стр Из packages Цикл
					Вес = Вес + стр.weight_calc;	
				КонецЦикла; 	
			КонецЕсли; 
			Объект.ВесПриОтправке = Вес;
		КонецЕсли; 
		
		Если Результат.Свойство("related_entities") Тогда
			related_entities = Результат.related_entities;
			Если ТипЗнч(related_entities) = Тип("Массив") Тогда
				Для каждого стр Из related_entities Цикл
					Если стр.Свойство("cdek_number") Тогда
						//Объект.НомерВозвратаСДЭК = стр.cdek_number;
						ОбновитьИнформациюПоВозврату(Объект.НомерВозвратаСДЭК);
					КонецЕсли; 	
				КонецЦикла; 	
			КонецЕсли;
		КонецЕсли;
				
	КонецЕсли; 
	Если ТипЗнч(Результат) = Тип("Структура") 
		И Результат.Свойство("requests") Тогда
		
		request = Результат.requests[0];
		Если request.state = "INVALID"
			И request.type = "AUTH" Тогда
			АвторизацияНаСервере();
		КонецЕсли; 
		
	КонецЕсли; 
	
	ОтветСервера = Ответ.ПолучитьТелоКакСтроку("UTF-8");
	
	Request = СериализацияЗначения("URL: "+URL+"/"+Метод);
    ПреобразоватьИЗаписатьЛог(Request, Результат, ОтветСервера, "СДЭК Информация по заказу", "Заявка "+Объект.Номер);

	Возврат ОтветФункции;
	
КонецФункции

Функция ОбновитьИнформациюПоВозврату(cdek_number)
	
	Если НЕ ЗначениеЗаполнено(cdek_number) Тогда
		Возврат Истина;	
	КонецЕсли; 
	
	Токен = "Bearer "+ Константы.СДЭКТокен.Получить();
		
	HTTPСоединение = Новый HTTPСоединение(URL, , , , , , Новый ЗащищенноеСоединениеOpenSSL(), );
	
	Метод = "/v2/orders?cdek_number="+cdek_number;
	HTTPЗапрос = Новый HTTPЗапрос(Метод);

	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен); 
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	Ответ = HTTPСоединение.Получить(HTTPЗапрос);

	Поток = Ответ.ПолучитьТелоКакПоток();
	Кодировка = "utf-8"; 

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(Поток, Кодировка); 
	Результат = ПрочитатьJSON(ЧтениеJSON);
	
	ОтветФункции = Ложь;
	
	Если ТипЗнч(Результат) = Тип("Структура") 
		И Результат.Свойство("entity") Тогда
		
		//cdek_number = "";
		АктуальныйСтатус = "";
		
		entity = Результат.entity;
		
		Если ТипЗнч(entity) = Тип("Структура")
			И entity.Свойство("statuses") Тогда
			
			Для каждого Статус Из entity.statuses Цикл
				АктуальныйСтатус = Статус.name;
				СтатусДоставки = АктуальныйСтатус;
			КонецЦикла;
			
			ОтветФункции = Истина;
		КонецЕсли; 
		
		Если entity.Свойство("delivery_detail") Тогда
			delivery_detail = entity.delivery_detail;
			Если ТипЗнч(delivery_detail) = Тип("Структура") 
				И delivery_detail.Свойство("total_sum") Тогда
				
				Объект.СуммаУслугВозвратСДЭК = delivery_detail.total_sum;
				Объект.СуммаУслугСДЭК = Объект.СуммаУслугСДЭК + Объект.СуммаУслугВозвратСДЭК;
				
			КонецЕсли;
		КонецЕсли; 
		
		Вес = 0;
		Если entity.Свойство("packages") Тогда
			packages = entity.packages;
			Если ТипЗнч(packages) = Тип("Массив") Тогда
				Для каждого стр Из packages Цикл
					Вес = Вес + стр.weight_calc;	
				КонецЦикла; 	
			КонецЕсли; 
			
			Объект.ВесВозврата = Вес;
			
		КонецЕсли; 
		
		Если АктуальныйСтатус <> "" 
			И Объект.СтатусДоставкиВозвратТК <> АктуальныйСтатус Тогда
			
			Объект.СтатусДоставкиВозвратТК = АктуальныйСтатус;
			
		КонецЕсли; 
	КонецЕсли;
	
	Возврат ОтветФункции;
	
КонецФункции
 
&НаКлиенте
Процедура ОбновитьСтатус(Команда)
	
	Ответ = ОбновитьСтатусНаСервере();
	Если НЕ Ответ Тогда
		ОбновитьСтатусНаСервере();	
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СДЭКВызовКурьераПриИзменении(Элемент)
	
	Если Модифицированность Тогда
		ЭтотОбъект.Записать();	
	КонецЕсли; 
	
	Если НЕ Объект.Проведен Тогда
		Сообщить("Проведите сначала документ!");
		Возврат;	
	КонецЕсли;
	
	Если НЕ Объект.СДЭКВызовКурьера Тогда
		Возврат;	
	КонецЕсли; 
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Заявка", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("ЭтоВызовКурьера", Истина);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОтправкаСДЭККурьерЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Документ.ЗаявкаНаДоставку.Форма.ФормаОтправки", ПараметрыОткрытия, ЭтаФорма,,,,
				ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Функция ОтправкаСДЭККурьерЗавершение(РезультатЗакрытия, Дополнительныепараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		Объект.СДЭКНомерЗаявкиКурьера = РезультатЗакрытия.НомерЗаявкиКурьера;
		Если Объект.СДЭКНомерЗаявкиКурьера <> "" Тогда
			Объект.СДЭКЗаявкаНаВызовКурьераОтправлена = Истина;
		КонецЕсли;
		
	КонецЕсли; 
	
	ЭтаФорма.Прочитать();			
	
КонецФункции

&НаКлиенте
Процедура СДЭКАдресВозвратнойНакладнойПриИзменении(Элемент)
	
	ИмяРеквизитаАдресаДоставки = ПолучитьИмяРеквизитаАдресаДоставки(Элемент);
	
	ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
	    Элемент,
		Объект[ИмяРеквизитаАдресаДоставки],
		Объект[ИмяРеквизитаАдресаДоставки + "ЗначенияПолей"]);
	
КонецПроцедуры

&НаКлиенте
Процедура СДЭКАдресВозвратнойНакладнойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяРеквизитаАдресаДоставки = ПолучитьИмяРеквизитаАдресаДоставки(Элемент);
	
	ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	    Элемент,
		Объект,
		ИмяРеквизитаАдресаДоставки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СДЭКАдресВозвратнойНакладнойОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СДЭКАдресВозвратнойНакладнойПриИзменении(Элемент);
	
	ДоставкаТоваровКлиент.АдресДоставкиОбработкаВыбора(Элементы, Объект, Элемент.Имя, ВыбранноеЗначение);
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СДЭКАдресВозвратнойНакладнойОчистка(Элемент, СтандартнаяОбработка)
	
	ИмяРеквизитаАдресаДоставки = ПолучитьИмяРеквизитаАдресаДоставки(Элемент);
	
	ДоставкаТоваровКлиент.ОчиститьПредставлениеАдреса(
		Объект[ИмяРеквизитаАдресаДоставки],
		Объект[ИмяРеквизитаАдресаДоставки + "ЗначенияПолей"],
		Объект[ИмяРеквизитаАдресаДоставки + "Значение"]);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяРеквизитаАдресаДоставки(Элемент)
	
	Возврат "СДЭКАдресВозвратнойНакладной";
	
КонецФункции

&НаКлиенте
Процедура ОтправитьВСДЭКВозврат(Команда)
	
	Если Модифицированность Тогда
		ЭтотОбъект.Записать();	
	КонецЕсли; 
	
	Если НЕ Объект.Проведен Тогда
		Сообщить("Проведите сначала документ!");
		Возврат;	
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Заявка", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("ЭтоОтправкаВозврата", Истина);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОтправкаСДЭКВозвратЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Документ.ЗаявкаНаДоставку.Форма.ФормаОтправки", ПараметрыОткрытия, ЭтаФорма,,,,
				ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Функция ОтправкаСДЭКВозвратЗавершение(РезультатЗакрытия, Дополнительныепараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		Объект.НомерВозвратаСДЭК = РезультатЗакрытия.НомерЗаявкиКурьера;
		Объект.СтатусДоставкиВозвратТК = РезультатЗакрытия.СтатусДоставкиВозврат;
		
	КонецЕсли; 
	
	ЭтаФорма.Прочитать();			
	
КонецФункции

&НаКлиенте
Процедура ДоступныеТарифыВозврат(Команда)
	
	Если Модифицированность Тогда
		ЭтотОбъект.Записать();	
	КонецЕсли; 
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Заявка", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("ЭтоВозврат", Истина);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("РасчетТарифовЗавершениеВозврат", ЭтаФорма);
	
	ОткрытьФорму("Документ.ЗаявкаНаДоставку.Форма.ДоступныеТарифы", ПараметрыОткрытия, ЭтаФорма,,,,
				ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Функция РасчетТарифовЗавершениеВозврат(РезультатЗакрытия, Дополнительныепараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(РезультатЗакрытия.ТарифВБазе) Тогда
			
			Объект.СДЭКВыбранныйТарифВозвратнаяНакладная = РезультатЗакрытия.ТарифВБазе;
			
		КонецЕсли; 
		
		Модифицированность = Истина;			
	
	КонецЕсли; 
	
КонецФункции

#КонецОбласти 

#КонецОбласти


#Область ЛПост
&НаКлиенте
Процедура ОтправитьЛПост(Команда)
	
	Если Модифицированность Тогда
		ЭтотОбъект.Записать();	
	КонецЕсли; 
	
	Если НЕ Объект.Проведен Тогда
		Сообщить("Проведите сначала документ!");
		Возврат;	
	КонецЕсли;
	
	ЕстьОшибкиМаркировки = ПроверитьНаОшибкиЗаполненияМаркировки(Объект.Ссылка);
	Если ЕстьОшибкиМаркировки Тогда  
		Сообщить("В заявке есть строка с маркировкой и количеством больше 1!
				 |Разбейте строку и заполните маркировку");
		Возврат;	
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Заявка", Объект.Ссылка);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОтправкаЛПостЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Обработка.ОбменLPost.Форма.ФормаОтправкиLPost", ПараметрыОткрытия, ЭтаФорма,,,,
				ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНаОшибкиЗаполненияМаркировки(Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаДоставкуТовары.Количество КАК Количество
		|ИЗ
		|	Документ.ЗаявкаНаДоставку.Товары КАК ЗаявкаНаДоставкуТовары
		|ГДЕ
		|	ЗаявкаНаДоставкуТовары.Маркировка <> """"
		|	И ЗаявкаНаДоставкуТовары.Количество > 1
		|	И ЗаявкаНаДоставкуТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	
	Возврат НЕ Запрос.Выполнить().Пустой(); 
	
КонецФункции

&НаКлиенте
Функция ОтправкаЛПостЗавершение(РезультатЗакрытия, Дополнительныепараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		Объект.НомерТК = РезультатЗакрытия.НомерТК;
		Объект.СсылкаНаЭтикетку = РезультатЗакрытия.СсылкаНаЭтикетку;
			 
	КонецЕсли; 
	
	ЭтаФорма.Прочитать();			
	
КонецФункции

&НаСервере
Процедура ОбновитьСтатусЛПостНаСервере()
	Обработки.ОбменLPost.ОбновитьСтатусОтправления(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусЛПост(Команда)
	
	Если Модифицированность Тогда
		ЭтотОбъект.Записать();	
	КонецЕсли; 
	
	ОбновитьСтатусЛПостНаСервере();
	ЭтаФорма.Прочитать();			
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПоляЛПостТКНаСервере()
	
	Если Объект.Заказы.Количество() > 1 Тогда
		Сообщить("Заполнение полей рассчитано для одного Заказа. Удалите лишние.");
		Возврат 0;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияЗаказовКлиентов.ПроцентОплаты КАК ПроцентОплаты
		|ИЗ
		|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
		|ГДЕ
		|	СостоянияЗаказовКлиентов.Заказ = &Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ПартнерыКонтактнаяИнформация.НомерТелефона) КАК НомерТелефона,
		|	ПартнерыКонтактнаяИнформация.Ссылка КАК Партнер
		|ПОМЕСТИТЬ ТелефонКлиента
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.Ссылка = &Партнер
		|	И ПартнерыКонтактнаяИнформация.Тип = &Тип
		|	И ПартнерыКонтактнаяИнформация.Вид = &Вид
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартнерыКонтактнаяИнформация.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПартнерыКонтактнаяИнформация.Ссылка КАК Партнер,
		|	ПартнерыКонтактнаяИнформация.АдресЭП КАК АдресЭП
		|ПОМЕСТИТЬ АдресЭПКлиента
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.Ссылка = &Партнер
		|	И ПартнерыКонтактнаяИнформация.Тип = &ТипЭлПочта
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартнерыКонтактнаяИнформация.Ссылка,
		|	ПартнерыКонтактнаяИнформация.АдресЭП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(АдресЭПКлиента.АдресЭП, """") КАК АдресЭП,
		|	ЕСТЬNULL(ТелефонКлиента.НомерТелефона, """") КАК НомерТелефона,
		|	Партнеры.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ АдресЭПКлиента КАК АдресЭПКлиента
		|		ПО Партнеры.Ссылка = АдресЭПКлиента.Партнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТелефонКлиента КАК ТелефонКлиента
		|		ПО Партнеры.Ссылка = ТелефонКлиента.Партнер
		|ГДЕ
		|	Партнеры.Ссылка = &Партнер";
	
	Запрос.УстановитьПараметр("Заказ", Объект.Заказы[0].Заказ);
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
    Запрос.УстановитьПараметр("ТипЭлПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[0].Пустой() Тогда
		Объект.СтатусОплатыЗаказа = "Не оплачен";	
	КонецЕсли; 
	
	Выборка = РезультатЗапроса[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.СтатусОплатыЗаказа = ?(Выборка.ПроцентОплаты>=100, "Оплачен", "Не оплачен");
	КонецЦикла;
	
	ВыборкаКИ = РезультатЗапроса[3].Выбрать();
	Если ВыборкаКИ.Следующий() Тогда
		Объект.ПолучательФИО = ВыборкаКИ.Наименование;
        Объект.ТелефонПолучателя = ВыборкаКИ.НомерТелефона;
		Объект.EmailПолучателя = ВыборкаКИ.АдресЭП;
    КонецЕсли;
    	
	ОбъектРасчетов = Объект.Заказы[0].Заказ;
	Если ТипЗнч(ОбъектРасчетов) = Тип("ДокументСсылка.ЧекККМ") 
		И ОбъектРасчетов.Статус = Перечисления.СтатусыЧековККМ.Пробит Тогда
		Объект.СтатусОплатыЗаказа = "Оплачен";	
	КонецЕсли; 
	
	Доставка = Справочники.Номенклатура.НайтиПоКоду("Ц0000120605");
	НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Доставка));
	ЕстьДоставка = НайденныеСтроки.Количество() > 0;
	ЗаказОплачен = Объект.СтатусОплатыЗаказа = "Оплачен";
	
	Адрес = Объект.АдресДоставки;
	ГородСтрокой ="";
	ГородСтрокой = НайтиГород(Адрес, "городской округ");
	
	Если ГородСтрокой = "" Тогда
		НачалоПоиска = СтрНайти(Адрес, "Россия");
		Если НачалоПоиска > 0 Тогда
			ГородСтрокой = Сред(Адрес, СтрНайти(Адрес," ",,НачалоПоиска,1)+1, СтрНайти(Адрес,",",,НачалоПоиска,2)-СтрНайти(Адрес," ",,НачалоПоиска,1)-1);
		КонецЕсли;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛПостРегионы.Наименование КАК Наименование,
		|	ЛПостРегионы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЛПостРегионы КАК ЛПостРегионы
		|ГДЕ
		|	ЛПостРегионы.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", "%"+ГородСтрокой+"%");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	КоличествоГородов = Выборка.Количество();
	
	Если КоличествоГородов > 1 Тогда
		Сообщить("Найдено несколько регионов в справочнике для "+ГородСтрокой+", выберите регион вручную");	
	Иначе
		Если Выборка.Следующий() Тогда
			Объект.РегионДоставки = Выборка.Ссылка;	
		Иначе
			Сообщить("Регион не найден, заполните вручную.");
			Объект.РегионДоставки = Справочники.ГородаСДЭК.ПустаяСсылка();
		КонецЕсли; 
	КонецЕсли; 
	
КонецФункции
 
&НаКлиенте
Процедура ЗаполнитьПоляЛПост(Команда)
	
	//Объект.СтраховатьГруз = Истина;
	//СтраховатьГрузПриИзменении(Неопределено);
	
	ЗаполнитьПоляЛПостТКНаСервере();
	
	Если Объект.СтатусОплатыЗаказа = "Не оплачен" Тогда
		Объект.НаложенныйПлатеж = Истина;
		НаложенныйПлатежПриИзменении(Неопределено);
	Иначе
		Объект.НаложенныйПлатеж = Ложь;
		объект.СуммаНаложенногоПлатежа = 0;
	КонецЕсли; 
	Объект.ПримечаниеТК = "Услуга примерки, частичный выкуп, вежливый курьер!";
	Объект.КоличествоМест = 1; 
	Объект.ДоставитьВКратчайшийСрок = истина;
	Объект.ИнтервалДоставкиЛПост = "С 9 до 12";
	
	КоличествоМестПриИзменении(Неопределено);
	
	ТекДата = ТекущаяДата();
	Если (ТекДата-НачалоДня(ТекДата))< Дата(1,1,1,19,30,0)-Дата(1,1,1) Тогда
		Объект.ДатаОтгрузки = ТекДата;
	Иначе
		Объект.ДатаОтгрузки = КонецДня(ТекДата)+1;
	КонецЕсли; 
	
	КоличествоТовараВЗаявке = Объект.Товары.Итог("Количество");
	Объект.ВесПриОтправке = КоличествоТовараВЗаявке*200;
	МассивИнтервалов = РасчитатьПредварительнуюСтоимостьДоставкиИДатуДоставкиЛПост(Неопределено);

	ДокументСсылка = Объект.Заказы[0].Заказ;
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		Объект.СуммаСтрахования = ПолучитьСуммуДокумента(ДокументСсылка);
		Объект.СуммаНаложенногоПлатежа = 0;
	КонецЕсли; 

	ВызыватьФормуВыбораВремениДоставкиЛПост = ПолучитьЗначениеДинамическихНастроек();
	
	Если ВызыватьФормуВыбораВремениДоставкиЛПост Тогда
		ПараметрыОткрытия = Новый Структура();
	    ПараметрыОткрытия.Вставить("МассивИнтервалов", МассивИнтервалов);
	    
	    ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьВремяДоставки", ЭтаФорма);
	    
	    ОткрытьФорму("Обработка.ОбменLPost.Форма.ФормаВыбораВремениДоставки", ПараметрыОткрытия, ЭтаФорма,,,,
                ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
   	
	КонецЕсли;
	 
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеДинамическихНастроек()
	 Возврат Бабочка.ПолучитьЗначениеДинамическихНастроек("ВызыватьФормуВыбораВремениДоставкиЛПост", Истина);
КонецФункции

&НаКлиенте
Функция ЗаполнитьВремяДоставки(РезультатЗакрытия, Дополнительныепараметры) Экспорт
    
    Если РезультатЗакрытия <> Неопределено Тогда
          
        ЗаполнитьНаСервере(РезультатЗакрытия);
        
    КонецЕсли; 
    
КонецФункции

&НаСервере
Функция ЗаполнитьНаСервере(РезультатЗакрытия)
	
	Объект.ДатаДоставки = РезультатЗакрытия.День;
	Объект.ВремяДоставкиС = РезультатЗакрытия.ДатаС;
	Объект.ВремяДоставкиПо = РезультатЗакрытия.ДатаПо;
		
КонецФункции
 

&НаСервереБезКонтекста
Функция ПолучитьСуммуДокумента(ДокументСсылка)
	  ВОзврат ДокументСсылка.СуммаДокумента;
КонецФункции

&НаКлиенте
Процедура СамовывозПриИзменении(Элемент)
	Элементы.ЛПостПунктВыдачиЗаказа.Видимость = Самовывоз;
	Если НЕ Самовывоз Тогда
		Объект.ЛПостПунктВыдачи = ПредопределенноеЗначение("Справочник.ЛПостПунктыДоставки.ПустаяСсылка");	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЛПостПунктВыдачиЗаказаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.РегионДоставки) Тогда
		ПоказатьПредупреждение(,"Заполните регион доставки!",, "Babochka");
		Возврат;	
	КонецЕсли; 
	
	ПараметрыОткрытия = Новый Структура("Регион", Объект.РегионДоставки);
    ОткрытьФорму("Справочник.ЛПостПунктыДоставки.Форма.ФормаВыбора", ПараметрыОткрытия, Элемент);
    
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалДоставкиПоСПБПриИзменении(Элемент)
	
	Элементы.Интервал.СписокВыбора.Очистить();    
	Элементы.Интервал2.СписокВыбора.Очистить();    
	Если Объект.ИнтервалДоставкиПоСПБ Тогда
		Элементы.Интервал.СписокВыбора.Добавить("00010101103000:00010101130000", "10.30-13.00");
		Элементы.Интервал.СписокВыбора.Добавить("00010101130000:00010101160000", "13.00-16.00");
		Элементы.Интервал.СписокВыбора.Добавить("00010101150000:00010101180000", "15.00-18.00");
		Элементы.Интервал.СписокВыбора.Добавить("00010101170000:00010101200000", "17.00-20.00");
		
		Элементы.Интервал2.СписокВыбора.Добавить("00010101103000:00010101130000", "10.30-13.00");
		Элементы.Интервал2.СписокВыбора.Добавить("00010101130000:00010101160000", "13.00-16.00");
		Элементы.Интервал2.СписокВыбора.Добавить("00010101150000:00010101180000", "15.00-18.00");
		Элементы.Интервал2.СписокВыбора.Добавить("00010101170000:00010101200000", "17.00-20.00");
	
	Иначе
		Элементы.Интервал.СписокВыбора.Добавить("00010101103000:00010101150000", "10.30-15.00");
		Элементы.Интервал.СписокВыбора.Добавить("00010101130000:00010101180000", "13.00-18.00");
		Элементы.Интервал.СписокВыбора.Добавить("00010101160000:00010101200000", "16.00-20.00");
		
		Элементы.Интервал2.СписокВыбора.Добавить("00010101103000:00010101150000", "10.30-15.00");
		Элементы.Интервал2.СписокВыбора.Добавить("00010101130000:00010101180000", "13.00-18.00");
		Элементы.Интервал2.СписокВыбора.Добавить("00010101160000:00010101200000", "16.00-20.00");
	
	КонецЕсли;
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиС);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиПо); 
	
	Если Объект.Интервал = "" Тогда 
	//Если Элементы.Интервал.ТекстРедактирования = "" Тогда 
		//Объект.ВремяДоставкиС = Дата(1,1,1,0,0,0);
		//Объект.ВремяДоставкиПо = Дата(1,1,1,0,0,0);
	Иначе  
		ВремяИнтервала = Объект.Интервал;	
		ПозицияДвоеточия = СтрНайти(ВремяИнтервала, ":");
		Если ЗначениеЗаполнено(ВремяИнтервала) Тогда
			Объект.ВремяДоставкиС = Дата(Лев(ВремяИнтервала, ПозицияДвоеточия-1)); 
			Объект.ВремяДоставкиПо = Дата(Сред(ВремяИнтервала, ПозицияДвоеточия+1, СтрДлина(ВремяИнтервала)));
   	    КонецЕсли;
	 КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Функция РасчитатьПредварительнуюСтоимостьДоставкиИДатуДоставкиЛПост(Команда)  
	
	Если Модифицированность Тогда
		ЭтотОбъект.Записать();	
	КонецЕсли; 
	СтруктураОтвета = РасчитатьПредварительнуюСтоимостьДоставкиЛПостНаСервере(Объект.Ссылка);
	Объект.СтоимостьДоставкиТК = СтруктураОтвета.ПредварительнаяСтоимость; 
	Если Команда = Неопределено Тогда
		Объект.ДатаДоставки = Объект.ДатаОтгрузки+СтруктураОтвета.ДнейНаЛогистику*24*3600;
	КонецЕсли;
	
	Возврат СтруктураОтвета.ИнтервалыДоставки;
	
КонецФункции

&НаСервереБезКонтекста
Функция РасчитатьПредварительнуюСтоимостьДоставкиЛПостНаСервере(Заявка)
	 Возврат Обработки.ОбменLPost.ПолучитьПредварительнуюСтоимостьДоставки(Заявка);
КонецФункции

#КонецОбласти 

&НаКлиенте
Функция УстановитьВидимостьПечати()
	
	ВидимостьСДЭК = Объект.ТранспортнаяКомпания = ПредопределенноеЗначение("Перечисление.ТранспортныеКомпании.CDEK");
	ВидимостьЛПост = Объект.ТранспортнаяКомпания = ПредопределенноеЗначение("Перечисление.ТранспортныеКомпании.LPOST");
	
	Элементы.ФормаНапечататьКвитанциюЛПост.Видимость = ВидимостьЛПост;
	Элементы.ФормаПечатьЭтикетокСДЭК.Видимость = ВидимостьСДЭК;
	Элементы.ФормаПечатьКвитанцияСДЭК.Видимость = ВидимостьСДЭК;
	
	Если НЕ ВидимостьСДЭК и НЕ ВидимостьЛПост Тогда
		Элементы.ПечатьТК.Видимость = Ложь;	
	КонецЕсли;   
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоляТКБезОтбора(Команда)
	
	Если Объект.ТранспортнаяКомпания = ПредопределенноеЗначение("Перечисление.ТранспортныеКомпании.CDEK") Тогда
		ЗаполнитьПоляТК(Неопределено);
	ИначеЕсли Объект.ТранспортнаяКомпания = ПредопределенноеЗначение("Перечисление.ТранспортныеКомпании.LPOST") Тогда 
		ЗаполнитьПоляЛПост(Неопределено);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОкруглитьСуммыПоСтрокамНаСервере()
	
	СуммаВсего = Объект.Товары.Итог("Сумма");
	КоличествоСтрок = Объект.Товары.Количество();
	
	Если КоличествоСтрок = 1 Тогда
		СуммаВсего = Окр(СуммаВсего);
		Объект.СуммаДокумента = СуммаВсего;
	КонецЕсли;
		
	Для каждого Строка Из Объект.Товары Цикл   
		
		Если КоличествоСтрок = 1 Тогда
			Строка.Сумма = СуммаВсего; 
			Прервать;
		КонецЕсли;
		Строка.Сумма = Окр(Строка.Сумма);
		КоличествоСтрок = КоличествоСтрок - 1;
		СуммаВсего = СуммаВсего - Строка.Сумма;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОкруглитьСуммыПоСтрокам(Команда)
	
	ОкруглитьСуммыПоСтрокамНаСервере(); 
	Модифицированность = Истина;  
	 
КонецПроцедуры


#Область Печать

#Область ЭтикеткаСДЭК
&НаСервере
Функция СформироватьUuidШКЭтикетка(ЗаявкаНаДоставку)
	
	Токен = "Bearer "+ Константы.СДЭКТокен.Получить();
	HTTPСоединение = Новый HTTPСоединение(URL, , , , , , Новый ЗащищенноеСоединениеOpenSSL(), );
	HTTPЗапрос = Новый HTTPЗапрос("/v2/print/barcodes/");
	
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен); 
    HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	
	ЗапросСтруктура = Новый Структура("order_uuid", ЗаявкаНаДоставку.СДЭКUuid);
	Массив = Новый Массив;
	Массив.Добавить(ЗапросСтруктура);
	СтруктураOrders = Новый Структура("orders", Массив);
	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураOrders);
	
	СтрокаЗапроса = ЗаписьJSON.Закрыть();
	
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса); 
	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);

	//через поток не все ответы парсит
	ОтветСервера = Ответ.ПолучитьТелоКакСтроку("UTF-8"); // ЧтениеJSON.Закрыть();
	
	ОшибкаАутентификации = СтрНайти(ОтветСервера, "{""type"":""AUTH""") > 0;
	Если ОшибкаАутентификации Тогда
		АвторизацияНаСервере();
		Возврат	"";
	КонецЕсли; 

	UuidКвитанции = "";
	НайденныйUuid =  СтрНайти(ОтветСервера,Символ(34)+"uuid"+Символ(34)+":");
	Если НайденныйUuid > 0 Тогда
		
		UuidКвитанции = Сред(ОтветСервера, НайденныйUuid+8,36);
		
	КонецЕсли; 
	
	ОтветФункции = Новый Структура();
	ОтветФункции.Вставить("UuidКвитанции", UuidКвитанции);
	ОтветФункции.Вставить("ОшибкаАутентификации", ОшибкаАутентификации);
	
	Возврат ОтветФункции;
		
КонецФункции

&НаСервере
Функция ПолучитьЭтикеткуНаСервере(UuidКвитанции)
	
	Токен = "Bearer "+ Константы.СДЭКТокен.Получить();
	HTTPСоединение = Новый HTTPСоединение(URL, , , , , , Новый ЗащищенноеСоединениеOpenSSL(), );
	HTTPЗапрос = Новый HTTPЗапрос("/v2/print/barcodes/"+UuidКвитанции);//+Заявка.СДЭКUuid);
	
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен); 
    HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);

	ДвоичныеДанные = Ответ.ПолучитьТелоКакДвоичныеДанные();
	
	Возврат  ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции

&НаСервере
Функция СкачатьШКЭтикеткуНаСервере(UuidКвитанции)
	
	Токен = "Bearer "+ Константы.СДЭКТокен.Получить();
	HTTPСоединение = Новый HTTPСоединение(URL, , , , , , Новый ЗащищенноеСоединениеOpenSSL(), );
	HTTPЗапрос = Новый HTTPЗапрос("/v2/print/barcodes/"+UuidКвитанции+".pdf");//+Заявка.СДЭКUuid);
	
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен); 
    HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);

	ДвоичныеДанные = Ответ.ПолучитьТелоКакДвоичныеДанные();
	
	Возврат  ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции

&НаКлиенте
Процедура ПечатьЭтикетокСДЭК(Команда)

	Если Модифицированность Тогда
		ЭтотОбъект.Записать();	
	КонецЕсли;
	
	Результат = СформироватьUuidШКЭтикетка(Объект.Ссылка);
	UuidЭтикеткиШК = Результат.UuidКвитанции;
	ОшибкаАутентификации = Результат.ОшибкаАутентификации;
	
	Если ОшибкаАутентификации Тогда
		АвторизацияНаСервере();
		UuidЭтикеткиШК = СформироватьUuidШКЭтикетка(Объект.Ссылка);
	КонецЕсли; 

	Если НЕ ЗначениеЗаполнено(UuidЭтикеткиШК) Тогда
		Возврат;	
	КонецЕсли; 
	
	Если UuidЭтикеткиШК <> "" Тогда
		ВременныйФайл = ПолучитьИмяВременногоФайла("pdf");
	    СделатьПаузу(2);
		
		АдресВХ = СкачатьШКЭтикеткуНаСервере(UuidЭтикеткиШК);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ);
		ДвоичныеДанные.Записать(ВременныйФайл);
			
		ЗапуститьПриложение(ВременныйФайл);
	
	КонецЕсли;
	
КонецПроцедуры

   
#КонецОбласти

#Область КвитанцияСДЭК 

&НаСервере
Функция СкачатьКвитанциюНаСервере(UuidКвитанции)
	
	Токен = "Bearer "+ Константы.СДЭКТокен.Получить();
	HTTPСоединение = Новый HTTPСоединение(URL, , , , , , Новый ЗащищенноеСоединениеOpenSSL(), );
	HTTPЗапрос = Новый HTTPЗапрос("/v2/print/orders/"+UuidКвитанции+".pdf");//+Заявка.СДЭКUuid);
	
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен); 
    HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);

	ДвоичныеДанные = Ответ.ПолучитьТелоКакДвоичныеДанные();
	
	Возврат  ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции

Функция СформироватьUuidКвитанции(ЗаявкаНаДоставку)
	
	Токен = "Bearer "+ Константы.СДЭКТокен.Получить();
	HTTPСоединение = Новый HTTPСоединение(URL, , , , , , Новый ЗащищенноеСоединениеOpenSSL(), );
	HTTPЗапрос = Новый HTTPЗапрос("/v2/print/orders/");
	
	HTTPЗапрос.Заголовки.Вставить("Authorization", Токен); 
    HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	
	ЗапросСтруктура = Новый Структура("order_uuid", ЗаявкаНаДоставку.СДЭКUuid);
	Массив = Новый Массив;
	Массив.Добавить(ЗапросСтруктура);
	СтруктураOrders = Новый Структура("orders", Массив);
	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураOrders);
	
	СтрокаЗапроса = ЗаписьJSON.Закрыть();
	
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса); 
	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);

	//через поток не все ответы парсит
	ОтветСервера = Ответ.ПолучитьТелоКакСтроку("UTF-8"); // ЧтениеJSON.Закрыть();
	
	ОшибкаАутентификации = СтрНайти(ОтветСервера, "{""type"":""AUTH""") > 0;
	Если ОшибкаАутентификации Тогда
		АвторизацияНаСервере();
		Возврат	"";
	КонецЕсли; 

	UuidКвитанции = "";
	НайденныйUuid =  СтрНайти(ОтветСервера,Символ(34)+"uuid"+Символ(34)+":");
	Если НайденныйUuid > 0 Тогда
		
		UuidКвитанции = Сред(ОтветСервера, НайденныйUuid+8,36);
		
	КонецЕсли; 
	
	ОтветФункции = Новый Структура();
	ОтветФункции.Вставить("UuidКвитанции", UuidКвитанции);
	ОтветФункции.Вставить("ОшибкаАутентификации", ОшибкаАутентификации);
	
	Возврат ОтветФункции;
	
КонецФункции

&НаКлиенте
Процедура ПечатьКвитанцияСДЭК(Команда)
	
	Если Модифицированность Тогда
		ЭтотОбъект.Записать();	
	КонецЕсли;

	Результат = СформироватьUuidКвитанции(Объект.Ссылка);
	UuidКвитанции = Результат.UuidКвитанции;
	ОшибкаАутентификации = Результат.ОшибкаАутентификации;
	
	Если ОшибкаАутентификации Тогда
		АвторизацияНаСервере();
		Результат = СформироватьUuidКвитанции(Объект.Ссылка);
		UuidКвитанции = Результат.UuidКвитанции;
		ОшибкаАутентификации = Результат.ОшибкаАутентификации;
	
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(UuidКвитанции) Тогда
		Возврат;	
	КонецЕсли; 
	
	Если UuidКвитанции <> "" Тогда
		ВременныйФайл = ПолучитьИмяВременногоФайла("pdf");
		СделатьПаузу(2);
		АдресВХ = СкачатьКвитанциюНаСервере(UuidКвитанции);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХ);
		ДвоичныеДанные.Записать(ВременныйФайл);
		
		ЗапуститьПриложение(ВременныйФайл);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СделатьПаузу(ЗадержкаСекунд = 3)
	
    Если ЗадержкаСекунд = 0 Тогда
        Возврат
    КонецЕсли;
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	// грузит процессор
	ДатаВыхода = ТекущаяДата() + ЗадержкаСекунд;
	Пока ТекущаяДата() < ДатаВыхода Цикл
	
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Функция MD5ХешСтрока(тСтрока)
	
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5); 
    Хеш.Добавить(тСтрока); 
	
	Возврат НРег(СтрЗаменить(Строка(Хеш.ХешСумма), " ", "")); 
	
КонецФункции

&НаСервере
Функция ПолучитьКвитанциюНаСервере_СтарыйПротокол(ВременныйФайл, DispatchNumber)
	
	Логин = "t8w5sCraiwArayAtB38RdFy5HEkjtemS";
	Пароль = "ZxkjM3eUEWVNXooK0FoFWk0FeeCpXFwk";
	
	Логин = Константы.СДЭКAccount.Получить();
	Пароль = Константы.СДЭКSecure_password.Получить();
	
	Date = 				Формат(ТекущаяДата(), "ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс"""); 	//Date time/date
	Account = 			Логин; 													//string(255)
	Secure = 			MD5ХешСтрока(Date + "&" + Пароль); 						//string(255)
	URL =				"integration.cdek.ru";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("OrdersPrint");
	ЗаписьXML.ЗаписатьАтрибут("date", 					XMLСтрока(Date));
	ЗаписьXML.ЗаписатьАтрибут("account", 				XMLСтрока(Account));
	ЗаписьXML.ЗаписатьАтрибут("secure", 				XMLСтрока(Secure));
	ЗаписьXML.ЗаписатьАтрибут("OrderCount", 			XMLСтрока(1));
	ЗаписьXML.ЗаписатьАтрибут("CopyCount", 				XMLСтрока(1));
	ЗаписьXML.ЗаписатьНачалоЭлемента("Order");
	ЗаписьXML.ЗаписатьАтрибут("DispatchNumber", 		XMLСтрока(DispatchNumber));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	СтрXML = ЗаписьXML.Закрыть();
	
	Попытка
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
		Соединение = Новый HTTPСоединение(URL,,,,,,ЗащищенноеСоединение); 
		ЗаголовокHTTP = Новый Соответствие(); 
		ЗаголовокHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded"); 
		Запрос = Новый HTTPЗапрос("/orders_print.php", ЗаголовокHTTP); 
		Запрос.УстановитьТелоИзСтроки("xml_request=" + СтрXML, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать); 
		Ответ = Соединение.ОтправитьДляОбработки(Запрос); 
		ДвоичныеДанные = Ответ.ПолучитьТелоКакДвоичныеДанные();  
		
		Возврат  ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		//ДвоичныеДанные.Записать(ВременныйФайл);
	Исключение
		АвторизацияНаСервере();
		Возврат "";
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

КонецФункции

#КонецОбласти

 #Область КвитанцияЛПост
 &НаСервере
Функция ПолучитьСсылкуКвитанции()   
	
	ОтправлятьНаТестовыйСервер = Бабочка.ПолучитьЗначениеДинамическихНастроек("LPostОтправлятьНаТестовыйСервер", Истина);
	Если ОтправлятьНаТестовыйСервер Тогда
		URL = "https://apitest.l-post.ru/";  //Тестовый
	Иначе
		URL = "https://api.l-post.ru/";      //Рабочий
	КонецЕсли; 
	
	Если Константы.ЛПостДатаДействияТокена.Получить()<ТекущаяДата() Тогда
		Обработки.ОбменLPost.ПолучитьТокенНаСервере(URL);	
	КонецЕсли;
	
	Возврат Объект.СсылкаНаЭтикетку+Константы.ЛПостТокен.Получить();
	
КонецФункции

&НаКлиенте
Процедура НапечататьКвитанциюЛПост(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.СсылкаНаЭтикетку) Тогда  
		Сообщить("Выгрузите сначала заявку");
		Возврат;	
	КонецЕсли;
	ЗапуститьПриложение(ПолучитьСсылкуКвитанции());
КонецПроцедуры

&НаКлиенте
Процедура ВремяДоставкиСПриИзменении(Элемент)
	Объект.Интервал = "";
КонецПроцедуры

&НаКлиенте
Процедура ВремяДоставкиПоПриИзменении(Элемент)
	Объект.Интервал = "";
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент) 
	
	Телефон =  СтрЗаменить(Бабочка.ПолучитьНомерТелефонаКлиент(Объект.Партнер)," ","");
	Телефон = СТрЗаменить(Телефон, "(","");
	Телефон = СТрЗаменить(Телефон, ")","");
	Телефон = СТрЗаменить(Телефон, "-","");
	Телефон = СТрЗаменить(Телефон, "+","");
	Объект.ТелефонПолучателя = Телефон;
		
КонецПроцедуры

 #КонецОбласти
#КонецОбласти