
Функция СведенияОВнешнейОбработке() Экспорт 
	
	// Объявим переменную, в которой мы сохраним и вернем "наружу" необходимые данные 
	
	ПараметрыРегистрации = Новый Структура; 
	
	// Объявим еще одну переменную, которая нам потребуется ниже 
	
	МассивНазначений = Новый Массив; 
	МассивНазначений.Добавить("Документ.ЗаказКлиента");
	
	// Первый параметр, который мы должны указать - это какой вид обработки системе должна зарегистрировать. 
	
	// Допустимые типы: ДополнительнаяОбработка, ДополнительныйОтчет, ЗаполнениеОбъекта, Отчет, ПечатнаяФорма, СозданиеСвязанныхОбъектов 
	
	ПараметрыРегистрации.Вставить("Вид", "ЗаполнениеОбъекта"); 
	
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений); 
	
	// Теперь зададим имя, под которым ВПФ будет зарегистрирована в справочнике внешних обработок 
	
	ПараметрыРегистрации.Вставить("Наименование", "Пробить чек (только для ПВЗ)"); 
	
	// Зададим право обработке на использование безопасного режима. Более подробно можно узнать в справке к платформе (метод УстановитьБезопасныйРежим) 
	
	ПараметрыРегистрации.Вставить("БезопасныйРежим", ложь); 
	
	// Следующие два параметра играют больше информационную роль, т.е. это то, что будет видеть пользователь в информации к обработке 
	
	ПараметрыРегистрации.Вставить("Версия", "1.0"); 
	ПараметрыРегистрации.Вставить("Информация", "Дополнительная обработка 'Пробить чек (только для ПВЗ)'"); 
	
	// Создадим таблицу команд (подробнее смотрим ниже) 
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд(); 
	
	// Добавим команду в таблицу 
	
	ДобавитьКоманду(ТаблицаКоманд, "Пробить чек (только для ПВЗ)", "ПробитьЧекПВЗ", "ВызовКлиентскогоМетода", Ложь); 
	
	// Сохраним таблицу команд в параметры регистрации обработки 
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд); 
	
	// Теперь вернем системе наши параметры 
	
	Возврат ПараметрыРегистрации; 
	
КонецФункции

Функция ПолучитьТаблицуКоманд() 
	
	Команды = Новый ТаблицаЗначений; 
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево")); 
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка")); 
	
	Возврат Команды; 
	
КонецФункции 

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "") 
	
	НоваяКоманда = ТаблицаКоманд.Добавить(); 
	НоваяКоманда.Представление = Представление; 
	НоваяКоманда.Идентификатор = Идентификатор; 
	НоваяКоманда.Использование = Использование; 
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение; 
	НоваяКоманда.Модификатор = Модификатор; 
	
КонецПроцедуры

