
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция УстановитьВидимостьСтатусаАХ()

	Элементы.СтатусАдресноеХранение.Видимость = АдресноеХранениеBabochka.ПроверитьУсловиеАдресности(Объект.Склад, Объект.Дата);
	
КонецФункции

&НаКлиенте
Функция СтатусАдресноеХранениеПриИзменении(Элемент)
	
	Если Объект.Проведен
		И Объект.СтатусАдресноеХранение = ПредопределенноеЗначение("Перечисление.СтатусыОтборовРазмещенийТоваровBabochka.Выполнено") Тогда   
		ЕстьТоварыКРазмещению = ВыполнитьПроверкуЕстьТоварыКРазмещению(Объект.Ссылка);
		Если ЕстьТоварыКРазмещению Тогда
			Объект.СтатусАдресноеХранение = ПредопределенноеЗначение("Перечисление.СтатусыОтборовРазмещенийТоваровBabochka.ВРаботе");
		    Сообщить("Не все товары размещены! Создайте документ отбор/размещение товаров");
		КонецЕсли; 
	ИначеЕсли НЕ Объект.Проведен
		И Объект.СтатусАдресноеХранение = ПредопределенноеЗначение("Перечисление.СтатусыОтборовРазмещенийТоваровBabochka.Выполнено") Тогда
		Сообщить("Сначала проведите документ со статусом ""В работе"""); 
		Объект.СтатусАдресноеХранение = ПредопределенноеЗначение("Перечисление.СтатусыОтборовРазмещенийТоваровBabochka.ВРаботе");
	КонецЕсли; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьПроверкуЕстьТоварыКРазмещению(Ссылка)
	Возврат АдресноеХранениеBabochka.ВыполнитьПроверкуЕстьТоварыКРазмещению(Ссылка, "Документ.ПриходныйОрдерНаТовары.Товары");
КонецФункции

&НаСервере
Процедура BG_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	АдресноеХранениеBabochka.ЗаполнитьСтатусЗначениемПодготовлено(Отказ, СтандартнаяОбработка, Объект);
	
КонецПроцедуры

&НаСервере
&После("УстановитьУсловноеОформление")
Процедура ba_УстановитьУсловноеОформление()
	// Розничная цена.
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РозничнаяЦенаСтрока.Имя);
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.DefaultGUIFont, , , Истина, Ложь, Ложь, Ложь, ));
	
	// Цена аутлет.
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЦенаАутлетСтрока.Имя);
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.DefaultGUIFont, , , Истина, Ложь, Ложь, Ложь, ));
КонецПроцедуры

#КонецОбласти

&НаСервере
&ИзменениеИКонтроль("ВывестиДополнительнуюИнформациюПоНоменклатуре")
Процедура ba_ВывестиДополнительнуюИнформациюПоНоменклатуре(Номенклатура, Характеристика, Упаковка)

	РеквизитыНоменклатуры = Новый Структура;
	РеквизитыНоменклатуры.Вставить("ШаблонЭтикеткиВида");
	РеквизитыНоменклатуры.Вставить("ШаблонЦенникаВида");
	РеквизитыНоменклатуры.Вставить("ШаблонЦенникаНоменклатуры");
	РеквизитыНоменклатуры.Вставить("ШаблонЭтикеткиНоменклатуры");
	РеквизитыНоменклатуры.Вставить("НаборУпаковок");
	РеквизитыНоменклатуры.Вставить("ФайлКартинки");
	РеквизитыНоменклатуры.Вставить("СкладскаяГруппа");

	Если Не ЗначениеЗаполнено(Номенклатура) Тогда

		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();

		ШаблонЭтикеткиСтрока = "";
		ШаблонЦенникаСтрока = "";
		АдресКартинки = "";
		НаборУпаковокСтрока = "";

	Иначе

		РеквизитыНоменклатуры.Вставить("ШаблонЭтикеткиВида", "ВидНоменклатуры.ШаблонЭтикетки");
		РеквизитыНоменклатуры.Вставить("ШаблонЦенникаВида", "ВидНоменклатуры.ШаблонЦенника");
		РеквизитыНоменклатуры.Вставить("ШаблонЦенникаНоменклатуры", "ШаблонЦенника");
		РеквизитыНоменклатуры.Вставить("ШаблонЭтикеткиНоменклатуры", "ШаблонЭтикетки");
		РеквизитыНоменклатуры.Вставить("НаборУпаковок", "НаборУпаковок");
		РеквизитыНоменклатуры.Вставить("ФайлКартинки", "ФайлКартинки");
		РеквизитыНоменклатуры.Вставить("СкладскаяГруппа", "СкладскаяГруппа");
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура,РеквизитыНоменклатуры);

	КонецЕсли; 
	#Вставка	
	РеквизитыНоменклатуры.Вставить("РозничнаяЦена");
	РеквизитыНоменклатуры.Вставить("ЦенаАутлет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК ЦенаРозничная,
		|	0 КАК ЦенаАутлет
		|ПОМЕСТИТЬ ВТ_Цены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			ВидЦены = &ВидЦеныРозничная
		|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	0,
		|	ЦеныНоменклатурыСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			ВидЦены = &ВидЦеныАутлет
		|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_Цены.ЦенаРозничная) КАК ЦенаРозничная,
		|	СУММА(ВТ_Цены.ЦенаАутлет) КАК ЦенаАутлет
		|ИЗ
		|	ВТ_Цены КАК ВТ_Цены";
	
	Запрос.УстановитьПараметр("ВидЦеныАутлет", Справочники.ВидыЦен.НайтиПоНаименованию("Цена Аутлет"));
	Запрос.УстановитьПараметр("ВидЦеныРозничная", РозничныйВидЦены);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		РозничнаяЦенаСтрока = Строка(Выборка.ЦенаРозничная);
		ЦенаАутлетСтрока = Строка(Выборка.ЦенаАутлет);    
		РеквизитыНоменклатуры.РозничнаяЦена = Выборка.ЦенаРозничная;
		РеквизитыНоменклатуры.ЦенаАутлет = Выборка.ЦенаАутлет;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.РозничнаяЦена) Тогда
		РозничнаяЦенаСтрока = НСтр("ru = '<Не указан>'");
	Иначе
		РозничнаяЦенаСтрока = Строка(РеквизитыНоменклатуры.РозничнаяЦена);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.ЦенаАутлет) Тогда
		ЦенаАутлетСтрока = НСтр("ru = '<Не указан>'");
	Иначе
		ЦенаАутлетСтрока = Строка(РеквизитыНоменклатуры.ЦенаАутлет);
	КонецЕсли;
	
    #КонецВставки

	// Обновить складскую группу.
	Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.СкладскаяГруппа) Тогда
		Надпись = НСтр("ru = '<Не указан>'");
		СкладскаяГруппаБулево = Ложь;
		СкладскаяГруппаСтрока = Надпись;
	Иначе
		СкладскаяГруппаБулево = Истина;
		СкладскаяГруппаСтрока = Строка(РеквизитыНоменклатуры.СкладскаяГруппа);
	КонецЕсли;

	СтруктураУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентВесОбъемПрочиеРеквизитыУпаковки(Упаковка,Номенклатура,,Ложь);
	РеквизитыНоменклатуры.Вставить("Вес", СтруктураУпаковки.ВесНетто);
	РеквизитыНоменклатуры.Вставить("Объем", СтруктураУпаковки.Объем);

	// Обновить ВесНоменклатуры.
	Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.Вес) Тогда
		Надпись = НСтр("ru = '<Не указан>'");
		ВесБулево = Ложь;
		ВесНоменклатуры = Надпись;
	Иначе
		ВесБулево = Истина;
		ВесНоменклатуры = Строка(РеквизитыНоменклатуры.Вес) + " " + ЕдиницаИзмеренияВеса;
	КонецЕсли;

	// Обновить ОбъемНоменклатуры.
	Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.Объем) Тогда
		Надпись = НСтр("ru = '<Не указан>'");
		ОбъемБулево = Ложь;
		ОбъемНоменклатуры = Надпись;
	Иначе
		ОбъемБулево = Истина;
		ОбъемНоменклатуры = Строка(РеквизитыНоменклатуры.Объем) + " " + ЕдиницаИзмеренияОбъема;
	КонецЕсли;

	// Обновить ШаблонЭтикетки.
	Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.ШаблонЭтикеткиНоменклатуры) Тогда
		Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.ШаблонЭтикеткиВида) Тогда
			Надпись = НСтр("ru = '<Не указан>'");
			ШаблонЭтикетки = Ложь;
			ШаблонЭтикеткиСтрока = Надпись;
		Иначе
			ШаблонЭтикетки = Истина;
			ШаблонЭтикеткиСтрока = Строка(РеквизитыНоменклатуры.ШаблонЭтикеткиВида);
		КонецЕсли;
	Иначе
		ШаблонЭтикетки = Истина;
		ШаблонЭтикеткиСтрока = Строка(РеквизитыНоменклатуры.ШаблонЭтикеткиНоменклатуры);
	КонецЕсли;

	// Обновить ШаблонЦенника.
	Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.ШаблонЦенникаНоменклатуры) Тогда
		Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.ШаблонЦенникаВида) Тогда
			Надпись = НСтр("ru = '<Не указан>'");
			ШаблонЦенникаСтрока = Надпись;
			ШаблонЦенника = Ложь;
		Иначе
			ШаблонЦенника = Истина;
			ШаблонЦенникаСтрока = Строка(РеквизитыНоменклатуры.ШаблонЦенникаВида);
		КонецЕсли;
	Иначе
		ШаблонЦенника = Истина;
		ШаблонЦенникаСтрока = Строка(РеквизитыНоменклатуры.ШаблонЦенникаНоменклатуры);
	КонецЕсли;

	// Обновить НаборУпаковок.
	Если Не ЗначениеЗаполнено(РеквизитыНоменклатуры.НаборУпаковок) Тогда
		Надпись = НСтр("ru = '<Упаковки не используются>'");	
		НаборУпаковокСтрока = Надпись;
		НаборУпаковок = Ложь;
	Иначе
		НаборУпаковок = Истина;
		НаборУпаковокСтрока = Строка(РеквизитыНоменклатуры.НаборУпаковок);
	КонецЕсли;

	// Обновить картинку.
	Если ЗначениеЗаполнено(РеквизитыНоменклатуры.ФайлКартинки) Тогда
		Попытка
			АдресКартинки = РаботаСФайлами.ДанныеФайла(РеквизитыНоменклатуры.ФайлКартинки, ЭтотОбъект.УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
		Исключение
			АдресКартинки = "";
			Элементы.АдресКартинки.ТекстНевыбраннойКартинки = НСтр("ru = 'Ошибка при чтении файла изображения'");
			Элементы.АдресКартинки.ЦветТекста 			   = ЦветаСтиля.ПоясняющийОшибкуТекст;
		КонецПопытки;
	Иначе
		АдресКартинки = "";
		Элементы.АдресКартинки.ТекстНевыбраннойКартинки = НСтр("ru = 'Изображение отсутствует'");
		Элементы.АдресКартинки.ЦветТекста               = ЦветаСтиля.ЦветТекстаНевыбраннойКартинки;
	КонецЕсли;

	// Установить отборы в списках.
	Если Не ЗначениеЗаполнено(Номенклатура)
		Или РеквизитыНоменклатуры.НаборУпаковок = НаборУпаковокИндивидуальный Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокУпаковок, "Владелец", Номенклатура,
		ВидСравненияКомпоновкиДанных.Равно,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокУпаковок, "Владелец", РеквизитыНоменклатуры.НаборУпаковок,
		ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокУпаковок, "ТипИзмеряемойВеличины", Перечисления.ТипыИзмеряемыхВеличин.Упаковка,
	ВидСравненияКомпоновкиДанных.Равно,,Истина);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокШтрихКодов, "Номенклатура",Номенклатура,
	ВидСравненияКомпоновкиДанных.Равно,,Истина);

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокШтрихКодов, "Характеристика",Характеристика,
	ВидСравненияКомпоновкиДанных.Равно,,Истина);

КонецПроцедуры

&НаКлиенте
Процедура ba_СкладПриИзмененииПосле(Элемент)
	ДатаДокумента = ?(НЕ ЗначениеЗаполнено(Объект.Дата), ТекущаяДата(), Объект.Дата);
	УстановитьВидимостьСтатусаАХ();

КонецПроцедуры
