
&ИзменениеИКонтроль("ПолучитьСуммуДокумента")
Функция ba_ПолучитьСуммуДокумента()

	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.СуммаСНДС КАК СуммаСНДС
	|ПОМЕСТИТЬ
	|	Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Товары.СуммаСНДС),0) КАК СуммаСНДС
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|	ИЛИ НЕ &ВернутьМногооборотнуюТару
	|	ИЛИ &ТребуетсяЗалогЗаТару
	|");

	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(,"Номенклатура,СуммаСНДС"));
	Запрос.УстановитьПараметр("ВернутьМногооборотнуюТару", ВернутьМногооборотнуюТару);
	Запрос.УстановитьПараметр("ТребуетсяЗалогЗаТару", ТребуетсяЗалогЗаТару);
	#Вставка
	УчетПоТоварнымКатегориям = ПредварительныеЗаказыСервер.УчетПоТоварнымКатегориям(Партнер, Соглашение, ХозяйственнаяОперация);
	
	Если УчетПоТоварнымКатегориям Тогда
		Запрос.УстановитьПараметр("Товары", ТоварныеКатегории.Выгрузить(,"СуммаСНДС,Отменено"));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Товары.Номенклатура КАК Номенклатура,", "ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,");
	КонецЕсли;
	#КонецВставки

	Выгрузка = Запрос.Выполнить().Выгрузить();
	СуммаИтого = Выгрузка[0].СуммаСНДС;
	Возврат СуммаИтого;

КонецФункции

&После("ЗаполнитьДокументНаОснованииЗаказаПоставщику")
Процедура ba_ЗаполнитьДокументНаОснованииЗаказаПоставщику(Знач ДокументОснование, Знач СкладПоступления, РеквизитыЗаказа)
	Для каждого СтрокаТЧ Из Товары Цикл
		СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество; 
		СтрокаТЧ.СуммаСНДС = СтрокаТЧ.Сумма; 
	КонецЦикла;
КонецПроцедуры

&После("ИнициализироватьДокумент")
Процедура ba_ИнициализироватьДокумент(ДанныеЗаполнения)
	Статус					  = Перечисления.СтатусыПоступленийТоваров.Отгружено; 
	ВариантПриемкиТоваров     = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
КонецПроцедуры   


