
Функция ЕстьОшибкиВЗаполненииДокументов()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаДок.Ссылка КАК ЗаказКлиента,
		|	РеализацияТоваровУслуг.Ссылка КАК РеализацияТоваров
		|ПОМЕСТИТЬ ВТ_Отгрузка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиентаДок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ЗаказКлиентаДок.Ссылка = РеализацияТоваровУслуг.ЗаказКлиента.Ссылка
		|ГДЕ
		|	ЗаказКлиентаДок.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйКассовыйОрдер.Ссылка КАК ПриходныйКассовыйОрдер,
		|	ВТ_Отгрузка.ЗаказКлиента КАК ЗаказКлиента,
		|	ВТ_Отгрузка.РеализацияТоваров КАК РеализацияТоваров
		|ПОМЕСТИТЬ ВТ_ПКО
		|ИЗ
		|	ВТ_Отгрузка КАК ВТ_Отгрузка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
		|		ПО (ПриходныйКассовыйОрдер.ДокументОснование = ВТ_Отгрузка.ЗаказКлиента)
		|ГДЕ
		|	ПриходныйКассовыйОрдер.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка КАК ЭквайринговаяОперация,
		|	ВТ_Отгрузка.ЗаказКлиента КАК ЗаказКлиента,
		|	ВТ_Отгрузка.РеализацияТоваров КАК РеализацияТоваров
		|ПОМЕСТИТЬ ВТ_Эквайринг
		|ИЗ
		|	ВТ_Отгрузка КАК ВТ_Отгрузка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
		|		ПО ВТ_Отгрузка.ЗаказКлиента = ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Заказ
		|ГДЕ
		|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПКО.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер,
		|	ЕСТЬNULL(ВТ_ПКО.ЗаказКлиента, ВТ_Эквайринг.ЗаказКлиента) КАК ЗаказКлиента,
		|	ЕСТЬNULL(ВТ_ПКО.РеализацияТоваров, ВТ_Эквайринг.РеализацияТоваров) КАК РеализацияТоваров,
		|	ВТ_Эквайринг.ЭквайринговаяОперация КАК ЭквайринговаяОперация
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_ПКО КАК ВТ_ПКО
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Эквайринг КАК ВТ_Эквайринг
		|		ПО ВТ_ПКО.ЗаказКлиента = ВТ_Эквайринг.ЗаказКлиента
		|			И ВТ_ПКО.РеализацияТоваров = ВТ_Эквайринг.РеализацияТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.ЗаказКлиента КАК ЗаказКлиента,
		|	ВТ_Итог.РеализацияТоваров КАК РеализацияТоваров,
		|	ВТ_Итог.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер,
		|	ВТ_Итог.ЭквайринговаяОперация КАК ЭквайринговаяОперация,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_Итог.ПриходныйКассовыйОрдер ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_Итог.ЗаказКлиента.Организация <> ВТ_Итог.ПриходныйКассовыйОрдер.Организация
		|							ИЛИ ВТ_Итог.ЗаказКлиента.Организация <> ВТ_Итог.РеализацияТоваров.Организация
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		КОГДА НЕ ВТ_Итог.ЭквайринговаяОперация ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_Итог.ЗаказКлиента.Организация <> ВТ_Итог.ЭквайринговаяОперация.Организация
		|							ИЛИ ВТ_Итог.ЗаказКлиента.Организация <> ВТ_Итог.РеализацияТоваров.Организация
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		КОГДА НЕ ВТ_Итог.РеализацияТоваров ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА ВТ_Итог.ЗаказКлиента.Организация <> ВТ_Итог.РеализацияТоваров.Организация
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьОшибки
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЕстьОшибки;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции

Процедура ЗаполнитьПоЗаявкеНаРаботуПортных(Знач ДокументОснование)
	
	ЭтотОбъект.ЗаявкаНаРаботуПортных = ДокументОснование;
	ЭтотОбъект.Организация           = ДокументОснование.Организация;
	ЭтотОбъект.Склад                 = ДокументОснование.Склад;
	ЭтотОбъект.Партнер               = ДокументОснование.Партнер;
	ЭтотОбъект.ВидЗаказа            = Перечисления.ВидыЗаказов.Другое;
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(ЭтотОбъект.Партнер, ЭтотОбъект.Контрагент);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРаботуПортныхУслуги.Услуга КАК Номенклатура,
		|	1 КАК КоличествоУпаковок,
		|	1 КАК Количество,
		|	ЗаявкаНаРаботуПортныхУслуги.Стоимость КАК Цена,
		|	ЗаявкаНаРаботуПортныхУслуги.Стоимость КАК Сумма,
		|	Значение(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС
		|ИЗ
		|	Документ.ЗаявкаНаРаботуПортных.Услуги КАК ЗаявкаНаРаботуПортныхУслуги
		|ГДЕ
		|	ЗаявкаНаРаботуПортныхУслуги.Ссылка = &ДокументОснование
		|	И ЗаявкаНаРаботуПортныхУслуги.Ссылка.ТребуетсяОплата";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.Товары.Добавить(), Выборка);
		
	КонецЦикла;
	
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура ba_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Автор = Пользователи.АвторизованныйПользователь();

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);

	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.Партнеры") Тогда
		ЗаполнитьДокументНаОснованииПартнера(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.СделкиСКлиентами") Тогда
		ЗаполнитьДокументНаОснованииСделкиПоПродаже(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда
		ЗаполнитьДокументНаОснованииИндивидуальногоСоглашенияСКлиентом(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаданиеТорговомуПредставителю") Тогда
		ЗаполнитьДокументНаОснованииЗаданияТорговомуПредставителю(ДанныеЗаполнения);
	Иначе
		Продажи.ПриОбработкеЗаполненияЗаказаКлиента(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
	КонецЕсли;
	
	#Вставка
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаявкаНаРаботуПортных") Тогда
		
		Если ДанныеЗаполнения.ТребуетсяОплата Тогда
			ЗаполнитьПоЗаявкеНаРаботуПортных(ДанныеЗаполнения);
		Иначе
			Сообщить("Оплата по заявке не требуется!");
		КонецЕсли;
		
	КонецЕсли;
	#КонецВставки

	РеквизитыСоглашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соглашение, "КомиссионныеПродажи25, ХозяйственнаяОперация");
	КомиссионныеПродажи25 = ?(ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
	И (НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами")
	ИЛИ (ЗначениеЗаполнено(Соглашение)
	И РеквизитыСоглашения.КомиссионныеПродажи25
	И РеквизитыСоглашения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию)), Истина, Ложь);

	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
		И КомиссионныеПродажи25 Тогда
		ВернутьМногооборотнуюТару      = Ложь;
		СрокВозвратаМногооборотнойТары = 0;
		ТребуетсяЗалогЗаТару           = Ложь;
	КонецЕсли;

	ИнициализироватьУсловияПродаж();

	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияКассыПриФОИспользоватьНесколькоКассЛожь", Ложь);
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);

	ОтветственныеЛицаСервер.УстановитьМенеджера(ЭтотОбъект, ДокументОснование);
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьПодчиненныеРеквизитыОбъекта(ЭтотОбъект, "Менеджер",, Истина);

	ЗаказКлиентаЛокализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);

	ИнициализироватьДокумент(ДанныеЗаполнения);

	ВзаиморасчетыСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);

	Приоритет = ЗначениеНастроекПовтИсп.ПолучитьПриоритетПоУмолчанию(Приоритет);

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура ba_ОбработкаПроведения(Отказ, РежимПроведения)
	#Вставка
	рс = ложь;
	для каждого стр из товары цикл
		если стр.СуммаРучнойСкидки > 0 тогда
			рс = истина;
		конецесли;
	конеццикла;	
	Если (этапыграфикаоплаты.Количество() <> 0 или рс)
		и видзаказа = перечисления.ВидыЗаказов.Сотрудник и не РазрешеноРуководством и не склад = справочники.Склады.НайтиПоНаименованию("Центральный - Униформа в наличии") тогда
		Сообщить("Данный вид заказа требует разрешение руководства");
		отказ = истина;
	конецесли;
	
	если рс и не значениезаполнено(ОтветстветственныйЗаРучСкидку) и не склад = справочники.Склады.НайтиПоНаименованию("Центральный - Униформа в наличии") 
			и не видзаказа = перечисления.ВидыЗаказов.Сотрудник тогда 
		ВызватьИсключение НСтр("ru='В документе есть ручная скидка, необходимо ввести ответстенного!'");
		
		отказ = истина;
	КонецЕсли;
	#КонецВставки

	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);

	ЗаказКлиентаЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ);

	РегистрыСведений.СтатусыСборкиИДоставки.ЗаписатьСтатусИзРаспоряжения(Ссылка, Отказ);

	ПродажиСервер.ВыполнитьКонтрольЗаказаПослеПроведения(Ссылка, Отказ);

КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписью")
Процедура ba_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	Если ЭтоНовый() И Не ЭтоЗаказКакСчет Тогда 
		// если ЭтоЗаказКакСчет = Истина - тогда реквизит был заполнен ранее в форме – изменять не требуется
		ЭтоЗаказКакСчет  = Не ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ЭтоЗаказКакСчет И Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда

		ТекстОшибки = НСтр("ru = 'Заказ как счет должен иметь статус ""На согласовании"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, , , Отказ);

	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах")
		И Не СкидкиРассчитаны
		И ПродажиСервер.ОперацииПередачиТоваров().Найти(ХозяйственнаяОперация) = Неопределено Тогда

		Отказ = Истина;

		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'В документе %1 не рассчитаны автоматические скидки (наценки). Проведение невозможно. Для расчёта автоматических скидок (наценок) проведите документ из формы документа.'"),
		Ссылка);

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		Ссылка,
		,
		,
		Отказ);

	КонецЕсли;

	НоменклатураСервер.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи);

	ЗаказыСервер.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект, "Товары");

	ОперацииПередачи = ПродажиСервер.ОперацииПередачиТоваров();

	РеквизитыСоглашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соглашение, "КомиссионныеПродажи25, ХозяйственнаяОперация");
	КомиссионныеПродажи25 = ?(ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
	И (НЕ ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами")
	ИЛИ (ЗначениеЗаполнено(Соглашение)
	И РеквизитыСоглашения.КомиссионныеПродажи25
	И РеквизитыСоглашения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию)), Истина, Ложь);

	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоставкаПодПринципала Тогда
		ВернутьМногооборотнуюТару = Ложь;
		ТребуетсяЗалогЗаТару      = Ложь;

	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
		И КомиссионныеПродажи25 Тогда
		ВернутьМногооборотнуюТару      = Ложь;
		СрокВозвратаМногооборотнойТары = 0;
		ТребуетсяЗалогЗаТару           = Ложь;
	КонецЕсли;

	Если (ОперацииПередачи.Найти(ХозяйственнаяОперация) <> Неопределено
		Или Не ВернутьМногооборотнуюТару)
		И ТребуетсяЗалогЗаТару Тогда

		ТребуетсяЗалогЗаТару = Ложь;

	КонецЕсли;

	СуммаДокумента = ПолучитьСуммуЗаказанныхСтрок();
	СуммаВозвратнойТары = ПолучитьСуммуВозвратнойТары();

	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;

	ДокументСогласован = Согласован;

	ОбщегоНазначенияУТ.ИзменитьПризнакСогласованностиДокумента(
	ЭтотОбъект,
	РежимЗаписи,
	Перечисления.СтатусыЗаказовКлиентов.НеСогласован);

	// Установим дату согласования, если документ согласован
	Если Не ДокументСогласован И Согласован Тогда
		ДатаСогласования = ТекущаяДатаСеанса();
		ВзаиморасчетыСервер.ПриИзмененииДатыСогласования(ЭтотОбъект);
	КонецЕсли;

	ИдентификаторПлатежа = ОбщегоНазначенияУТ.ПолучитьУникальныйИдентификаторПлатежа(ЭтотОбъект);

	ВзаиморасчетыСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи);

	ГрафикИсполненияВДоговоре = Ложь;
	Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
		И ЗначениеЗаполнено(Договор) Тогда
		ГрафикИсполненияВДоговоре = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ЗаданГрафикИсполнения");
	КонецЕсли;

	Если ОперацииПередачи.Найти(ХозяйственнаяОперация) <> Неопределено
		Или ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным
		Или ГрафикИсполненияВДоговоре Тогда

		СуммаАвансаДоОбеспечения = 0;
		СуммаПредоплатыДоОтгрузки = 0;

	Иначе

		ПродажиСервер.ЗаполнитьСуммыАвансаПредоплаты(ЭтотОбъект);

	КонецЕсли;

	Если Не НеОтгружатьЧастями Тогда
		НоваяДатаОтгрузки = Дата(1,1,1);

		Если Товары.Количество() > 0 Тогда

			Если Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению
				ИЛИ Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке
				ИЛИ Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда

				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Отменено", Ложь);
				СтрокиКОбеспечению = Товары.НайтиСтроки(ПараметрыОтбора);

				Если СтрокиКОбеспечению.Количество() > 0 Тогда

					ТаблицаСтрокКОбеспечению = Товары.Выгрузить(СтрокиКОбеспечению, "ДатаОтгрузки");
					ТаблицаСтрокКОбеспечению.Сортировать("ДатаОтгрузки Возр");
					НоваяДатаОтгрузки = ТаблицаСтрокКОбеспечению[0].ДатаОтгрузки;

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

		ДатаОтгрузки = НоваяДатаОтгрузки;
	Иначе
		ОбеспечениеВДокументахСервер.ЗаполнитьДатыОтгрузкиВТаблице(ДатаОтгрузки, Товары, "ДатаОтгрузки");
	КонецЕсли;

	// Очистим реквизиты документа не используемые для хозяйственной операции.
	МассивВсехРеквизитов = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;
	Документы.ЗаказКлиента.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
	ХозяйственнаяОперация,
	МассивВсехРеквизитов,
	МассивРеквизитовОперации);
	ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(
	ЭтотОбъект,
	МассивВсехРеквизитов,
	МассивРеквизитовОперации);

	МассивРеквизитов = Новый Массив;
	Если ЗначениеЗаполнено(ФормаОплаты) И Не (ФормаОплаты = Перечисления.ФормыОплаты.Наличная) Тогда
		МассивРеквизитов.Добавить("Касса");
	КонецЕсли;

	ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(ЭтотОбъект, МассивРеквизитов, Новый Массив);

	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказКлиента));

	ШаблонНазначения = Документы.ЗаказКлиента.ШаблонНазначения(ЭтотОбъект);

	РеквизитыДляПроверкиНазначения = "НаправлениеДеятельности,Договор,Партнер";
	Справочники.Назначения.ПроверитьЗаполнитьПередЗаписью(Назначение, ШаблонНазначения, ЭтотОбъект, РеквизитыДляПроверкиНазначения, Отказ);

	НоменклатураПартнеровСервер.ЗаполнитьНоменклатуруПартнераПоНоменклатуреВТаблице(Товары, Партнер);
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		НоменклатураПартнеровСервер.ЗаполнитьПустоеСопоставлениеВНоменклатуреПартнераПоНоменклатуреИБ(Товары, Отказ);
	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОбщегоНазначенияУТ.ЗаполнитьИдентификаторыДокумента(ЭтотОбъект, Метаданные.Документы.ЗаказКлиента.ТабличныеЧасти.Товары.Имя);
	КонецЕсли;

	ЗаказКлиентаЛокализация.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

	Если ЭтоНовый() И Не ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли; 
	
	#Вставка
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиента.Статус КАК Статус
	               |ИЗ
	               |	Документ.ЗаказКлиента КАК ЗаказКлиента
	               |ГДЕ
	               |	ЗаказКлиента.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таблица.ID КАК ID
	               |ПОМЕСТИТЬ ВТ_Товары
	               |ИЗ
	               |	&Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Товары.ID КАК ID
	               |ИЗ
	               |	ВТ_Товары КАК ВТ_Товары
	               |ГДЕ
	               |	ВТ_Товары.ID = 0";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Таблица", Товары.Выгрузить(,"ID"));
	
	РезультаЗапроса = запрос.ВыполнитьПакет(); 
	выб = РезультаЗапроса[0].Выбрать();
	Если выб.Следующий() Тогда 
		ПредыдущийСтатус = выб.Статус;
	Иначе
		ПредыдущийСтатус = перечисления.СтатусыЗаказовКлиентов.ПустаяСсылка();
	КонецЕсли;
	
	//заполнение ID строк для MarketPlace
	ДатаОтсчета = Бабочка.ПолучитьЗначениеДинамическихНастроек("ДатаВведенияIDСтрокЗаказаДляMarketPlace", Дата(2022,04,29));
	Если Дата > ДатаОтсчета 
		И НЕ РезультаЗапроса[2].Пустой() Тогда
		
		Для каждого СтрокаТЧ Из Товары Цикл
			Если СтрокаТЧ.ID = 0 Тогда
				СтрокаТЧ.ID = СтрокаТЧ.НомерСтроки;		
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли; 
		
	Если Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт 
		И Статус <> ПредыдущийСтатус Тогда
		
		//Проверка на правильность сумм в связанных документах
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СУММА(ЕСТЬNULL(РеализацияТоваровУслуг.СуммаДокумента, 0)) КАК СуммаДокумента,
			|	1 КАК ДляГруппировки
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.ЗаказКлиента = &Ссылка
			|	И РеализацияТоваровУслуг.Проведен";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Отказ = ?(Выборка.СуммаДокумента = null, 0,Выборка.СуммаДокумента) <> СуммаДокумента;
			Если Отказ Тогда
				Сообщить("Сумма реализаций "+Строка(Выборка.СуммаДокумента)+" не равна сумме заказа клиента "+Строка(СуммаДокумента));	
			КонецЕсли; 
		КонецЕсли;
			
	КонецЕсли;
	Маркетплейс_ЗаказИзменен = Ложь;
	МассивПартнеровДляОтправкиСМСОбИзмененииЗаказа = Новый Массив;  
	Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
		
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
        ТЗ.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
        ТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));

		Для каждого СтрокаТЧ Из Товары Цикл  
			
			Если СтрокаТЧ.Отменено Тогда
				Продолжить;	
			КонецЕсли;     
			
			СтрокаТЗ = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаТЧ, "Номенклатура, Характеристика,Количество");
		КонецЦикла; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
			|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
			|	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество
			|ПОМЕСТИТЬ СтарыйСоставЗаказа
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|ГДЕ
			|	ЗаказКлиентаТовары.Ссылка = &Ссылка
			|	И НЕ ЗаказКлиентаТовары.Отменено
			|	И ЗаказКлиентаТовары.Номенклатура.ЭтоMarketPlace
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаказКлиентаТовары.Характеристика,
			|	ЗаказКлиентаТовары.Номенклатура
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура,
			|	Характеристика
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Товары.Номенклатура КАК Номенклатура,
			|	ВТ_Товары.Характеристика КАК Характеристика,
			|	ВТ_Товары.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_ТоварыНовые
			|ИЗ
			|	&ВТ_Товары КАК ВТ_Товары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТоварыНовые.Номенклатура КАК Номенклатура,
			|	ВТ_ТоварыНовые.Характеристика КАК Характеристика,
			|	СУММА(ВТ_ТоварыНовые.Количество) КАК Количество
			|ПОМЕСТИТЬ Группировка_НовыеТовары
			|ИЗ
			|	ВТ_ТоварыНовые КАК ВТ_ТоварыНовые
			|ГДЕ
			|	ВЫРАЗИТЬ(ВТ_ТоварыНовые.Номенклатура КАК Справочник.Номенклатура).ЭтоMarketPlace
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ТоварыНовые.Номенклатура,
			|	ВТ_ТоварыНовые.Характеристика
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура,
			|	Характеристика
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Группировка_НовыеТовары.Номенклатура КАК Номенклатура,
			|	СтарыйСоставЗаказа.Номенклатура КАК Номенклатура1,
			|	ЕСТЬNULL(СтарыйСоставЗаказа.Номенклатура.Партнер_MarketPlace, ВЫРАЗИТЬ(Группировка_НовыеТовары.Номенклатура КАК Справочник.Номенклатура).Партнер_MarketPlace) КАК Партнер_MarketPlace
			|ИЗ
			|	Группировка_НовыеТовары КАК Группировка_НовыеТовары
			|		ПОЛНОЕ СОЕДИНЕНИЕ СтарыйСоставЗаказа КАК СтарыйСоставЗаказа
			|		ПО ((ВЫРАЗИТЬ(Группировка_НовыеТовары.Номенклатура КАК Справочник.Номенклатура)) = СтарыйСоставЗаказа.Номенклатура)
			|			И ((ВЫРАЗИТЬ(Группировка_НовыеТовары.Характеристика КАК Справочник.ХарактеристикиНоменклатуры)) = СтарыйСоставЗаказа.Характеристика)
			|ГДЕ
			|	ЕСТЬNULL(Группировка_НовыеТовары.Количество, 0) <> ЕСТЬNULL(СтарыйСоставЗаказа.Количество, 0)";
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("ВТ_Товары", ТЗ);
		
		РезультатЗапроса = Запрос.Выполнить();
		Маркетплейс_ЗаказИзменен = НЕ РезультатЗапроса.Пустой();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивПартнеровДляОтправкиСМСОбИзмененииЗаказа.Добавить(Выборка.Партнер_MarketPlace);
		КонецЦикла;
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("Маркетплейс_ЗаказИзменен", Маркетплейс_ЗаказИзменен);
	ДополнительныеСвойства.Вставить("МассивПартнеровДляОтправкиСМСОбИзмененииЗаказа", МассивПартнеровДляОтправкиСМСОбИзмененииЗаказа);
	#КонецВставки

КонецПроцедуры

&ИзменениеИКонтроль("ПриКопировании")
Процедура ba_ПриКопировании(ОбъектКопирования)
	
	#Вставка
	РазрешеноРуководством  = Ложь;
	ОтветстветственныйЗаРучСкидку = Справочники.ФизическиеЛица.ПустаяСсылка();
	РазмерРазрешеннойСкидки = 0;
	#КонецВставки

	Статус                 = Перечисления.СтатусыЗаказовКлиентов.ПустаяСсылка();
	ДатаОтгрузки           = Дата(1,1,1);
	ДатаСогласования       = Дата(1,1,1);
	МаксимальныйКодСтроки  = 0;
	Согласован             = Ложь;
	ДокументОснование      = Неопределено;
	НомерПоДаннымКлиента   = "";
	ДатаПоДаннымКлиента    = Дата(1,1,1);
	Назначение             = Неопределено;
	СостояниеЗаполненияМногооборотнойТары = Перечисления.СостоянияЗаполненияМногооборотнойТары.ПустаяСсылка();

	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Статус") = Перечисления.СтатусыДоговоровКонтрагентов.Закрыт Тогда
		Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;

	ДатаОтгрузкиВСтроке = Дата(1,1,1);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") И ЗначениеЗаполнено(Соглашение) Тогда
		УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(Соглашение, Истина);
		Если УсловияПродаж.СтатусСоглашения <> Перечисления.СтатусыСоглашенийСКлиентами.Закрыто Тогда
			Если ЗначениеЗаполнено(УсловияПродаж.СрокПоставки) И Не ЭтоЗаказКакСчет Тогда
				ДатаОтгрузкиВСтроке = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(
				ТекущаяДатаСеанса(),
				Перечисления.Периодичность.День,
				УсловияПродаж.СрокПоставки) + 1;
			КонецЕсли;
		Иначе
			Соглашение = Неопределено;
		КонецЕсли;
	КонецЕсли;

	Если НеОтгружатьЧастями Тогда
		ДатаОтгрузки = ДатаОтгрузкиВСтроке;
	КонецЕсли;

	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
		КомиссионныеПродажи25 = ПродажиСервер.ЭтоДоговорПоНовойКомиссии(Договор);
	Иначе
		КомиссионныеПродажи25 = Ложь;
	КонецЕсли;

	Если КомиссионныеПродажи25 Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи Тогда
		ВернутьМногооборотнуюТару      = Ложь;
		СрокВозвратаМногооборотнойТары = 0;
		ТребуетсяЗалогЗаТару           = Ложь;
	КонецЕсли;

	Для Каждого СтрокаТЧ Из Товары Цикл

		СтрокаТЧ.КодСтроки      = 0;
		СтрокаТЧ.ДатаОтгрузки   = ДатаОтгрузкиВСтроке;
		СтрокаТЧ.Отменено = Ложь;
		СтрокаТЧ.ПричинаОтмены = Справочники.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка();

	КонецЦикла;

	СкидкиНаценкиЗаполнениеСервер.ОтменитьСкидки(ЭтотОбъект, "Товары", Истина,,Истина);

	Для Каждого СтрокаТЧ Из Товары Цикл
		СтрокаТЧ.СуммаБонусныхБалловКСписанию = 0;
		СтрокаТЧ.СуммаБонусныхБалловКСписаниюВВалюте = 0;
	КонецЦикла;

	ИнициализироватьДокумент();

	ВзаиморасчетыСервер.ПриКопировании(ЭтотОбъект);

	ЗаказКлиентаЛокализация.ПриКопировании(ЭтотОбъект, ОбъектКопирования);

	Автор = Пользователи.АвторизованныйПользователь();

КонецПроцедуры




