
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заявка") Тогда
		Заявка = Параметры.Заявка;	
	КонецЕсли;
	Если Параметры.Свойство("ЭтоВозврат") Тогда
		ЭтоВозврат = Параметры.ЭтоВозврат;	
	КонецЕсли;
	
	ОтправлятьНаТестовыйСервер = Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_ОтправкаНаТестовыйСервер", Истина);
	Если ОтправлятьНаТестовыйСервер Тогда
		URL = "api.edu.cdek.ru";  //Тестовый
	Иначе
		URL = "api.cdek.ru";      //Рабочий
	КонецЕсли; 
	
	Если ЭтоВозврат Тогда
		СтрокаЗапроса = СформироватьТекстЗапросаВозвратДляРасчета();
		РежимДоставки = 0;
	Иначе
		СтрокаЗапроса = СформироватьТекстЗапросаДляРасчета();
		ТипДоставки = НРег(Строка(Заявка.СДЭКТипДоставки));
		СоотвествиеРежимовДоставки = ЗаполнитьСоответсвиеРижимовДоставки();
		
		РежимДоставки = СоотвествиеРежимовДоставки.Получить(ТипДоставки);
		Если РежимДоставки = Неопределено Тогда
			РежимДоставки = 0;	
		КонецЕсли; 
	КонецЕсли; 
	
	ОшибкаАвторизации = РассчитатьСтоимостьНаСервере(СтрокаЗапроса, РежимДоставки);  //токен меняется каждый час
	Если ОшибкаАвторизации Тогда
		РассчитатьСтоимостьНаСервере(СтрокаЗапроса, РежимДоставки);	
	КонецЕсли; 
	
	ПодобратьТарифИзБазы();
	
КонецПроцедуры

Функция ЗаполнитьСоответсвиеРижимовДоставки()
	
	СоотвествиеРежимов = Новый Соответствие;
	СоотвествиеРежимов.Вставить("дверь-дверь", 1);
	СоотвествиеРежимов.Вставить("дверь-склад", 2);
	СоотвествиеРежимов.Вставить("склад-дверь", 3);
	СоотвествиеРежимов.Вставить("склад-склад", 4);
	СоотвествиеРежимов.Вставить("дверь-постамат", 6);
	СоотвествиеРежимов.Вставить("склад-постамат", 7);
	
	Возврат СоотвествиеРежимов;
	
КонецФункции
 
Процедура ПодобратьТарифИзБазы()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТарифов.tariff_code КАК tariff_code,
		|	ТаблицаТарифов.delivery_sum КАК delivery_sum,
		|	ТаблицаТарифов.tariff_description КАК tariff_description,
		|	ТаблицаТарифов.period_min КАК period_min,
		|	ТаблицаТарифов.period_max КАК period_max,
		|	ТаблицаТарифов.tariff_name КАК tariff_name,
		|	ТаблицаТарифов.delivery_mode КАК delivery_mode
		|ПОМЕСТИТЬ ТаблицаТарифов
		|ИЗ
		|	&ТаблицаТарифов КАК ТаблицаТарифов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТарифов.tariff_code КАК tariff_code,
		|	ТаблицаТарифов.delivery_sum КАК delivery_sum,
		|	ТаблицаТарифов.tariff_description КАК tariff_description,
		|	ТаблицаТарифов.period_min КАК period_min,
		|	ТаблицаТарифов.period_max КАК period_max,
		|	ТаблицаТарифов.tariff_name КАК tariff_name,
		|	ТарифыСДЭКИМ.Ссылка КАК ТарифВБазе,
		|	ТаблицаТарифов.delivery_mode КАК delivery_mode
		|ИЗ
		|	ТаблицаТарифов КАК ТаблицаТарифов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТарифыСДЭКИМ КАК ТарифыСДЭКИМ
		|		ПО ((ВЫРАЗИТЬ(ТаблицаТарифов.tariff_code КАК СТРОКА(20))) = ТарифыСДЭКИМ.КодТарифа)";
	
	Запрос.УстановитьПараметр("ТаблицаТарифов" , ТЗРезультат.Выгрузить());
	
	ТЗРезультат.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
 
Функция РассчитатьСтоимостьНаСервере(СтрокаЗапроса, РежимДоставки)
	
	ЕстьОтбор = РежимДоставки <> 0;
	Попытка
		
		Токен = "Bearer "+ Константы.СДЭКТокен.Получить();
		HTTPСоединение = Новый HTTPСоединение(URL, , , , , , Новый ЗащищенноеСоединениеOpenSSL(), );
		HTTPЗапрос = Новый HTTPЗапрос("/v2/calculator/tarifflist/");
		
		HTTPЗапрос.Заголовки.Вставить("Authorization", Токен); 
	    HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса); 
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
		
		Поток = Ответ.ПолучитьТелоКакПоток();
		Кодировка = "utf-8"; 

		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.ОткрытьПоток(Поток, Кодировка); 
		Результат = ПрочитатьJSON(ЧтениеJSON);
		ОтветСервера = Ответ.ПолучитьТелоКакСтроку("UTF-8"); // ЧтениеJSON.Закрыть();
		
		Если ТипЗнч(Результат) = Тип("Структура") 
			И Результат.Свойство("requests") Тогда
			
			request = Результат.requests[0];
			Если request.state = "INVALID"
				И request.type = "AUTH" Тогда
				АвторизацияНаСервере();
				Возврат Истина;
			КонецЕсли; 
				 
		КонецЕсли;
		
		Если ТипЗнч(Результат) = Тип("Структура") 
			И Результат.Свойство("tariff_codes") Тогда
			
			tariff_codes = Результат.tariff_codes;
			Если ТипЗнч(tariff_codes) = Тип("Массив") Тогда
				Для каждого Тариф Из tariff_codes Цикл
					Если ЕстьОтбор Тогда
						Если Тариф.delivery_mode = РежимДоставки Тогда
							СтрокаТЗ = ТЗРезультат.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаТЗ, Тариф);
						КонецЕсли;
					Иначе
						СтрокаТЗ = ТЗРезультат.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТЗ, Тариф);
					КонецЕсли; 
				КонецЦикла; 	
			КонецЕсли;
			
		КонецЕсли;
		
		Request = СериализацияЗначения(СтрокаЗапроса);
	    ПреобразоватьИЗаписатьЛог(Request, Результат, ОтветСервера, "СДЭК запрос тарифов", "Заявка "+Заявка.Номер);
		
	Исключение
		
		Request = СериализацияЗначения(ОписаниеОшибки());
	    ПреобразоватьИЗаписатьЛог(Request, Результат, ОтветСервера, "СДЭК запрос тарифов", "Заявка "+Заявка.Номер);
		
        Сообщить(ОписаниеОшибки());
		
    КонецПопытки;

	Возврат Ложь;
	
КонецФункции

Функция СериализацияЗначения(ЗначениеПараметра)
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("СписокXDTO")
		 Или ТипЗнч(ЗначениеПараметра) = Тип("ОбъектXDTO")
		 Или ТипЗнч(ЗначениеПараметра) = Тип("ЗначениеXDTO") Тогда
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ЗначениеПараметра);
		Результат = ЗаписьXML.Закрыть();
	Иначе
		Результат = XMLСтрока(ЗначениеПараметра);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьИЗаписатьЛог(Request, Response, ResponseСтрокой, ИмяМетода, НаименованиеЛога)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	Попытка
		ЗаписатьJSON(ЗаписьJSON, Response);
		ОтветСДЭК = ЗаписьJSON.Закрыть();
	Исключение
	    ОтветСДЭК = ResponseСтрокой;
	КонецПопытки; 
	
	
	ЗаписатьЛог(НаименованиеЛога, Request, ОтветСДЭК, ИмяМетода, Заявка);
		
КонецФункции
 
Процедура ЗаписатьЛог(НаименованиеЛога, Request, Response, ИмяМетода, Основание)

	ЛогЗаписи = Справочники.ЛогиОбменовСВнешнимиСистемами.СоздатьЗапись(НаименованиеЛога);
	ЛогЗаписи.ДобавитьПараметр("Request", Request);
	ЛогЗаписи.ДобавитьПараметр("Response", Response);
	ЛогЗаписи.ТипДанных = ИмяМетода;
	ЛогЗаписи.Основание = Основание;
	ЛогЗаписи.Записать();   		

КонецПроцедуры

Функция ПолучитьДанныеЗаказа()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПартнерыКонтактнаяИнформация.НомерТелефона) КАК НомерТелефона
		|ПОМЕСТИТЬ ТелефонПартнера
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.Ссылка = &Партнер
		|	И ПартнерыКонтактнаяИнформация.Тип = &Тип
		|	И ПартнерыКонтактнаяИнформация.Вид = &Вид
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаНаДоставку.Комментарий КАК comment,
		|	ЗаявкаНаДоставку.Партнер.Наименование КАК ПартнерНаименование,
		|	""ООО Бабочка"" КАК Отправитель,
		|	ЗаявкаНаДоставку.НомерПоДаннымКлиента КАК number,
		|	ЕСТЬNULL(ЗаявкаНаДоставку.СДЭКГородДоставки.КодГорода, 0) КАК ГородДоставкиКод,
		|	ЕСТЬNULL(ЗаявкаНаДоставку.СДЭКГородДоставки.Наименование, """") КАК ГородДоставкиНаименование,
		|	ВЫРАЗИТЬ(ЗаявкаНаДоставку.АдресДоставки КАК СТРОКА(255)) КАК АдресДоставки,
		|	ЗаявкаНаДоставку.НаложенныйПлатеж КАК НаложенныйПлатеж,
		|	ЗаявкаНаДоставку.СтраховатьГруз КАК СтраховатьГруз,
		|	ЕСТЬNULL(ТелефонПартнера.НомерТелефона, """") КАК НомерТелефона,
		|	ЕСТЬNULL(ЗаявкаНаДоставку.СДЭКВыбранныйТариф.КодТарифа, 0) КАК КодТарифа,
		|	ЗаявкаНаДоставку.СДЭКДопУслуги КАК СДЭКДопУслуги,
		|	ЗаявкаНаДоставку.ПримечаниеТК КАК ПримечаниеТК
		|ИЗ
		|	Документ.ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТелефонПартнера КАК ТелефонПартнера
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ЗаявкаНаДоставку.Ссылка = &Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаНаДоставкуТовары.Номенклатура.Код КАК ware_key,
		|	ЗаявкаНаДоставкуТовары.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ЗаявкаНаДоставкуТовары.Характеристика.НаименованиеПолное, """") КАК name,
		|	ЗаявкаНаДоставкуТовары.Сумма КАК cost,
		|	ЗаявкаНаДоставкуТовары.Количество КАК amount,
		|	700 КАК weight,
		|	ЗаявкаНаДоставкуТовары.Место КАК Место,
		|	ЗаявкаНаДоставкуТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция)
		|		ИЛИ ЗаявкаНаДоставкуТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Духи)
		|		ИЛИ ЗаявкаНаДоставкуТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность)
		|		ИЛИ ЗаявкаНаДоставкуТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПродукцияМаркируемаяДляГИСМ) КАК МаркируемыйТовар,
		|	ЗаявкаНаДоставкуТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПродукцияМаркируемаяДляГИСМ) КАК ЭтоМех,
		|	ЗаявкаНаДоставкуТовары.Номенклатура КАК Номенклатура,
		|	ЗаявкаНаДоставкуТовары.Характеристика КАК Характеристика,
		|	ЗаявкаНаДоставкуТовары.Заказ КАК Заказ,
		|	ЗаявкаНаДоставкуТовары.Номенклатура.Код КАК НоменклатураКод
		|ИЗ
		|	Документ.ЗаявкаНаДоставку.Товары КАК ЗаявкаНаДоставкуТовары
		|ГДЕ
		|	ЗаявкаНаДоставкуТовары.Ссылка = &Заявка
		|ИТОГИ ПО
		|	Место
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаркируемыеТоварыВЗаказеКлиента.ЗаказКлиента КАК ЗаказКлиента,
		|	МаркируемыеТоварыВЗаказеКлиента.Номенклатура КАК Номенклатура,
		|	МаркируемыеТоварыВЗаказеКлиента.Характеристика КАК Характеристика,
		|	МаркируемыеТоварыВЗаказеКлиента.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	МаркируемыеТоварыВЗаказеКлиента.Серия КАК Серия
		|ИЗ
		|	РегистрСведений.МаркируемыеТоварыВЗаказеКлиента КАК МаркируемыеТоварыВЗаказеКлиента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаДоставку.Товары КАК ЗаявкаНаДоставкуТовары
		|		ПО МаркируемыеТоварыВЗаказеКлиента.ЗаказКлиента = ЗаявкаНаДоставкуТовары.Заказ
		|			И МаркируемыеТоварыВЗаказеКлиента.Номенклатура = ЗаявкаНаДоставкуТовары.Номенклатура
		|			И МаркируемыеТоварыВЗаказеКлиента.Характеристика = ЗаявкаНаДоставкуТовары.Характеристика
		|ГДЕ
		|	ЗаявкаНаДоставкуТовары.Ссылка = &Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЗаявкаНаДоставкуТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.ЗаявкаНаДоставку.Товары КАК ЗаявкаНаДоставкуТовары
		|ГДЕ
		|	ЗаявкаНаДоставкуТовары.Ссылка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("ВидНоменклатурыУслуги", Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуги"));
	Запрос.УстановитьПараметр("Партнер", Заявка.Партнер);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = РезультатЗапроса[1].Выбрать();
	ВыборкаТовары = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТЗМаркировка = РезультатЗапроса[3].Выгрузить();
	ВыборкаКоличествоТоваров = РезультатЗапроса[4].Выбрать();
	
	Если ВыборкаКоличествоТоваров.Следующий() Тогда
		КоличествоТоваров = ВыборкаКоличествоТоваров.Количество;
	Иначе
		КоличествоТоваров = 0;
	КонецЕсли; 
	
	Возврат Новый Структура("ВыборкаШапка, ВыборкаТовары, ТЗМаркировка, КоличествоТоваров", ВыборкаШапка, ВыборкаТовары, ТЗМаркировка, КоличествоТоваров);
	
КонецФункции

&НаСервере
Процедура АвторизацияНаСервере()
	
	Если ОтправлятьНаТестовыйСервер Тогда
		Account 	= "EMscd6r9JnFiQ3bLoyjJY6eM78JrJceI";//Константы._Account.Получить();
		Password 	= "PjLZkKBHEiLK3YsjtNrt3TGNG0ahs3kG"; //Константы._Secure_password.Получить();
		Grant_type 	= "client_credentials";
	Иначе	
		Account 	= Константы.СДЭКAccount.Получить();
		Password 	= Константы.СДЭКSecure_password.Получить();
		Grant_type 	= "client_credentials";
	КонецЕсли; 
	
	HTTPСоединение = Новый HTTPСоединение(URL, , , , , , Новый ЗащищенноеСоединениеOpenSSL(), );
	СтрокаПараметров = "grant_type="+Grant_type+"&client_id=" +Account+"&client_secret="+Password;
	HTTPЗапрос = Новый HTTPЗапрос("/v2/oauth/token?"+СтрокаПараметров);

	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);

	Поток = Ответ.ПолучитьТелоКакПоток();
	Кодировка = "utf-8"; 

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(Поток, Кодировка); 
	Результат = ПрочитатьJSON(ЧтениеJSON);
	Если ТипЗнч(Результат) = Тип("Структура") 
		И Результат.Свойство("access_token") Тогда
		
		Константы.СДЭКТокен.Установить(Результат.access_token);
		
	КонецЕсли; 

	ОтветСервера = Ответ.ПолучитьТелоКакСтроку("UTF-8"); // ЧтениеJSON.Закрыть();

КонецПроцедуры

&НаСервере
Функция СформироватьТекстЗапросаВозвратДляРасчета()
	
	РезОтправка = Новый Структура();
	РезОтправка.Вставить("type", 1);
	РезОтправка.Вставить("currency", 1);
	
	from_location = Новый Структура();
	from_location.Вставить("code", Заявка.СДЭКГородДоставки.КодГорода);
	РезОтправка.Вставить("from_location", from_location);
	
	to_location = Новый Структура();
	to_location.Вставить("code", 	137);
	to_location.Вставить("address", Бабочка.ПолучитьЗначениеДинамическихНастроек("СДЭК_Адрес","СПБ, Невский проспект, д.153, ИМ Бабочка"));
	РезОтправка.Вставить("to_location", to_location);
	
	packages = Новый Массив;
	
	Упаковка = Новый Структура();
	
	Упаковка.Вставить("height", 17);
	Упаковка.Вставить("length", 42);
	Упаковка.Вставить("width", 33);
	Упаковка.Вставить("weight", 1 * 700);
	
	packages.Добавить(Упаковка);
	
	РезОтправка.Вставить("packages", packages);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, РезОтправка);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции
 
Функция СформироватьТекстЗапросаДляРасчета()
	
	Результат = ПолучитьДанныеЗаказа(); 
	ВыборкаШапка = Результат.ВыборкаШапка;
	ВыборкаШапка.Следующий();
	ВыборкаМесто = Результат.ВыборкаТовары;
	
	РезОтправка = Новый Структура();
	РезОтправка.Вставить("type", 1);
	РезОтправка.Вставить("currency", 1);
	
	from_location = Новый Структура();
	from_location.Вставить("code", 137);
	РезОтправка.Вставить("from_location", from_location);
	
	to_location = Новый Структура();
	to_location.Вставить("code", ВыборкаШапка.ГородДоставкиКод);
	to_location.Вставить("address", ВыборкаШапка.АдресДоставки);
	РезОтправка.Вставить("to_location", to_location);
	
	packages = Новый Массив;
	
	Пока ВыборкаМесто.Следующий() Цикл
		
		Упаковка = Новый Структура();
		
		Упаковка.Вставить("height", 17);
		Упаковка.Вставить("length", 42);
		Упаковка.Вставить("width", 33);
		Упаковка.Вставить("weight", Результат.КоличествоТоваров * 700);
		
		packages.Добавить(Упаковка);
	
	КонецЦикла;

	РезОтправка.Вставить("packages", packages);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, РезОтправка);
	
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

&НаКлиенте
Процедура ВыбратьТариф(Команда)
	
	Идентификатор = 0;
	ГалкаУстановлена = Ложь;
	Для каждого СтрокаТЧ Из ТЗРезультат Цикл
		Если СтрокаТЧ.Галка Тогда
			Если ГалкаУстановлена Тогда
				ПоказатьПредупреждение(, "Выберите один тариф!" ,, "BABOCHKA");
				Возврат;
			Иначе
				ГалкаУстановлена = Истина;	
				Идентификатор = СтрокаТЧ.ПолучитьИдентификатор();
			КонецЕсли; 
		КонецЕсли; 	
	КонецЦикла; 
	Если НЕ ГалкаУстановлена Тогда
		
		ПоказатьПредупреждение(, "Ни один тариф не выбран!" ,, "BABOCHKA");
		Возврат;
		
	КонецЕсли; 
	
	Ответ = ПолучитьСтруктуруОтвета();
	ВыбранНедопустимыйТипДоставки = ПроверитьЗаполнениеТарифаВБазе(Идентификатор);
	Если ВыбранНедопустимыйТипДоставки Тогда
		ПоказатьПредупреждение(,"Данный тип доставки не поддерживается, обратитесь к администратору.",,"BABOCHKA");	
	КонецЕсли; 
	СтрокаТЗ = ТЗРезультат.НайтиПоИдентификатору(Идентификатор);
	Если СтрокаТЗ <> Неопределено И НЕ ВыбранНедопустимыйТипДоставки Тогда
		ЗаполнитьЗначенияСвойств(Ответ, СтрокаТЗ);
		Закрыть(Ответ);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеТарифаВБазе(Идентификатор)
	
	СтрокаТЗ = ТЗРезультат.НайтиПоИдентификатору(Идентификатор);
	Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ТарифВБазе) Тогда
		
		СоответствиеТарифовДоставки = ПолучитьСоответствиеТарифовДоставки();
		
		ТарифСДЭК = Справочники.ТарифыСДЭКИМ.СоздатьЭлемент();
		ТарифСДЭК.КодТарифа = СтрокаТЗ.tariff_code;
		ТарифСДЭК.Наименование = СтрокаТЗ.tariff_name;
		ТарифСДЭК.Описание = СтрокаТЗ.tariff_description;
		РежиДоставки = СоответствиеТарифовДоставки.Получить(СтрокаТЗ.delivery_mode);
		Если РежиДоставки = Неопределено Тогда
			Возврат Истина;
		КонецЕсли; 
		Если НЕ ЭтоВозврат Тогда
			ТарифСДЭК.Отключен = Истина;
		КонецЕсли; 
		ТарифСДЭК.РежимДоставки = РежиДоставки;
		ТарифСДЭК.Записать();
		
		СтрокаТЗ.ТарифВБазе = ТарифСДЭК.Ссылка;
		
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьСоответствиеТарифовДоставки()
	
	Соответствие = Новый Соответствие();
	Соответствие.Вставить(1, Перечисления._ТипыДоставки.ДверьДверь);
	Соответствие.Вставить(2, Перечисления._ТипыДоставки.ДверьСклад);
	Соответствие.Вставить(3, Перечисления._ТипыДоставки.ДоДвери);
	Соответствие.Вставить(4, Перечисления._ТипыДоставки.ДоСклада);
	
	ВОзврат Соответствие;
	
КонецФункции
 
&НаКлиенте
Функция ПолучитьСтруктуруОтвета()
	
	Результат = Новый Структура();
	Результат.Вставить("ТарифВБазе", ПредопределенноеЗначение("Справочник.ТарифыСДЭКИМ.ПустаяСсылка"));
	
	Возврат Результат;
	
КонецФункции
 