
&ИзменениеИКонтроль("ПолучитьДоговорПоУмолчанию")
Функция ba_ПолучитьДоговорПоУмолчанию(Объект, ХозяйственныеОперации, ДополнительныеПараметрыОтбораДоговоров)

	Если ДополнительныеПараметрыОтбораДоговоров = Неопределено Тогда
		ДополнительныеПараметрыОтбораДоговоров = ДополнительныеПараметрыОтбораДоговоров();
	КонецЕсли;

	СписокПартнеров = Новый СписокЗначений;
	ПартнерыИКонтрагенты.ЗаполнитьСписокПартнераСРодителями(Объект.Партнер, СписокПартнеров);

	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|
	|ГДЕ
	|	(НЕ ДоговорыКонтрагентов.ПометкаУдаления)
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ДоговорыКонтрагентов.Партнер В (&СписокПартнеров)
	|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ((НЕ &ОтборХозяйственныеОперации)
	|			ИЛИ ДоговорыКонтрагентов.ХозяйственнаяОперация В (&ХозяйственныеОперации))
	|	И ((НЕ &ОтборВалютаВзаиморасчетов)
	|			ИЛИ ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов)
	|	И (ДоговорыКонтрагентов.УчетАгентскогоНДС = &УчетАгентскогоНДС)
	|	И ДоговорыКонтрагентов.Ссылка = &ТекущийДоговор
	|	И ((НЕ &ОтборНаправлениеДеятельности)
	|			ИЛИ ДоговорыКонтрагентов.НаправлениеДеятельности = &НаправлениеДеятельности)
	|	И ДоговорыКонтрагентов.ДоговорССамозанятым = &ДоговорССамозанятым
	|	И ((НЕ &ОтборПорядокРасчетов)
	|			ИЛИ ДоговорыКонтрагентов.ПорядокРасчетов = &ПорядокРасчетов)
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|
	|ГДЕ
	|	(НЕ ДоговорыКонтрагентов.ПометкаУдаления)
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ДоговорыКонтрагентов.Партнер В (&СписокПартнеров)
	|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ((НЕ &ОтборХозяйственныеОперации)
	|			ИЛИ ДоговорыКонтрагентов.ХозяйственнаяОперация В (&ХозяйственныеОперации))
	|	И ((НЕ &ОтборВалютаВзаиморасчетов)
	|			ИЛИ ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов)
	|	И (ДоговорыКонтрагентов.УчетАгентскогоНДС = &УчетАгентскогоНДС)
	|	И ((НЕ &ОтборНаправлениеДеятельности)
	|			ИЛИ ДоговорыКонтрагентов.НаправлениеДеятельности = &НаправлениеДеятельности)
	|	И (НЕ &ОтборПорядокОформленияСписанияНедостачТоваровПринятыхНаХранение
	|			ИЛИ ДоговорыКонтрагентов.ПорядокОформленияСписанияНедостачТоваровПринятыхНаХранение =
	|											&ПорядокОформленияСписанияНедостачТоваровПринятыхНаХранение)
	|	И ДоговорыКонтрагентов.ДоговорССамозанятым = &ДоговорССамозанятым
	|	И ((НЕ &ОтборПорядокРасчетов)
	|			ИЛИ ДоговорыКонтрагентов.ПорядокРасчетов = &ПорядокРасчетов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 2
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|
	|ГДЕ
	|	(НЕ ДоговорыКонтрагентов.ПометкаУдаления)
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ДоговорыКонтрагентов.Партнер В (&СписокПартнеров)
	|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|	И ДоговорыКонтрагентов.КомиссионныеПродажи25 = &КомиссионныеПродажи25
	|	И ((НЕ &ОтборВалютаВзаиморасчетов)
	|			ИЛИ ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов)
	|	И (ДоговорыКонтрагентов.УчетАгентскогоНДС = &УчетАгентскогоНДС)
	|	И ((НЕ &ОтборНаправлениеДеятельности)
	|			ИЛИ ДоговорыКонтрагентов.НаправлениеДеятельности = &НаправлениеДеятельности)
	|	И ДоговорыКонтрагентов.ДоговорССамозанятым = &ДоговорССамозанятым
	|	И ((НЕ &ОтборПорядокРасчетов)
	|			ИЛИ ДоговорыКонтрагентов.ПорядокРасчетов = &ПорядокРасчетов)
	|");
	Запрос.УстановитьПараметр("ТекущийДоговор",					Объект.Договор);
	Запрос.УстановитьПараметр("СписокПартнеров",				СписокПартнеров);
	Запрос.УстановитьПараметр("Контрагент",						Объект.Контрагент);
	Запрос.УстановитьПараметр("Организация",					Объект.Организация);
	Запрос.УстановитьПараметр("ОтборХозяйственныеОперации",		ЗначениеЗаполнено(ХозяйственныеОперации));
	Запрос.УстановитьПараметр("ХозяйственныеОперации",			ХозяйственныеОперации);
	Запрос.УстановитьПараметр("ОтборВалютаВзаиморасчетов",		ЗначениеЗаполнено(ДополнительныеПараметрыОтбораДоговоров.ВалютаВзаиморасчетов));
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов",			ДополнительныеПараметрыОтбораДоговоров.ВалютаВзаиморасчетов);
	Запрос.УстановитьПараметр("УчетАгентскогоНДС",				ДополнительныеПараметрыОтбораДоговоров.Налогообложение = Перечисления.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС);
	Запрос.УстановитьПараметр("ОтборНаправлениеДеятельности", 	ДополнительныеПараметрыОтбораДоговоров.НаправлениеДеятельности <> Неопределено
	И ПолучитьФункциональнуюОпцию("ИспользоватьУчетЗатратПоНаправлениямДеятельности"));
	Запрос.УстановитьПараметр("НаправлениеДеятельности",		ДополнительныеПараметрыОтбораДоговоров.НаправлениеДеятельности);
	Запрос.УстановитьПараметр("КомиссионныеПродажи25",			ДополнительныеПараметрыОтбораДоговоров.КомиссионныеПродажи25);
	Запрос.УстановитьПараметр(
	"ПорядокОформленияСписанияНедостачТоваровПринятыхНаХранение",
	ДополнительныеПараметрыОтбораДоговоров.ПорядокОформленияСписанияНедостачТоваровПринятыхНаХранение);
	Запрос.УстановитьПараметр(
	"ОтборПорядокОформленияСписанияНедостачТоваровПринятыхНаХранение",
	ДополнительныеПараметрыОтбораДоговоров.ПорядокОформленияСписанияНедостачТоваровПринятыхНаХранение <> Неопределено);
	Запрос.УстановитьПараметр("ДоговорССамозанятым",			ДополнительныеПараметрыОтбораДоговоров.ДоговорССамозанятым);
	Запрос.УстановитьПараметр("ОтборПорядокРасчетов",			ЗначениеЗаполнено(ДополнительныеПараметрыОтбораДоговоров.ПорядокРасчетов));
	Запрос.УстановитьПараметр("ПорядокРасчетов",				ДополнительныеПараметрыОтбораДоговоров.ПорядокРасчетов);
	
	#Вставка 
	СтруктураМаркаКоллекция = Новый Структура("Марка, Коллекция", Справочники.Марки.ПустаяСсылка(), Справочники.КоллекцииНоменклатуры.ПустаяСсылка());
	
	ЗаполнитьЗначенияСвойств(СтруктураМаркаКоллекция, Объект);
	
	Запрос.УстановитьПараметр("Марка",				СтруктураМаркаКоллекция.Марка);
	Запрос.УстановитьПараметр("Коллекция",			СтруктураМаркаКоллекция.Коллекция);
	
	Если ЗначениеЗаполнено(СтруктураМаркаКоллекция.Марка) Тогда
		
		МаркаИРодитель = Новый Массив;
		МаркаИРодитель.Добавить(СтруктураМаркаКоллекция.Марка);
		
		ГруппаМарка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураМаркаКоллекция.Марка, "Родитель");
		
		Если ЗначениеЗаполнено(ГруппаМарка) Тогда
			МаркаИРодитель.Добавить(ГруппаМарка);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Марка", МаркаИРодитель);
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
	"ДоговорыКонтрагентов.Контрагент = &Контрагент",
	"	ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И ДоговорыКонтрагентов.Марка В (&Марка)
	|	И ДоговорыКонтрагентов.Коллекция = &Коллекция");
	
	#КонецВставки

	МассивРезультатов = Запрос.ВыполнитьПакет();

	Если Не МассивРезультатов[0].Пустой() Тогда

		Выборка = МассивРезультатов[0].Выбрать();
		Выборка.Следующий();

		ДоговорПоУмолчанию = Выборка.Ссылка;

	Иначе
		Выборка = МассивРезультатов[1].Выбрать();

		Если Не Выборка.Следующий() Тогда
			ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		ИначеЕсли Выборка.Количество() = 1 Тогда
			ДоговорПоУмолчанию = Выборка.Ссылка;
		Иначе
			ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;

	Возврат ДоговорПоУмолчанию;

КонецФункции
