
&ИзменениеИКонтроль("ПровестиДокумент")
Процедура ba_ПровестиДокумент(Документ, Отказ, ДопПараметры)

	УстановитьПривилегированныйРежим(Истина); 

	Свойства = СвойстваДокумента(Документ);
	МенеджерДокумента = Документы[Документ.Метаданные().Имя];
	ПроведениеДокументовЛокализация.ПереназначитьМодульПолученияДанныхДокумента(МенеджерДокумента);

	Если ТипЗнч(Документ) = Тип("ДокументОбъект.Сторно") Тогда
		МеханизмыДокумента = УчетныеМеханизмыСторно(Документ);
	Иначе
		МеханизмыДокумента    = УчетныеМеханизмыДокумента(МенеджерДокумента);
	КонецЕсли;
	МеханизмыКонфигурации = УчетныеМеханизмыКонфигурации();

	ЗакрытиеМесяцаСервер.ИнициализироватьПараметрСеансаСформированныеЗадания(Документ);

	РегистрыКРегистрации = Новый Массив;
	ДвижимыеРегистры     = Новый Структура;
	Механизмы            = Новый СписокЗначений;
	Для каждого Механизм Из МеханизмыДокумента Цикл
		МодульМеханизма = ОбщегоНазначения.ОбщийМодуль(МеханизмыКонфигурации[Механизм]);

		ПараметрыМеханизма = МодульМеханизма.ПараметрыДляПроведенияДокумента(Документ, Свойства); // см. ПроведениеДокументов.ПараметрыУчетногоМеханизма
		ПараметрыМеханизма.Вставить("МодульМеханизма", МодульМеханизма);

		Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РегистрыКРегистрации, ПараметрыМеханизма.ПодчиненныеРегистры);

			Для каждого Регистр Из ПараметрыМеханизма.ПодчиненныеРегистры Цикл
				ДвижимыеРегистры.Вставить(Регистр.Имя);
			КонецЦикла;

			Для каждого Регистр Из ПараметрыМеханизма.НезависимыеРегистры Цикл
				ДвижимыеРегистры.Вставить(Регистр.Имя);
			КонецЦикла;

			Если ПараметрыМеханизма.НеоперативноеПроведение = Истина Тогда
				МодульМеханизма.СоздатьЗаданиеДляНеоперативногоПроведенияДокумента(Документ, Свойства);
			КонецЕсли;
		КонецЕсли;

		Механизмы.Добавить(ПараметрыМеханизма, Механизм);
	КонецЦикла;
	Механизмы.СортироватьПоПредставлению();

	ЗаписываемыеРегистры = ПодготовитьНаборыЗаписейКРегистрацииДвижений(Документ, Свойства, РегистрыКРегистрации);

	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ТаблицыДляДвижений = ТаблицыДляДвижений(Документ, МенеджерДокумента, ДвижимыеРегистры, ДопПараметры);
		ОтразитьДвиженияПодчиненныхРегистров(Механизмы, Документ, ТаблицыДляДвижений, Отказ);
	КонецЕсли;

	МенеджерВременныхТаблиц = МенеджерВременныхТаблицКонтроля(Документ);
	УстановитьДопСвойстваКонтрольныхРегистров(Механизмы, Документ, МенеджерВременныхТаблиц);

	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ЗаписатьДвиженияНезависимыхРегистров(Механизмы, Документ, ТаблицыДляДвижений, МенеджерВременныхТаблиц, Отказ);
	КонецЕсли;

	ОбработатьДокументПередЗаписьюДвижений(Механизмы, Документ, МенеджерВременныхТаблиц, Отказ);
	
	#Вставка
	ПересчитатьКомиссиюВДвиженияхВыручкиИСебестоимости(Документ);	
	#КонецВставки

	Документ.Движения.Записать();

	ОбработатьДокументПослеЗаписиДвижений(Механизмы, Документ, МенеджерВременныхТаблиц, Отказ);
	ПроверитьДатуЗапретаПоТаблицеИзменений(Механизмы, Документ, МенеджерВременныхТаблиц, Отказ);
	ВыполнитьКонтрольРезультатовПроведения(Механизмы, Документ, МенеджерВременныхТаблиц, Отказ);

	Если Не Отказ Тогда
		СформироватьЗаданияНаОтложенныеДвижения(Документ, МенеджерВременныхТаблиц, Ложь);
		ОтметитьВыполнениеОбработкиОбновленияПодчиненныхРегистров(ЗаписываемыеРегистры, Документ);
	КонецЕсли;

	ЗакрытиеМесяцаСервер.ПроверитьСформированныеЗаданияПриПроведенииДокумента(Документ, Отказ);

	ЗапуститьВыполнениеЗаданийОперативнойОчереди(Документ, Отказ);
	ПроверитьВыполнитьЗаданияНеоперативнойОчереди(Механизмы, Документ, Отказ);

	МенеджерВременныхТаблиц.Закрыть();

КонецПроцедуры  

Процедура ПересчитатьКомиссиюВДвиженияхВыручкиИСебестоимости(Документ)
	
	Если ТипЗнч(Документ) <> Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписыватьДвиженияВыручкиMarketPlace = Бабочка.ПолучитьЗначениеДинамическихНастроек("ЗаписыватьДвиженияВыручкиMarketPlace", Ложь);
	Если НЕ ЗаписыватьДвиженияВыручкиMarketPlace Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыручка = Документ.Движения.Найти("ВыручкаИСебестоимостьПродаж");
	Если ДвиженияВыручка = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТЗ_MP = Новый ТаблицаЗначений;
	ТЗ_MP.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТЗ_MP.Колонки.Добавить("СуммаБезНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТЗ_MP.Колонки.Добавить("АналитикаУчетаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаНоменклатуры"));
	
	ТЗ_Реализация = Новый ТаблицаЗначений;
	ТЗ_Реализация.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТЗ_Реализация.Колонки.Добавить("СуммаБезНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТЗ_Реализация.Колонки.Добавить("АналитикаУчетаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаНоменклатуры"));
	
	ПериодЗаписи = Документ.Дата;
	
	Для Каждого Запись Из ДвиженияВыручка Цикл
		
		Номенклатура = Запись.АналитикаУчетаНоменклатуры.Номенклатура;
		
		Если Номенклатура.ЭтоMarketPlace Тогда
			НоваяСтрока = ТЗ_MP.Добавить();
			НоваяСтрока.Сумма = Запись.СуммаВыручки;
			НоваяСтрока.СуммаБезНДС = Запись.СуммаВыручкиБезНДС;
			НоваяСтрока.АналитикаУчетаНоменклатуры = Запись.АналитикаУчетаНоменклатуры;
			ПериодЗаписи = Запись.Период;
		ИначеЕсли Номенклатура.Реализация Тогда
			НоваяСтрока = ТЗ_Реализация.Добавить();
			НоваяСтрока.Сумма = Запись.СуммаВыручки;
			НоваяСтрока.СуммаБезНДС = Запись.СуммаВыручкиБезНДС;
			НоваяСтрока.АналитикаУчетаНоменклатуры = Запись.АналитикаУчетаНоменклатуры;
			ПериодЗаписи = Запись.Период;
		КонецЕсли;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Исх.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Исх.Сумма КАК Сумма,
		|	Исх.СуммаБезНДС КАК СуммаБезНДС
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	&ВТ КАК Исх
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Данные.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	Ключи.Номенклатура КАК Номенклатура,
		|	Ключи.Номенклатура.Марка КАК Марка,
		|	Ключи.Номенклатура.Партнер_MarketPlace КАК Партнер,
		|	ВТ_Данные.Сумма КАК Сумма,
		|	ВТ_Данные.СуммаБезНДС КАК СуммаБезНДС
		|ПОМЕСТИТЬ ВТ_Аналитика
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
		|		ПО ВТ_Данные.АналитикаУчетаНоменклатуры = Ключи.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Аналитика.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	МАКСИМУМ(КомиссияМП.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_МаксимальныйПериод
		|ИЗ
		|	ВТ_Аналитика КАК ВТ_Аналитика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентыКомиссии_MarketPlace.СрезПоследних(&ДатаДокумента, ) КАК КомиссияМП
		|		ПО ВТ_Аналитика.Марка = КомиссияМП.Марка
		|			И (ВТ_Аналитика.Номенклатура = КомиссияМП.Номенклатура
		|				ИЛИ КомиссияМП.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
		|			И ВТ_Аналитика.Партнер = КомиссияМП.Партнер
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Аналитика.АналитикаУчетаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Аналитика.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ВТ_Аналитика.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕстьКомиссияПоНоменклатуре.Сумма ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьКомиссияПоТовару,
		|	ВТ_Аналитика.СуммаБезНДС КАК СуммаБезНДС,
		|	ВТ_Аналитика.Марка КАК Марка,
		|	ВТ_Аналитика.Партнер КАК Партнер
		|ПОМЕСТИТЬ ВТ_СУсловиемПоКомиссии
		|ИЗ
		|	ВТ_Аналитика КАК ВТ_Аналитика
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_Аналитика.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|			ВТ_Аналитика.Сумма КАК Сумма
		|		ИЗ
		|			ВТ_Аналитика КАК ВТ_Аналитика
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентыКомиссии_MarketPlace.СрезПоследних(&ДатаДокумента, ) КАК КомиссияМП
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксимальныйПериод КАК ВТ_МаксимальныйПериод
		|					ПО КомиссияМП.Период = ВТ_МаксимальныйПериод.Период
		|				ПО ВТ_Аналитика.Номенклатура = КомиссияМП.Номенклатура) КАК ЕстьКомиссияПоНоменклатуре
		|		ПО ВТ_Аналитика.АналитикаУчетаНоменклатуры = ЕстьКомиссияПоНоменклатуре.АналитикаУчетаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СУсловиемПоКомиссии.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ВТ_СУсловиемПоКомиссии.Сумма - ВТ_СУсловиемПоКомиссии.Сумма * КомиссияМП.ПроцентКомиссии / 100 КАК СуммаЗакупки,
		|	ЕСТЬNULL(КомиссияМП.ПроцентКомиссии, 0) КАК ПроцентКомиссии,
		|	ВТ_СУсловиемПоКомиссии.СуммаБезНДС * КомиссияМП.ПроцентКомиссии / 100 КАК Маржа,
		|	ВТ_СУсловиемПоКомиссии.ЕстьКомиссияПоТовару КАК ЕстьКомиссияПоТовару,
		|	КомиссияМП.Номенклатура КАК Номенклатура,
		|	ВТ_МаксимальныйПериод.Период КАК Период
		|ИЗ
		|	ВТ_СУсловиемПоКомиссии КАК ВТ_СУсловиемПоКомиссии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентыКомиссии_MarketPlace.СрезПоследних(&ДатаДокумента, ) КАК КомиссияМП
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксимальныйПериод КАК ВТ_МаксимальныйПериод
		|			ПО КомиссияМП.Период = ВТ_МаксимальныйПериод.Период
		|		ПО ВТ_СУсловиемПоКомиссии.Марка = КомиссияМП.Марка
		|			И ВТ_СУсловиемПоКомиссии.Партнер = КомиссияМП.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсхКомиссия.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ИсхКомиссия.Сумма КАК Сумма,
		|	ИсхКомиссия.СуммаБезНДС КАК СуммаБезНДС
		|ПОМЕСТИТЬ ВТ_Комиссия
		|ИЗ
		|	&ВТ_Комиссия КАК ИсхКомиссия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Комиссия.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ВТ_Комиссия.Сумма - ВТ_Комиссия.Сумма * КомиссияТовары.ПроцентКомиссии / 100 КАК СуммаЗакупки,
		|	ЕСТЬNULL(КомиссияТовары.ПроцентКомиссии, 0) КАК ПроцентКомиссии,
		|	ВТ_Комиссия.СуммаБезНДС * КомиссияТовары.ПроцентКомиссии / 100 КАК Маржа
		|ИЗ
		|	ВТ_Комиссия КАК ВТ_Комиссия
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцентыКомиссии_КомиссионныеТовары.СрезПоследних(&ДатаДокумента, ) КАК КомиссияТовары
		|		ПО (ВЫРАЗИТЬ(ВТ_Комиссия.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура.Марка = КомиссияТовары.Марка)";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ПериодЗаписи);
	Запрос.УстановитьПараметр("ВТ", ТЗ_MP);
	Запрос.УстановитьПараметр("ВТ_Комиссия", ТЗ_Реализация);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТЗСуммаЗакупкиМР = РезультатЗапроса[4].Выгрузить();
	ТЗСуммаЗакупкиКомиссия = РезультатЗапроса[6].Выгрузить();
	
	Для Каждого Запись Из ДвиженияВыручка Цикл
		
		Проверено = Ложь;
		
		НайденнаяСтрока = ТЗСуммаЗакупкиМР.Найти(Запись.АналитикаУчетаНоменклатуры, "АналитикаУчетаНоменклатуры");
		Если НайденнаяСтрока <> Неопределено Тогда
			Запись["СуммаЗакупкиКомиссия"] = НайденнаяСтрока.СуммаЗакупки;
			Запись["МаржаКомиссия"] = НайденнаяСтрока.Маржа;
			Запись["ПроцентКомиссии"] = НайденнаяСтрока.ПроцентКомиссии;
			Проверено = Истина;
		КонецЕсли;
		
		Если НЕ Проверено Тогда
			НайденнаяСтрока = ТЗСуммаЗакупкиКомиссия.Найти(Запись.АналитикаУчетаНоменклатуры, "АналитикаУчетаНоменклатуры");
			Если НайденнаяСтрока <> Неопределено Тогда
				Запись["СуммаЗакупкиКомиссия"] = НайденнаяСтрока.СуммаЗакупки;
				Запись["МаржаКомиссия"] = НайденнаяСтрока.Маржа;
				Запись["ПроцентКомиссии"] = НайденнаяСтрока.ПроцентКомиссии;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
