
&Перед("ЗаполнитьПоВозвратуТоваровОтКлиента")
Процедура ba_ЗаполнитьПоВозвратуТоваровОтКлиента(Знач ДокументОснование, ДанныеЗаполнения)
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента")
		Или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
		
		Если Не ДокументОснование.ВернутьДеньги Тогда
			ВызватьИсключение НСтр("ru='Возврат денег не утвержден.'");
			Возврат;
		КонецЕсли;
		
		Если Не ТребуетсяРКО(ДокументОснование) Тогда
			ВызватьИсключение НСтр("ru='Не требуется создание документа РКО. Деньги уже возвращены.'");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Функция ТребуетсяРКО(ДокументОснование)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыСКлиентамиОстатки.КОплатеОстаток КАК КОплатеОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки(, ЗаказКлиента = &Заказ) КАК РасчетыСКлиентамиОстатки";
	
	Запрос.УстановитьПараметр("Заказ", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КОплатеОстаток <> 0;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

&После("ИнициализироватьДокумент")
Процедура ba_ИнициализироватьДокумент(ДанныеЗаполнения)
	Подразделение = Бабочка.ПолучитьПодразделение();
КонецПроцедуры

