
&НаКлиенте
Процедура ЗаказКлиента(Команда)
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПодобратьЗавершение", ЭтотОбъект);	
	ОткрытьФорму("Документ.ЗаказКлиента.ФормаВыбора", ПараметрыФормы, ,,,, ОповещениеОЗакрытии);

КонецПроцедуры

&НаКлиенте
Процедура ПодобратьЗавершение(РезультатЗакрытия, Дополнительныепараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	ПоместитьРезультатЗакрытияВоВременноеХранилище(РезультатЗакрытия);
	
	Закрыть(ПриЗакрытииНаСервере_Результат());
	
КонецПроцедуры

&НаСервере
Функция ПоместитьРезультатЗакрытияВоВременноеХранилище(РезультатЗакрытия)
	 АдресВХ = ПоместитьВоВременноеХранилище(РезультатЗакрытия, Новый УникальныйИдентификатор());
КонецФункции
 

&НаСервере
Функция ПриЗакрытииНаСервере_Результат()
	
	Результат = Новый Структура();
	Результат.Вставить("АдресВХРезультатЗакрытия", АдресВХ);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЧекККМ(Команда)
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПодобратьЗавершение", ЭтотОбъект);	
	ОткрытьФорму("Документ.ЧекККМ.ФормаВыбора", ПараметрыФормы, ,,,, ОповещениеОЗакрытии);

КонецПроцедуры


&НаКлиенте
Процедура ПеремещениеТоваров(Команда)
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПодобратьЗавершение", ЭтотОбъект);	
	ОткрытьФорму("Документ.ПеремещениеТоваров.ФормаВыбора", ПараметрыФормы, ,,,, ОповещениеОЗакрытии);

КонецПроцедуры


&НаКлиенте
Процедура ВозвратТоваровПоставщику(Команда)
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПодобратьЗавершение", ЭтотОбъект);	
	ОткрытьФорму("Документ.ВозвратТоваровПоставщику.ФормаВыбора", ПараметрыФормы, ,,,, ОповещениеОЗакрытии);


КонецПроцедуры

