#Область ПрограммныйИнтерфейс

Функция ПроверкаНаСотрудника()

	Папка = Партнер.ДополнительныеРеквизиты.Найти(
		ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("папка в 10.3"),
		"Свойство");

	Если Папка <> Неопределено Тогда
		Если Папка.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Сотрудники")
			И РучнаяСкидка
			И НЕ РазрешеноРуководством Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

&После("ИнициализироватьДокумент")
Процедура ba_ИнициализироватьДокумент(ДанныеЗаполнения)
	Подразделение = Бабочка.ПолучитьПодразделение();
КонецПроцедуры

&Перед("ОбработкаПроведения")
Процедура ba_ОбработкаПроведения(Отказ, РежимПроведения)

	// Для ручной скидки по сотруднику требуется подтверждение руководства.
	Если НЕ ПроверкаНаСотрудника() Тогда
		Отказ = Истина;
		Сообщить("Для ручной скидки сотруднику требуется подтверждение руководства.");
	КонецЕсли;

	Если РучнаяСкидка И СтрДлина(СокрЛП(Комментарий)) < 10 Тогда
		Отказ = Истина;
		Сообщить("При ручной скидке заполните комментарий длиной не менее 10 символов.");
	КонецЕсли;

КонецПроцедуры

&После("ПередЗаписью")
Процедура ba_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	УстановитьПривилегированныйРежим(Истина);
	СО = ВалютнаяОплата.Количество() <> 0;

	Для Каждого Стр Из ПодарочныеСертификаты Цикл
		Если Стр.ПодарочныйСертификат.СО Тогда
			СО = Истина;
		КонецЕсли;
	КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&Перед("ПриКопировании")
Процедура ba_ПриКопировании(ОбъектКопирования)
	РазрешеноРуководством = Ложь;
КонецПроцедуры

#КонецОбласти
