
функция проверканасотрудника()
	папка = Партнер.ДополнительныеРеквизиты.Найти(планывидовхарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("папка в 10.3"),"Свойство");
	если папка <> неопределено тогда
		если папка.значение = справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Сотрудники") 
				и РучнаяСкидка и не РазрешеноРуководством тогда
			возврат ложь;
		иначе 
			возврат истина;
		конецесли;
	иначе
		возврат истина;
	конецесли;
	
конецфункции

&После("ИнициализироватьДокумент")
Процедура ba_ИнициализироватьДокумент(ДанныеЗаполнения)
	//++babochka
	Подразделение = Бабочка.ПолучитьПодразделение(); 
	//--babochka
КонецПроцедуры

&Перед("ОбработкаПроведения")
Процедура ba_ОбработкаПроведения(Отказ, РежимПроведения)
		//++babochka
	//при ручной скидке должен быть комментарий 
	если не проверканасотрудника() тогда
		отказ = истина;
		Сообщить("Требуется подтверждение руководства");	
	конецесли;
	если ручнаяскидка и стрдлина(сокрлп(комментарий)) < 10  тогда 
		отказ = истина;
		Сообщить("Мы за вами наблюдаем");
	конецесли;
	//--babochka
КонецПроцедуры

&После("ПередЗаписью")
Процедура ba_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//++babochka
	установитьпривилегированныйрежим(истина);
	если ВалютнаяОплата.Количество() <> 0 тогда
		СО = истина;
	иначе
		СО = ложь;
	конецесли;
	
	для каждого стр из ПодарочныеСертификаты цикл
		если стр.подарочныйсертификат.со = истина тогда
			СО = истина;
		конецесли;
	конеццикла;
	установитьпривилегированныйрежим(ложь);
	//--babochka
КонецПроцедуры

&Перед("ПриКопировании")
Процедура ba_ПриКопировании(ОбъектКопирования)
	//++babochka
	РазрешеноРуководством  = Ложь;
	//--babochka
КонецПроцедуры
