//добавлена возможность сканирования в док Заказ на внутр потребление
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаказКлиента") 
		И ЗначениеЗаполнено(Параметры.ЗаказКлиента) Тогда
		
		Запись.ЗаказКлиента = Параметры.ЗаказКлиента;
		УстановитьСписокВыбораНоменклатуры(Параметры.ЗаказКлиента);
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

Процедура УстановитьУсловноеОформление()
	
	Если ЗначениеЗаполнено(Запись.Номенклатура)
		И (Запись.Номенклатура.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция
			ИЛИ Запись.Номенклатура.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.Духи
			ИЛИ Запись.Номенклатура.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность) Тогда
		
		Элементы.ШтрихкодУпаковки.Видимость = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(Запись.Номенклатура)
		И (Запись.Номенклатура.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ПродукцияМаркируемаяДляГИСМ
			ИЛИ Запись.Номенклатура.ВидНоменклатуры.ЭтоЮвелирнаяПродукция) Тогда
		
		Элементы.Серия.Видимость = Истина;
		
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьСписокВыбораНоменклатуры(ЗаказКлиента)
	
	МассивМаркируемыхТоваров = МассивМаркируемыхТоваров(ЗаказКлиента);
	
	Если МассивМаркируемыхТоваров <> Неопределено
		И МассивМаркируемыхТоваров.Количество() = 1 Тогда
		
		Запись.Номенклатура = МассивМаркируемыхТоваров[0];
		УстановитьУсловноеОФормление();
		УстановитьСписокВыбораХарактеристики();
		
	ИначеЕсли МассивМаркируемыхТоваров <> Неопределено Тогда
		
		Элементы.Номенклатура.РежимВыбораИзСписка = Истина;
		Элементы.Номенклатура.СписокВыбора.ЗагрузитьЗначения(МассивМаркируемыхТоваров);
		
	КонецЕсли;
	
КонецПроцедуры

Функция МассивМаркируемыхТоваров(ЗаказКлиента)
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ЗаказКлиента) = тип("ДокументСсылка.ЗаказКлиента") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|ГДЕ
			|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
			|	И (ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция)
			|			ИЛИ ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.КиЗГИСМ)
			|			ИЛИ ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Духи)
			|			ИЛИ ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность))
			|	И НЕ ЗаказКлиентаТовары.Отменено";
		
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказНаВнутреннееПотреблениеТовары.Номенклатура КАК Номенклатура
			|ИЗ
			|	Документ." + "ЗаказНаВнутреннееПотребление.Товары КАК ЗаказНаВнутреннееПотреблениеТовары
			|ГДЕ
			|	ЗаказНаВнутреннееПотреблениеТовары.Ссылка = &ЗаказКлиента
			|	И (ЗаказНаВнутреннееПотреблениеТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция)
			|			ИЛИ ЗаказНаВнутреннееПотреблениеТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.КиЗГИСМ)
			|			ИЛИ ЗаказНаВнутреннееПотреблениеТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Духи)
			|			ИЛИ ЗаказНаВнутреннееПотреблениеТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность))
			|	И НЕ ЗаказНаВнутреннееПотреблениеТовары.Отменено";

	КонецЕсли;

	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	УстановитьУсловноеОФормление();
	
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		УстановитьСписокВыбораХарактеристики();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСписокВыбораХарактеристики()
	
	МассивХарактеристик = МассивХарактеристик();
	
	Если МассивХарактеристик <> Неопределено 
		И МассивХарактеристик.Количество() = 1 Тогда
		
		Запись.Характеристика = МассивХарактеристик[0];
		
	ИначеЕсли МассивХарактеристик <> Неопределено Тогда
		
		Элементы.Характеристика.РежимВыбораИзСписка = Истина;
		Элементы.Характеристика.СписокВыбора.ЗагрузитьЗначения(МассивХарактеристик);
		
	КонецЕсли;
	
КонецПроцедуры

Функция МассивХарактеристик()
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Запись.ЗаказКлиента) = тип("ДокументСсылка.ЗаказКлиента") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказКлиентаТовары.Характеристика КАК Характеристика
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|ГДЕ
			|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
			|	И (ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета = Значение(Перечисление.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция)
			|			ИЛИ ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета = Значение(Перечисление.ОсобенностиУчетаНоменклатуры.КиЗГИСМ)
			|			ИЛИ ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета = Значение(Перечисление.ОсобенностиУчетаНоменклатуры.Духи)
			|			ИЛИ ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета = Значение(Перечисление.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность))
			|	И НЕ ЗаказКлиентаТовары.Отменено";
		
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказНаВнутреннееПотреблениеТовары.Характеристика КАК Характеристика
			|ИЗ
			|	Документ." + "ЗаказНаВнутреннееПотребление.Товары КАК ЗаказНаВнутреннееПотреблениеТовары
			|ГДЕ
			|	ЗаказНаВнутреннееПотреблениеТовары.Ссылка = &ЗаказКлиента
			|	И (ЗаказНаВнутреннееПотреблениеТовары.Номенклатура.ОсобенностьУчета = Значение(Перечисление.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция)
			|			ИЛИ ЗаказНаВнутреннееПотреблениеТовары.Номенклатура.ОсобенностьУчета = Значение(Перечисление.ОсобенностиУчетаНоменклатуры.КиЗГИСМ)
			|			ИЛИ ЗаказНаВнутреннееПотреблениеТовары.Номенклатура.ОсобенностьУчета = Значение(Перечисление.ОсобенностиУчетаНоменклатуры.Духи)
			|			ИЛИ ЗаказНаВнутреннееПотреблениеТовары.Номенклатура.ОсобенностьУчета = Значение(Перечисление.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность))
			|	И НЕ ЗаказНаВнутреннееПотреблениеТовары.Отменено";

	КонецЕсли;


	Запрос.УстановитьПараметр("ЗаказКлиента", Запись.ЗаказКлиента);
	Запрос.УстановитьПараметр("Номенклатура", Запись.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Характеристика");
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

