
Процедура ЗаполнитьШтрихкодыУпаковокТоваровЧекККМ(Знач ДокументОснование, Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекККМАкцизныеМарки.АкцизнаяМарка КАК ШтрихкодУпаковки,
		|	ЧекККМАкцизныеМарки.АкцизнаяМарка.ЗначениеШтрихкода КАК ЗначениеШтрихкода
		|ИЗ
		|	Документ.ЧекККМ.АкцизныеМарки КАК ЧекККМАкцизныеМарки
		|ГДЕ
		|	ЧекККМАкцизныеМарки.Ссылка = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура("Номенклатура, Характеристика", Выборка.ШтрихкодУпаковки.Номенклатура, Выборка.ШтрихкодУпаковки.Характеристика);
		
		СтрокиТоваров = Объект.Товары.НайтиСтроки(Отбор);
		
		Если СтрокиТоваров.Количество() > 0 Тогда 
			ЗаполнитьЗначенияСвойств(Объект.ШтрихкодыУпаковок.Добавить(), Выборка, "ШтрихкодУпаковки, ЗначениеШтрихкода");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&После("ЗаполнитьПараметрыИнициализации")
Процедура ba_ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	//++babochka
	Запрос.УстановитьПараметр("ИспользоватьОрдернуюСхемуПриПоступлении",     Ложь);
	//--babochka
КонецПроцедуры
