
Процедура ЗаполнитьШтрихкодыУпаковокТоваровРеализацияТоваров(Знач ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК ЗначениеШтрихкода
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
		|ГДЕ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура("Номенклатура, Характеристика", Выборка.ШтрихкодУпаковки.Номенклатура, Выборка.ШтрихкодУпаковки.Характеристика);
		
		СтрокиТоваров = Товары.НайтиСтроки(Отбор);

		Если СтрокиТоваров.Количество() > 0 Тогда 
			ЗаполнитьЗначенияСвойств(ШтрихкодыУпаковок.Добавить(), Выборка, "ШтрихкодУпаковки, ЗначениеШтрихкода");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 



Процедура ЗаполнитьШтрихкодыУпаковокТоваровЧекККМ(Знач ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекККМАкцизныеМарки.АкцизнаяМарка КАК ШтрихкодУпаковки,
		|	ЧекККМАкцизныеМарки.АкцизнаяМарка.ЗначениеШтрихкода КАК ЗначениеШтрихкода
		|ИЗ
		|	Документ.ЧекККМ.АкцизныеМарки КАК ЧекККМАкцизныеМарки
		|ГДЕ
		|	ЧекККМАкцизныеМарки.Ссылка = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура("Номенклатура, Характеристика", Выборка.ШтрихкодУпаковки.Номенклатура, Выборка.ШтрихкодУпаковки.Характеристика);
		
		СтрокиТоваров = Товары.НайтиСтроки(Отбор);
		
		Если СтрокиТоваров.Количество() > 0 Тогда 
			ЗаполнитьЗначенияСвойств(ШтрихкодыУпаковок.Добавить(), Выборка, "ШтрихкодУпаковки, ЗначениеШтрихкода");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


&После("ИнициализироватьДокумент")
Процедура ba_ИнициализироватьДокумент(ДанныеЗаполнения)
	Кассир = Пользователи.ТекущийПользователь();
	Подразделение = Бабочка.ПолучитьПодразделение();
КонецПроцедуры


&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура ba_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ЗаполненНаОснованииДокумента	= Ложь;
	ПересчитатьКоличествоПоРНПТ		= Истина;

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);

	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ЗаполнитьПоПереданнойТаре") Тогда
			ЗаполнитьДокументНаОснованииПереданнойТары(ДанныеЗаполнения);

			ЗаполненНаОснованииДокумента	= Истина;
			ПересчитатьКоличествоПоРНПТ		= Ложь;
		ИначеЕсли ДанныеЗаполнения.Свойство("АктОРасхождениях") 
			И ДанныеЗаполнения.Свойство("ОснованиеАкта") Тогда

			Если ТипЗнч(ДанныеЗаполнения.ОснованиеАкта) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				ЗаполнитьДокументНаОснованииАктаПослеОтгрузки(ДанныеЗаполнения);
			ИначеЕсли ТипЗнч(ДанныеЗаполнения.ОснованиеАкта) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
				ЗаполнитьДокументНаОснованииАктаПослеПриемки(ДанныеЗаполнения);
			КонецЕсли;
		ИначеЕсли ДанныеЗаполнения.Свойство("МассивЗаказов") Тогда
			ЗаполнитьПоЗаказу(ДанныеЗаполнения);
		ИначеЕсли ДанныеЗаполнения.Свойство("ЗаполнитьПоРеализацииТоваров") Тогда
			ЗаполнитьДокументНаОснованииРеализацииТоваровИУслуг(ДанныеЗаполнения.ДокументОснование, ДанныеЗаполнения.ПараметрыОформления);
			ЗаполненНаОснованииДокумента = Истина;
		Иначе
			ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
		КонецЕсли;
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ЗаполнитьДокументНаОснованииРеализацииТоваровИУслуг(ДанныеЗаполнения);
		ЗаполненНаОснованииДокумента = Истина;
		#Вставка 
		ЗаполнитьШтрихкодыУпаковокТоваровРеализацияТоваров(ДанныеЗаполнения);
		#КонецВставки
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		ЗаполнитьДокументНаОснованииЗаявкиНаВозвратТоваровОтКлиента(ДанныеЗаполнения);
		ЗаполненНаОснованииДокумента = Истина;

	КонецЕсли;

	ОчиститьСпособОпределенияСебестоимостиИДокументРеализации();

	ВозвратТоваровОтКлиентаЛокализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);

	Если Не ЗаполненНаОснованииДокумента Тогда
		ИнициализироватьУсловияПродаж();
	КонецЕсли;

	ИнициализироватьДокумент(ДанныеЗаполнения);

	ВзаиморасчетыСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);

	БонусныеБаллыСервер.ЗаполнитьБонусныеБаллыВозвратТоваровОтКлиента(ЭтотОбъект);

	Если ПересчитатьКоличествоПоРНПТ Тогда
		ПересчитатьКоличествоРНПТ();
	КонецЕсли;

КонецПроцедуры    



Процедура ПроверитьТаблицуТоваров(Отказ)
	
	ПроверятьВозвратНаСоответствиеТоваровВРаспоряжении = Бабочка.ПолучитьЗначениеДинамическихНастроек("ПроверятьВозвратНаСоответствиеТоваровВРаспоряжении", Ложь);
	Если НЕ ПроверятьВозвратНаСоответствиеТоваровВРаспоряжении Тогда
		Возврат;
	КонецЕсли;
	
	МассивДокументовОснования = Новый Массив;
	МассивДокументовОснования.Добавить(ДокументРеализации);
	МассивДокументовОснования.Добавить(ЧекККМ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
		|	ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.Сумма / РеализацияТоваровУслугТовары.Количество КАК ЧИСЛО(15, 2)) КАК Цена
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка В(&МассивДокументовОснования)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМТовары.Номенклатура,
		|	ЧекККМТовары.Характеристика,
		|	ВЫРАЗИТЬ(ЧекККМТовары.Сумма / ЧекККМТовары.Количество КАК ЧИСЛО(15, 2))
		|ИЗ
		|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		|ГДЕ
		|	ЧекККМТовары.Ссылка В(&МассивДокументовОснования)";
	
	Запрос.УстановитьПараметр("МассивДокументовОснования", МассивДокументовОснования);
	
	ТЗ_ТоварыОснования = Запрос.Выполнить().Выгрузить();
	ТЗ_ТоварыОснования.Индексы.Добавить("Номенклатура, Характеристика, Цена");
	
	Для каждого СтрокаТЧ Из Товары Цикл
		
		Отбор = Новый Структура("Номенклатура, Характеристика, Цена");
		Отбор.Номенклатура 		= СтрокаТЧ.Номенклатура;
		Отбор.Характеристика 	= СтрокаТЧ.Характеристика;
		Отбор.Цена 				= Окр(СтрокаТЧ.Сумма/СтрокаТЧ.Количество, 2);
		
		НайденныеСтроки = ТЗ_ТоварыОснования.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() Тогда 
			НайденнаяСтрока = НайденныеСтроки[0];
			ТЗ_ТоварыОснования.Удалить(НайденнаяСтрока);
		Иначе
			ТекстСообщения = СтрШаблон("Цена позиции в возврате '%1, %2' не соответствуют цене в документе продажи.", СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика);
			Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное);
		КонецЕсли;
		
	КонецЦикла;	
		
КонецПроцедуры


&После("ПередЗаписью")
Процедура ba_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ПроверитьТаблицуТоваров(Отказ);
		
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДокументРеализации)
		И РежимЗаписи <> РежимЗаписиДокумента.Запись Тогда
		Сообщить("Не заполнен документ-основание.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

