
&Вместо("ПрименитьРезультатРасчетаПоБонуснымБаллам")
Процедура ba_ПрименитьРезультатРасчетаПоБонуснымБаллам(Объект, ИмяТЧ, ПримененныеСкидкиНаценки, ИспользоватьОплатуБонуснымиБаллами, РеализацияСверхЗаказа)
	Если ТипЗнч(Объект) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
		ТаблицаБонусныеБаллы = Объект.БонусныеБаллы;
		ИспользоватьКлючСвязи = Ложь;
	Иначе
		ТаблицаБонусныеБаллы = Объект.НачислениеБонусныхБаллов;
		ИспользоватьКлючСвязи = Истина;
	КонецЕсли;

	Если Объект.Партнер = Справочники.Партнеры.РозничныйПокупатель 
		Или Не РеализацияСверхЗаказа Тогда
		
		Если ТаблицаБонусныеБаллы.Количество() > 0 Тогда
			ТаблицаБонусныеБаллы.Очистить();
		КонецЕсли;
		
		Если Объект.Партнер = Справочники.Партнеры.РозничныйПокупатель Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	НачисленныеБонусныеБаллы = БонусныеБаллыСервер.ТаблицаБонусныеБаллы(ПримененныеСкидкиНаценки.ТаблицаСкидкиНаценки, Объект.Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КартыЛояльности.Владелец.БонуснаяПрограммаЛояльности.НеНачислятьБаллыПриОплатеБонусами, Ложь) КАК НеНачислятьБаллыПриОплатеБонусами
	|ИЗ
	|	Справочник.КартыЛояльности КАК КартыЛояльности
	|ГДЕ
	|	КартыЛояльности.Ссылка = &КартаЛояльности";
	
	Запрос.УстановитьПараметр("КартаЛояльности", Объект.КартаЛояльности);
	
	ИспользуетсяОдновременноеСписаниеИНачисление = Ложь;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИспользуетсяОдновременноеСписаниеИНачисление = Не Выборка.НеНачислятьБаллыПриОплатеБонусами;
	КонецЕсли;
	
	БонусныеБаллы = Новый ТаблицаЗначений;
	Если ИспользоватьКлючСвязи Тогда
		БонусныеБаллы.Колонки.Добавить("КлючСвязи",                   Новый ОписаниеТипов("Число"));
	КонецЕсли;
	БонусныеБаллы.Колонки.Добавить("БонуснаяПрограммаЛояльности", Новый ОписаниеТипов("СправочникСсылка.БонусныеПрограммыЛояльности"));
	БонусныеБаллы.Колонки.Добавить("ДатаНачисления",              ОбщегоНазначенияУТ.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	БонусныеБаллы.Колонки.Добавить("ДатаСписания",                ОбщегоНазначенияУТ.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	БонусныеБаллы.Колонки.Добавить("СуммаБонусныхБаллов",         ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	
	Для Каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
		Если РеализацияСверхЗаказа И СтрокаТЧ.КодСтроки > 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ИспользоватьОплатуБонуснымиБаллами И (ИспользуетсяОдновременноеСписаниеИНачисление ИЛИ СтрокаТЧ.СуммаБонусныхБалловКСписанию = 0)
			Или Не ИспользоватьОплатуБонуснымиБаллами Тогда 
			
			Начислено = 0;
			НайденныеСтроки = НачисленныеБонусныеБаллы.НайтиСтроки(Новый Структура("КлючСвязи", СтрокаТЧ.КлючСвязи));
			Для Каждого СтрокаНачислениеБаллов Из НайденныеСтроки Цикл
				Начислено = Начислено + СтрокаНачислениеБаллов.СуммаБонусныхБаллов;
			КонецЦикла;
			
			СуммаКСписаниюВВалюте = Макс(Окр(СтрокаТЧ.СуммаБонусныхБалловКСписаниюВВалюте, 2), 0);
			БазаНачисленияПослеСписания = Макс(Окр(СтрокаТЧ.СуммаСНДС, 2), 0);
			БазаНачисленияДоСписания = БазаНачисленияПослеСписания + СуммаКСписаниюВВалюте;
			
			КоэффициентКорректировкиНачисления = ?(БазаНачисленияДоСписания = 0, 0, БазаНачисленияПослеСписания / БазаНачисленияДоСписания);
			НачисленоСУчетомСписания = Окр(Начислено * КоэффициентКорректировкиНачисления, 2);
			
			Для Каждого СтрокаНачислениеБаллов Из НайденныеСтроки Цикл
				
				СуммаНачисленияСтроки = Окр(СтрокаНачислениеБаллов.СуммаБонусныхБаллов * КоэффициентКорректировкиНачисления, 2);
				Если СуммаНачисленияСтроки = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = БонусныеБаллы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНачислениеБаллов);
				
				// Конвертация начисленных баллов из валюты документа в баллы.
				НоваяВалюта = СтрокаНачислениеБаллов.ВалютаКонвертацииБонусов;
				СтруктураКурсовНовойВалюты = ПримененныеСкидкиНаценки.ПараметрыРасчета.КурсыВалют.Найти(НоваяВалюта, "Валюта");
				ТекущаяВалюта = Объект.Валюта;
				СтруктураКурсовТекущейВалюты = ПримененныеСкидкиНаценки.ПараметрыРасчета.КурсыВалют.Найти(ТекущаяВалюта, "Валюта");
				
				НоваяСтрока.СуммаБонусныхБаллов = РаботаСКурсамиВалютУТ.ПересчитатьПоКурсу(СуммаНачисленияСтроки,
					СтруктураКурсовТекущейВалюты,
					СтруктураКурсовНовойВалюты) / СтрокаНачислениеБаллов.КурсКонвертацииБонусовВВалюту;
				
			КонецЦикла;
			
			СтрокаТЧ.СуммаНачисленныхБонусныхБалловВВалюте = НачисленоСУчетомСписания;
			
		Иначе
			
			СтрокаТЧ.СуммаНачисленныхБонусныхБалловВВалюте = 0;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ИспользоватьКлючСвязи Тогда
		БонусныеБаллы.Свернуть("КлючСвязи, БонуснаяПрограммаЛояльности, ДатаНачисления, ДатаСписания", "СуммаБонусныхБаллов");
	Иначе
		БонусныеБаллы.Свернуть("БонуснаяПрограммаЛояльности, ДатаНачисления, ДатаСписания", "СуммаБонусныхБаллов");
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из БонусныеБаллы Цикл
		НоваяСтрока = ТаблицаБонусныеБаллы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
	КонецЦикла;
КонецПроцедуры
