&НаСервереБезКонтекста
Функция СчетИМ()
	Возврат Справочники.БанковскиеСчетаОрганизаций.НайтиПоНаименованию("ИМ");
КонецФункции

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура BG_ОплатаИМПриИзмененииПосле(Элемент)
	Элементы.ТипОплатыИМ.Видимость = Объект.ОплатаИМ;
	Элементы.ТипПлатежногоДокумента.Видимость = Не Объект.ОплатаИМ;
	Элементы.ГруппаПроведеноБанком.Видимость = Не Объект.ОплатаИМ;
	Элементы.ГруппаИдентификаторПлатежа.Видимость = Не Объект.ОплатаИМ;

	Объект.ТипПлатежногоДокумента = ПредопределенноеЗначение("Перечисление.ТипыПлатежныхДокументов.ПлатежноеПоручение");
	Объект.ПроведеноБанком = Истина;
	Объект.ДатаПроведенияБанком = ТекущаяДата();
	Объект.НомерВходящегоДокумента = 1;
	Объект.ДатаВходящегоДокумента = ТекущаяДата();
КонецПроцедуры

&НаСервере
Процедура BG_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.ТипОплатыИМ.Видимость = Объект.ОплатаИМ;
КонецПроцедуры

&НаКлиенте
Процедура BG_ПередЗакрытиемВместо(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ДействияНаФормеКлиент.ВыполнитьПроверкуНаЗакрытиеДокумента(ЭтаФорма, Отказ);
	ПринудительноЗакрытьФорму = Истина;
КонецПроцедуры

#КонецОбласти
