
&НаКлиенте
Процедура BG_ОплатаИМПриИзмененииПосле(Элемент)
	элементы.ТипОплатыИМ.Видимость = объект.ОплатаИМ; 
	элементы.ТипПлатежногоДокумента.Видимость = не объект.ОплатаИМ;
	элементы.ГруппаПроведеноБанком.Видимость = не объект.ОплатаИМ;
	элементы.ГруппаИдентификаторПлатежа.Видимость = не объект.ОплатаИМ;
	Объект.ТипПлатежногоДокумента = предопределенноезначение("Перечисление.ТипыПлатежныхДокументов.ПлатежноеПоручение");
	объект.ПроведеноБанком = истина;
	объект.ДатаПроведенияБанком = текущаядата();
	объект.НомерВходящегоДокумента = 1;
	Объект.ДатаВходящегоДокумента = текущаядата();
КонецПроцедуры

функция счетИМ()
	возврат справочники.БанковскиеСчетаОрганизаций.НайтиПоНаименованию("ИМ");
конецфункции

&НаСервере
Процедура BG_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	элементы.ТипОплатыИМ.Видимость = объект.ОплатаИМ;
КонецПроцедуры

&НаКлиенте
Процедура BG_ПередЗакрытиемВместо(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//++babochka
	ДействияНаФормеКлиент.ВыполнитьПроверкуНаЗакрытиеДокумента(ЭтаФорма, Отказ);
	//--babochka

	ПринудительноЗакрытьФорму = Истина;
	
КонецПроцедуры
