
///////////// МОДИФИКАЦИЯ ФОРМ /////////////////

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	СтруктураПолей = Новый Структура("УчетПоТоварнымКатегориям, СуммаЗаказано, СуммаРучнойСкидки, СуммаЗаказаноСЗалоговойТарой, СуммаВсего", Неопределено, 0, 0, 0, 0);
	
	ЗаполнитьЗначенияСвойств(СтруктураПолей, Форма);
	
	Если СтруктураПолей.УчетПоТоварнымКатегориям<>Неопределено Тогда
		
		УстановитьУчетПоТоварнымКатегориям(Форма);
		
		Если СтруктураПолей.УчетПоТоварнымКатегориям 
			И ТипЗнч(Форма.Объект.Ссылка)=Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
			
			СтруктураПолей.СуммаЗаказано 				 = Форма.Объект.ТоварныеКатегории.Итог("Сумма");
			СтруктураПолей.СуммаРучнойСкидки 			 = Форма.Объект.ТоварныеКатегории.Итог("СуммаРучнойСкидки");
			СтруктураПолей.СуммаЗаказаноСЗалоговойТарой  = Форма.Объект.ТоварныеКатегории.Итог("Сумма");
			СтруктураПолей.СуммаВсего 					 = Форма.Объект.ТоварныеКатегории.Итог("СуммаСНДС");
			
			ЗаполнитьЗначенияСвойств(Форма, СтруктураПолей);
			
		ИначеЕсли СтруктураПолей.УчетПоТоварнымКатегориям Тогда
			
			СтруктураПолей.СуммаЗаказано 				 = Форма.Объект.ТоварныеКатегории.Итог("Сумма")-Форма.Объект.Товары.Итог("СуммаОтменено");
			СтруктураПолей.СуммаРучнойСкидки 			 = Форма.Объект.ТоварныеКатегории.Итог("СуммаРучнойСкидки")-Форма.Объект.Товары.Итог("СуммаРучнойСкидкиОтменено");
			СтруктураПолей.СуммаЗаказаноСЗалоговойТарой  = Форма.Объект.ТоварныеКатегории.Итог("Сумма")-Форма.Объект.Товары.Итог("СуммаОтменено");
			СтруктураПолей.СуммаВсего 					 = Форма.Объект.ТоварныеКатегории.Итог("СуммаСНДС")-Форма.Объект.Товары.Итог("СуммаОтменено");
			
			ЗаполнитьЗначенияСвойств(Форма, СтруктураПолей);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


///////////// ОСТАЛЬНЫЕ ПРОЦЕДУРЫ /////////////////

Процедура ЗаполнитьЗаказПоставщикуДаннымиПредварительногоЗаказаОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ПредварительныйЗаказ") Тогда
		
		ЗаполнитьЗаказПоПредварительномуЗаказу(Источник, ДанныеЗаполнения);
		//Источник.СуммаДепозита		  = ПредварительныеЗаказыСервер.ПолучитьОстатокДепозита(ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗаказПоПредварительномуЗаказу(Источник, ДанныеЗаполнения, ЗаполнитьРеквизиты = Истина, ЗаполнитьТоварныеКатегории=Ложь, ЗаполнитьТовары=Ложь) Экспорт
	
	РеквизитыЗаказа = Новый Структура;
	Если типЗНЧ(ДанныеЗаполнения) = Тип("СписокЗначений") Тогда 
		ДанныеЗаполнения1 = ДанныеЗаполнения[0].Значение;
	Иначе
		ДанныеЗаполнения1 = ДанныеЗаполнения;
	КонецЕсли;
	//\\
	Для Каждого РеквизитОбъект ИЗ ДанныеЗаполнения1.Метаданные().Реквизиты Цикл
		Если РеквизитОбъект.Имя <> "СуммаДокумента"
			И РеквизитОбъект.Имя <> "Статус" 
			И РеквизитОбъект.Имя <> "СпособДоставки" Тогда
			РеквизитыЗаказа.Вставить(РеквизитОбъект.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗаполнитьРеквизиты Тогда
		
		ЗаполнитьЗначенияСвойств(РеквизитыЗаказа, ДанныеЗаполнения1);
		
		РеквизитыЗаказа.Вставить("СпособДоствки", Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада);
		
		ЗаполнитьЗначенияСвойств(Источник, РеквизитыЗаказа);
		
	КонецЕсли;
	//Источник.ПредварительныйЗаказ = ДанныеЗаполнения;
	
	Если ЗаполнитьТоварныеКатегории Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = ПолучитьЗапросЗаполненияТоварныхКатегорийПредварительногоЗаказа();
		Запрос.УстановитьПараметр("ПредварительныйЗаказ", ДанныеЗаполнения);
		
		Источник.ТоварныеКатегории.Загрузить(Запрос.Выполнить().Выгрузить());
		
		Если Источник.ТоварныеКатегории.Количество() Тогда
			Источник.СуммаДокумента = Источник.ТоварныеКатегории.Итог("Сумма");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаполнитьТовары Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = ПолучитьЗапросЗаполненияТоваровПредварительногоЗаказа();
		Запрос.УстановитьПараметр("ПредварительныйЗаказ", ДанныеЗаполнения);
		
		Источник.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗапросЗаполненияТоваровПредварительногоЗаказа()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПреварительныеЗаказы.Номенклатура КАК Номенклатура,
	|	ПреварительныеЗаказы.Характеристика КАК Характеристика,
	|	ПреварительныеЗаказы.СуммаКОформлениюОстаток КАК Сумма,
	|	ПреварительныеЗаказы.КОформлениюОстаток КАК Количество,
	|	ПреварительныеЗаказы.ПредварительныйЗаказ КАК ПредварительныйЗаказ
	|ПОМЕСТИТЬ ОстаткиЗаказов
	|ИЗ
	|	РегистрНакопления.ПреварительныеЗаказы.Остатки(
	|			,
	|			ПредварительныйЗаказ В (&ПредварительныйЗаказ)
	|				И Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК ПреварительныеЗаказы
	|ГДЕ
	|	ПреварительныеЗаказы.КОформлениюОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПредварительныйЗаказ,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредварительныйЗаказТовары.Ссылка КАК Ссылка,
	|	ПредварительныйЗаказТовары.Номенклатура КАК Номенклатура,
	|	ПредварительныйЗаказТовары.Характеристика КАК Характеристика,
	|	СРЕДНЕЕ(ПредварительныйЗаказТовары.Цена) КАК Цена,
	|	МАКСИМУМ(ПредварительныйЗаказТовары.ПроцентРучнойСкидки) КАК ПроцентРучнойСкидки,
	|	СУММА(ПредварительныйЗаказТовары.СуммаРучнойСкидки) КАК СуммаРучнойСкидки,
	|	СУММА(ПредварительныйЗаказТовары.Количество) КАК Количество,
	|	ПредварительныйЗаказТовары.Перемещаем КАК Перемещаем,
	|	ПредварительныйЗаказТовары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ПредварительныйЗаказТовары.СуммаИнвойс) КАК СуммаИнвойс,
	|	СРЕДНЕЕ(ПредварительныйЗаказТовары.ЦенаИнвойс) КАК ЦенаИнвойс
	|ПОМЕСТИТЬ ДанныеЗаказа
	|ИЗ
	|	Документ.ПредварительныйЗаказ.Товары КАК ПредварительныйЗаказТовары
	|ГДЕ
	|	ПредварительныйЗаказТовары.Ссылка В(&ПредварительныйЗаказ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредварительныйЗаказТовары.Ссылка,
	|	ПредварительныйЗаказТовары.Номенклатура,
	|	ПредварительныйЗаказТовары.Характеристика,
	|	ПредварительныйЗаказТовары.Перемещаем,
	|	ПредварительныйЗаказТовары.СтавкаНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредварительныйЗаказТовары.Ссылка КАК Ссылка,
	|	ПредварительныйЗаказТовары.Номенклатура КАК Номенклатура,
	|	ПредварительныйЗаказТовары.Характеристика КАК Характеристика,
	|	СРЕДНЕЕ(ПредварительныйЗаказТовары.Цена) КАК Цена,
	|	МАКСИМУМ(ПредварительныйЗаказТовары.ПроцентРучнойСкидки) КАК ПроцентРучнойСкидки,
	|	СУММА(ПредварительныйЗаказТовары.СуммаРучнойСкидки) КАК СуммаРучнойСкидки,
	|	СУММА(ПредварительныйЗаказТовары.Количество) КАК Количество,
	|	МАКСИМУМ(ПредварительныйЗаказТовары.Перемещаем) КАК Перемещаем,
	|	МАКСИМУМ(ПредварительныйЗаказТовары.СтавкаНДС) КАК СтавкаНДС,
	|	СУММА(ПредварительныйЗаказТовары.СуммаИнвойс) КАК СуммаИнвойс,
	|	СРЕДНЕЕ(ПредварительныйЗаказТовары.ЦенаИнвойс) КАК ЦенаИнвойс
	|ПОМЕСТИТЬ ДанныеЗаказаГр
	|ИЗ
	|	Документ.ПредварительныйЗаказ.Товары КАК ПредварительныйЗаказТовары
	|ГДЕ
	|	ПредварительныйЗаказТовары.Ссылка В(&ПредварительныйЗаказ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредварительныйЗаказТовары.Ссылка,
	|	ПредварительныйЗаказТовары.Номенклатура,
	|	ПредварительныйЗаказТовары.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЗаказов.Номенклатура КАК Номенклатура,
	|	ОстаткиЗаказов.Характеристика КАК Характеристика,
	|	ОстаткиЗаказов.Количество >= ДанныеЗаказаГр.Количество КАК ТоварВНаличии,
	|	ОстаткиЗаказов.Количество КАК КоличествоОстаток,
	|	ОстаткиЗаказов.Сумма КАК Сумма,
	|	ОстаткиЗаказов.ПредварительныйЗаказ КАК ПредварительныйЗаказ
	|ПОМЕСТИТЬ ВТПроверкаОстатков
	|ИЗ
	|	ОстаткиЗаказов КАК ОстаткиЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеЗаказаГр КАК ДанныеЗаказаГр
	|		ПО ОстаткиЗаказов.Номенклатура = ДанныеЗаказаГр.Номенклатура
	|			И ОстаткиЗаказов.Характеристика = ДанныеЗаказаГр.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗаказа.Ссылка КАК Ссылка,
	|	ДанныеЗаказа.Номенклатура КАК Номенклатура,
	|	ДанныеЗаказа.Характеристика КАК Характеристика,
	|	ДанныеЗаказа.Цена КАК Цена,
	|	ДанныеЗаказа.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ДанныеЗаказа.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ДанныеЗаказа.Количество КАК Количество,
	|	ДанныеЗаказа.Перемещаем КАК Перемещаем,
	|	ДанныеЗаказа.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеЗаказа.ЦенаИнвойс * ДанныеЗаказа.Количество КАК СуммаБезСкидки,
	|	ВТПроверкаОстатков.Сумма / ВТПроверкаОстатков.КоличествоОстаток * ДанныеЗаказа.Количество КАК Сумма,
	|	ДанныеЗаказа.Количество КАК КоличествоУпаковок,
	|	ВТПроверкаОстатков.ПредварительныйЗаказ КАК ПредварительныйЗаказ,
	|	ДанныеЗаказа.СуммаИнвойс КАК СуммаИнвойс,
	|	ДанныеЗаказа.ЦенаИнвойс КАК ЦенаИнвойс
	|ИЗ
	|	ДанныеЗаказа КАК ДанныеЗаказа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПроверкаОстатков КАК ВТПроверкаОстатков
	|		ПО ДанныеЗаказа.Номенклатура = ВТПроверкаОстатков.Номенклатура
	|			И ДанныеЗаказа.Характеристика = ВТПроверкаОстатков.Характеристика
	|ГДЕ
	|	ВТПроверкаОстатков.ТоварВНаличии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеЗаказаГр.Ссылка,
	|	ДанныеЗаказаГр.Номенклатура,
	|	ДанныеЗаказаГр.Характеристика,
	|	ДанныеЗаказаГр.Цена,
	|	ДанныеЗаказаГр.ПроцентРучнойСкидки,
	|	ВЫБОР
	|		КОГДА ДанныеЗаказаГр.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ДанныеЗаказаГр.СуммаРучнойСкидки * ВТПроверкаОстатков.КоличествоОстаток / ДанныеЗаказаГр.Количество
	|	КОНЕЦ,
	|	ВТПроверкаОстатков.КоличествоОстаток,
	|	ДанныеЗаказаГр.Перемещаем,
	|	ДанныеЗаказаГр.СтавкаНДС,
	|	ДанныеЗаказаГр.ЦенаИнвойс * ВТПроверкаОстатков.КоличествоОстаток,
	|	ВТПроверкаОстатков.Сумма,
	|	ВТПроверкаОстатков.КоличествоОстаток,
	|	ВТПроверкаОстатков.ПредварительныйЗаказ,
	|	ДанныеЗаказаГр.СуммаИнвойс,
	|	ДанныеЗаказаГр.ЦенаИнвойс
	|ИЗ
	|	ДанныеЗаказаГр КАК ДанныеЗаказаГр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПроверкаОстатков КАК ВТПроверкаОстатков
	|		ПО ДанныеЗаказаГр.Номенклатура = ВТПроверкаОстатков.Номенклатура
	|			И ДанныеЗаказаГр.Характеристика = ВТПроверкаОстатков.Характеристика
	|ГДЕ
	|	НЕ ВТПроверкаОстатков.ТоварВНаличии";
		
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьЗапросЗаполненияТоварныхКатегорийПредварительногоЗаказа()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПреварительныеЗаказыТоварныеКатегорииОстатки.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	ПреварительныеЗаказыТоварныеКатегорииОстатки.Пол КАК Пол,
	|	ПреварительныеЗаказыТоварныеКатегорииОстатки.СуммаКОформлениюОстаток КАК Сумма,
	|	ПреварительныеЗаказыТоварныеКатегорииОстатки.КОформлениюОстаток КАК Количество,
	|	ПреварительныеЗаказыТоварныеКатегорииОстатки.ПредварительныйЗаказ КАК ПредварительныйЗаказ
	|ПОМЕСТИТЬ ОстаткиЗаказов
	|ИЗ
	|	РегистрНакопления.ПреварительныеЗаказыТоварныеКатегории.Остатки(, ПредварительныйЗаказ В (&ПредварительныйЗаказ)) КАК ПреварительныеЗаказыТоварныеКатегорииОстатки
	|ГДЕ
	|	ПреварительныеЗаказыТоварныеКатегорииОстатки.КОформлениюОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПредварительныйЗаказ,
	|	Пол,
	|	ТоварнаяКатегория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредварительныйЗаказТоварныеКатегории.Ссылка КАК Ссылка,
	|	ПредварительныйЗаказТоварныеКатегории.Пол КАК Пол,
	|	ПредварительныйЗаказТоварныеКатегории.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	СРЕДНЕЕ(ПредварительныйЗаказТоварныеКатегории.Цена) КАК Цена,
	|	МАКСИМУМ(ПредварительныйЗаказТоварныеКатегории.ПроцентРучнойСкидки) КАК ПроцентРучнойСкидки,
	|	СУММА(ПредварительныйЗаказТоварныеКатегории.СуммаРучнойСкидки) КАК СуммаРучнойСкидки,
	|	СУММА(ПредварительныйЗаказТоварныеКатегории.СуммаБезСкидки) КАК СуммаБезСкидки,
	|	СУММА(ПредварительныйЗаказТоварныеКатегории.Количество) КАК Количество,
	|	ПредварительныйЗаказТоварныеКатегории.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ПредварительныйЗаказТоварныеКатегории.СуммаИнвойс) КАК СуммаИнвойс,
	|	СРЕДНЕЕ(ПредварительныйЗаказТоварныеКатегории.ЦенаИнвойс) КАК ЦенаИнвойс
	|ПОМЕСТИТЬ ДанныеЗаказа
	|ИЗ
	|	Документ.ПредварительныйЗаказ.ТоварныеКатегории КАК ПредварительныйЗаказТоварныеКатегории
	|ГДЕ
	|	ПредварительныйЗаказТоварныеКатегории.Ссылка В(&ПредварительныйЗаказ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПредварительныйЗаказТоварныеКатегории.Ссылка,
	|	ПредварительныйЗаказТоварныеКатегории.Пол,
	|	ПредварительныйЗаказТоварныеКатегории.ТоварнаяКатегория,
	|	ПредварительныйЗаказТоварныеКатегории.СтавкаНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	Пол,
	|	ТоварнаяКатегория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЗаказов.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	ОстаткиЗаказов.Пол КАК Пол,
	|	ОстаткиЗаказов.Сумма КАК Сумма,
	|	ОстаткиЗаказов.Количество КАК Количество,
	|	ОстаткиЗаказов.ПредварительныйЗаказ КАК ПредварительныйЗаказ,
	|	ДанныеЗаказа.Цена КАК Цена,
	|	ДанныеЗаказа.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ДанныеЗаказа.ЦенаИнвойс * ОстаткиЗаказов.Количество КАК СуммаБезСкидки,
	|	ВЫБОР
	|		КОГДА ДанныеЗаказа.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ДанныеЗаказа.СуммаРучнойСкидки * ОстаткиЗаказов.Количество / ДанныеЗаказа.Количество
	|	КОНЕЦ КАК СуммаРучнойСкидки,
	|	ОстаткиЗаказов.Количество КАК КоличествоУпаковок,
	|	ДанныеЗаказа.СтавкаНДС КАК СтавкаНДС,
	|	ОстаткиЗаказов.Сумма КАК СуммаСНДС,
	|	ДанныеЗаказа.СуммаИнвойс КАК СуммаИнвойс,
	|	ДанныеЗаказа.ЦенаИнвойс КАК ЦенаИнвойс
	|ИЗ
	|	ОстаткиЗаказов КАК ОстаткиЗаказов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеЗаказа КАК ДанныеЗаказа
	|		ПО ОстаткиЗаказов.ПредварительныйЗаказ = ДанныеЗаказа.Ссылка
	|			И ОстаткиЗаказов.Пол = ДанныеЗаказа.Пол
	|			И ОстаткиЗаказов.ТоварнаяКатегория = ДанныеЗаказа.ТоварнаяКатегория";
		
	
	Возврат ТекстЗапроса; 
	
КонецФункции


Процедура ПополнениеДепозитаОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("Структура")
		И ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
		
		ПополнениеДепозитаОбработкаЗаполнения(Источник, ДанныеЗаполнения.ДокументОснование, ТекстЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ПредварительныйЗаказ") Тогда
		
		ЗаполнитьПоПредварительномуЗаказу(Источник, ДанныеЗаполнения,	ДанныеЗаполнения);
	
		ДенежныеСредстваСервер.ЗаполнитьСтатьюДвиженияДенежныхСредств(
			Источник,
			ДанныеЗаполнения,
			Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	
		ИнициализироватьДокумент(Источник, ДанныеЗаполнения);
	
		//ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(Источник, ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
		
		Источник.ВариантОплаты = Перечисления.ВариантыОплатыПоставщику.КредитПослеПоступления;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(Источник, ДанныеЗаполнения = Неопределено)
	
	Источник.КтоЗаявил = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Источник, ДанныеЗаполнения);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Источник.ФормаОплатыЗаявки) Тогда
		Источник.ФормаОплатыНаличная = Истина;
		Источник.ФормаОплатыБезналичная = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или НЕ ДанныеЗаполнения.Свойство("Организация") Тогда
		Источник.Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Источник.Организация);
	КонецЕсли;
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или НЕ ДанныеЗаполнения.Свойство("Валюта") Тогда
		Источник.Валюта = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(Источник.Валюта);
	КонецЕсли;
	
	//Источник.Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(Источник.Приоритет);
	
КонецПроцедуры

Процедура ЗаполнитьПоПредварительномуЗаказу(Источник, Знач ДокументОснование,	ДанныеЗаполнения)

	// Заполним данные шапки документа.
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.Партнер КАК Партнер,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ДанныеДокумента.Приоритет КАК Приоритет,
	|	ДанныеДокумента.Валюта КАК ВалютаВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФормаОплатыНаличная,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФормаОплатыБезналичная,
	|	ДанныеДокумента.ФормаОплаты КАК ФормаОплатыЗаявки,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.БанковскийСчет
	|		ИНАЧЕ ДанныеДокумента.Договор.БанковскийСчет
	|	КОНЕЦ КАК БанковскийСчет,
	|	ДанныеДокумента.Касса КАК Касса,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.БанковскийСчет.ВалютаДенежныхСредств
	|		КОГДА ДанныеДокумента.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.Касса.ВалютаДенежныхСредств
	|		ИНАЧЕ ЕСТЬNULL(ДанныеДокумента.Договор.БанковскийСчет.ВалютаДенежныхСредств, ДанныеДокумента.Валюта)
	|	КОНЕЦ КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику) КАК ХозяйственнаяОперация,
	|	&Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.ПредварительныйЗаказ КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И ДанныеДокумента.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемНаКомиссию)
	|	И ДанныеДокумента.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным)");
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	ЗаполнитьРеквизитыПоРезультатуЗапроса(
		Источник, ДокументОснование,
		РезультатЗапроса,
		ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоРезультатуЗапроса(Источник, ДокументОснование, РезультатЗапроса, ДанныеЗаполнения)
	
	Если РезультатЗапроса.Пустой() Тогда
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не требуется вводить Заявку на расходование ДС на основании документа %1'"),
			ДокументОснование);
		ВызватьИсключение Текст;
	Иначе
		ДанныеЗаполнения = Новый Структура;
		Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
			ДанныеЗаполнения.Вставить(Колонка.Имя);
		КонецЦикла;
			
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Выборка);
		
		ДанныеЗаполнения.Вставить("ЖелательнаяДатаПлатежа");
		
		Если Не ЗначениеЗаполнено(ДанныеЗаполнения.ФормаОплатыЗаявки) Тогда
			ДанныеЗаполнения.ФормаОплатыНаличная = Истина;
			ДанныеЗаполнения.ФормаОплатыБезналичная = Истина;
		КонецЕсли;
		
		ДенежныеСредстваСервер.ЗаполнитьРеквизитыДокументаПоФормеОплаты(ДанныеЗаполнения.ФормаОплатыЗаявки, ДанныеЗаполнения);
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Валюта) Тогда
			Источник.БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(
				ДанныеЗаполнения.Контрагент,
				ДанныеЗаполнения.Валюта);
		Иначе
			Источник.БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(
				ДанныеЗаполнения.Контрагент);
		КонецЕсли;
		РеквизитыСчета = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьРеквизитыБанковскогоСчета(
			Источник.БанковскийСчетКонтрагента);
		Источник.НазначениеПлатежа = РеквизитыСчета.ТекстНазначения;
		
		ЗаказыПоставщику = ДокументОснование;
		
		ВзаиморасчетыСервер.ЗаполнитьРасшифровкуПлатежаПоЗаказуПоставщику(
			Выборка.Договор,
			Выборка.Договор,
			ДанныеЗаполнения.ВалютаВзаиморасчетов,
			ДокументОснование.СуммаАвансаДоПодтверждения, // СуммаКОплате,
			Источник.РасшифровкаПлатежа,
			ДанныеЗаполнения.ЖелательнаяДатаПлатежа);
		
	КонецЕсли;
	
	// Заполнение суммы шапки документа
	Источник.СуммаДокумента = Источник.РасшифровкаПлатежа.Итог("Сумма");
	
КонецПроцедуры

Функция ПолучитьОстатокДепозита(ПредварительныйЗаказ, ЗаказПоставщику=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	СУММА(Сводно.СуммаДепозита) КАК СуммаДепозита
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПредварительныйЗаказ.СуммаАвансаДоПодтверждения КАК СуммаДепозита
	|	ИЗ
	|		Документ.ПредварительныйЗаказ КАК ПредварительныйЗаказ
	|	ГДЕ
	|		ПредварительныйЗаказ.Ссылка в (&ПредварительныйЗаказ)
	|		И ПредварительныйЗаказ.Проведен = ИСТИНА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказПоставщику.СуммаАвансаДоПодтверждения
	|	ИЗ
	|		Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|	ГДЕ
	|		ЗаказПоставщику.ПредварительныйЗаказ в (&ПредварительныйЗаказ)
	|		И ЗаказПоставщику.Проведен = ИСТИНА
	|		И ЗаказПоставщику.Ссылка <> &ЗаказПоставщику) КАК Сводно";
	
	Запрос.УстановитьПараметр("ПредварительныйЗаказ", 	ПредварительныйЗаказ);
	Запрос.УстановитьПараметр("ЗаказПоставщику", 		ЗаказПоставщику);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	ВыборкаЗапроса.Следующий();
	
	Возврат ВыборкаЗапроса.СуммаДепозита;
	
КонецФункции

Процедура ПересчитатьСуммуДепозитаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ЭтапыГрафикаОплаты.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Источник.СуммаДепозита = МИН(Источник.СуммаДепозита, Источник.СуммаПредоплатыДоПоступления, Источник.ПредварительныйЗаказ.СуммаАвансаДоПодтверждения);
	
КонецПроцедуры

Процедура ЗаполнитьМаркуКоллекциюОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		СтруктураПолей = Новый Структура("Марка,Коллекция,ЧастьКоллекции");
		ЗаполнитьЗначенияСвойств(СтруктураПолей, ДанныеЗаполнения);
		ЗаполнитьЗначенияСвойств(Источник, СтруктураПолей);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ДокументОснование")
			И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ЗаполнитьМаркуКоллекциюОбработкаЗаполнения(Источник, ДанныеЗаполнения.ДокументОснование, ТекстЗаполнения, СтандартнаяОбработка);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьУчетПоТоварнымКатегориям(Форма) Экспорт
	
	Попытка
		
		Форма.УчетПоТоварнымКатегориям  				 = 	ПредварительныеЗаказыСервер.УчетПоТоварнымКатегориям(Форма.Объект.Партнер, Форма.Объект.Соглашение, Форма.Объект.ХозяйственнаяОперация);
		Форма.Элементы.ГруппаТоварныеКатегории.Видимость = Форма.УчетПоТоварнымКатегориям;
		
		Если Пользователи.РолиДоступны("ДобавлениеИзменениеЗаказовПоставщикам") Тогда
			Форма.Элементы.ГруппаТоварныеКатегории.Видимость = Истина;
		Конецесли;
		
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Процедура ПроверитьТоварныеКатегорииОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	УчетПоТоварнымКатегориям = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Соглашение, "УчетПоТоварнымКатегориям")=Истина;
	
	Если УчетПоТоварнымКатегориям Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары");
	КонецЕсли;
	
	Если Не УчетПоТоварнымКатегориям Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТоварныеКатегории");
	КонецЕсли;
	
	Если УчетПоТоварнымКатегориям 
		И Источник.Товары.Количество() Тогда
		
		Если Источник.Товары.Итог("Сумма")<>Источник.ТоварныеКатегории.Итог("Сумма") Тогда
		
			Если ТипЗнч(Источник.Ссылка)=Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда			
				
				ШаблонОшибки = "Сумма товаров %1 отличается от суммы товарных категорий %2, разница: %3. Запись не возможна!";
				ТекстОшибки  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, Источник.Товары.Итог("Сумма"), Источник.ТоварныеКатегории.Итог("Сумма"), (Источник.Товары.Итог("Сумма")-Источник.ТоварныеКатегории.Итог("Сумма")));
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,Источник,"ТоварныеКатегории",,Истина);
			Иначе
				
				ШаблонОшибки = "Сумма товаров %1 отличается от суммы товарных категорий %2, разница: %3";
				ТекстОшибки  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, Источник.Товары.Итог("Сумма"), Источник.ТоварныеКатегории.Итог("Сумма"), (Источник.Товары.Итог("Сумма")-Источник.ТоварныеКатегории.Итог("Сумма")));
	    	
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,Источник,"ТоварныеКатегории",,Истина);
			КонецЕсли;
			
		КонецЕсли;
			
		Если ТипЗнч(Источник.Ссылка)=Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
			
			ВсеЗаказы = Источник.ТоварныеКатегории.Выгрузить();
			ВсеЗаказы.Свернуть("ЧастьКоллекции");
			
			Для Каждого СтрокаЗаказа ИЗ ВсеЗаказы Цикл
				ПроверитьСоставТаблиц(Источник, Отказ, ПроверяемыеРеквизиты, СтрокаЗаказа.ЧастьКоллекции);
			КонецЦикла;
			
		Иначе
            Если Источник.Метаданные().Реквизиты.Найти("ЧастьКоллекции") <> Неопределено Тогда
                ПроверитьСоставТаблиц(Источник, Отказ, ПроверяемыеРеквизиты, Источник.ЧастьКоллекции);
            КонецЕсли; 
            
		Конецесли;
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПроверитьСоставТаблиц(Источник, Отказ, ПроверяемыеРеквизиты, ЧастьКоллекции=Неопределено)
	
	ДатаПроверкиСуммаИнвойс = Бабочка.ПолучитьЗначениеДинамическихНастроек("ДатаПроверкиСуммаИнвойс", Дата(1,1,1));
   
	Если ТипЗнч(Источник.Ссылка)=Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ТаблицаЗапроса = РазложитьТоварыПоКатегориямЗаказПоставщику(Источник.Товары, ЧастьКоллекции);	
	ИначеЕсли ТипЗнч(Источник.Ссылка)=Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда 	
		Если Источник.Ссылка.ПоступлениеПоЗаказам  Тогда
			ТаблицаЗапроса = РазложитьТоварыПоКатегориям(Источник.Товары, ЧастьКоллекции);
		Иначе
			СуммаТК 		= Источник.ТоварныеКатегории.Итог("Сумма");	
			СуммаТоваров 	= Источник.Товары.Итог("Сумма");	
			
			Если СуммаТК <> СуммаТоваров Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Сумма товарных категорий не совпадает с суммой товаров!";
				Сообщение.Сообщить(); 
				
				Отказ = Истина;
				
			КонецЕсли;
			
			КоличествоТК 		= Источник.ТоварныеКатегории.Итог("Количество");	
			КоличествоТоваров 	= Источник.Товары.Итог("Количество");	
			
			Если КоличествоТК <> КоличествоТоваров Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Количество товарных категорий не совпадает с количеством товаров!";
				Сообщение.Сообщить(); 
				
				Отказ = Истина;
				
			КонецЕсли;
			
			Возврат;
		КонецЕсли; 
	Иначе
        ТаблицаЗапроса = РазложитьТоварыПоКатегориям(Источник.Товары);
	КонецЕсли;
	
	ТекИндекс = -1;
	
	Для Каждого СтрокаКатегории ИЗ Источник.ТоварныеКатегории Цикл
		
		Если ЧастьКоллекции <> Неопределено И Источник.ТоварныеКатегории.Выгрузить().Колонки.Найти("ЧастьКоллекции") <> Неопределено
			И СтрокаКатегории.ЧастьКоллекции <> ЧастьКоллекции Тогда
			Продолжить;
		КонецЕсли;
		
		ТекИндекс = ТекИндекс + 1;
		
		АдресОшибки = НСтр("ru=' в строке %НомерСтроки% списка ""Товарные категории""'");
		АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", Источник.Товары[ТекИндекс].НомерСтроки);
		
		Если ТипЗнч(Источник.Ссылка)=Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			СтрокаТовара 		= ТаблицаЗапроса.НайтиСтроки(Новый Структура("ТоварнаяКатегория,ПредварительныйЗаказ", СтрокаКатегории.ТоварнаяКатегория, СтрокаКатегории.ПредварительныйЗаказ));
			СуммаТовара 		= ?(СтрокаТовара.Количество() = 0, 0, СтрокаТовара[0].Сумма);
			КоличествоТоваров 	= ?(СтрокаТовара.Количество() = 0, 0, СтрокаТовара[0].КоличествоТоваров);
			СуммаИнвойсТовары 	= ?(СтрокаТовара.Количество() = 0, 0, СтрокаТовара[0].СуммаИнвойсТовары);
		Иначе			
			СтрокаТовара 		= ТаблицаЗапроса.Найти(СтрокаКатегории.ТоварнаяКатегория, "ТоварнаяКатегория");
			СуммаТовара 		= ?(СтрокаТовара=Неопределено, 0, СтрокаТовара.Сумма);
			КоличествоТоваров 	= ?(СтрокаТовара=Неопределено, 0, СтрокаТовара.КоличествоТоваров);
			СуммаИнвойсТовары 	= ?(СтрокаТовара=Неопределено, 0, СтрокаТовара.СуммаИнвойсТовары);
		КонецЕсли;
		
		Если СтрокаКатегории.Отменено Тогда
		ИначеЕсли СуммаТовара>0
			И СтрокаКатегории.Сумма <> СуммаТовара Тогда
			
			ШаблонСообщения = "По категории %1 сумма %2 отличается от суммы в таблице товаров %3 ";
			ТекстОшибки		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, СтрокаКатегории.ТоварнаяКатегория, СтрокаКатегории.Сумма, СуммаТовара);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки+АдресОшибки, 
			Источник,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТоварныеКкатегории", Источник.ТоварныеКатегории[ТекИндекс].НомерСтроки, "ТоварнаяКатегория"),
			,
			Истина);
            
            Отказ = Истина; 
			
		ИначеЕсли КоличествоТоваров > 0
			И СтрокаКатегории.Количество <> КоличествоТоваров Тогда
			
			ШаблонСообщения = "По категории %1 количество %2 отличается от количества в таблице товаров %3 ";
			ТекстОшибки		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, СтрокаКатегории.ТоварнаяКатегория, СтрокаКатегории.Количество, КоличествоТоваров);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки+АдресОшибки, 
			Источник,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТоварныеКатегории", Источник.ТоварныеКатегории[ТекИндекс].НомерСтроки, "ТоварнаяКатегория"),
			,
			Истина);
            
            Отказ = Истина; 
			
		ИначеЕсли КоличествоТоваров > 0
			И СтрокаКатегории.СуммаИнвойс <> СуммаИнвойсТовары Тогда
			
			ШаблонСообщения = "По категории %1 сумма (инвойс) %2 отличается от суммы (инвойс) в таблице товаров %3 ";
			ТекстОшибки		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, СтрокаКатегории.ТоварнаяКатегория, СтрокаКатегории.СуммаИнвойс, СуммаИнвойсТовары);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки+АдресОшибки, 
			Источник,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТоварныеКатегории", Источник.ТоварныеКатегории[ТекИндекс].НомерСтроки, "ТоварнаяКатегория"),
			,
			Истина);
            
            Отказ = Истина; 
			
		ИначеЕсли СуммаТовара=0 Тогда
			
			ШаблонСообщения = "По категории %1 нет данных в таблице ""Товары""";
			ТекстОшибки		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, СтрокаКатегории.ТоварнаяКатегория, СтрокаКатегории.Сумма, СуммаТовара);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, 
			Источник,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТоварныеКатегории", Источник.ТоварныеКатегории[ТекИндекс].НомерСтроки, "ТоварнаяКатегория"),
			,
			);
            
			Отказ = Истина; 
		КонецЕсли;
				
	КонецЦикла;
		
КонецПроцедуры


Процедура ОтразитьПреварительныеЗаказы(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаПреварительныеЗаказы = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПреварительныеЗаказы;
	
	Если Отказ ИЛИ ТаблицаПреварительныеЗаказы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПреварительныеЗаказы = Движения.ПреварительныеЗаказы;
	ДвиженияПреварительныеЗаказы.Записывать = Истина;
	ДвиженияПреварительныеЗаказы.Загрузить(ТаблицаПреварительныеЗаказы);
	
КонецПроцедуры

Процедура ОтразитьПреварительныеЗаказыТоварныеКатегории(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаПреварительныеЗаказы = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПреварительныеЗаказыТоварныеКатегории;
	
	Если Отказ ИЛИ ТаблицаПреварительныеЗаказы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПреварительныеЗаказы = Движения.ПреварительныеЗаказыТоварныеКатегории;
	ДвиженияПреварительныеЗаказы.Записывать = Истина;
	ДвиженияПреварительныеЗаказы.Загрузить(ТаблицаПреварительныеЗаказы);
	
КонецПроцедуры

Процедура ЗагрузитьТоварныеКатегории(Форма) Экспорт
	
	ПроверкаНаРеквизиты = Новый Структура("ТоварныеКатегорииТоваров");	
	
	ЗаполнитьЗначенияСвойств(ПроверкаНаРеквизиты, Форма);
	
	Если ПроверкаНаРеквизиты.ТоварныеКатегорииТоваров=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючПоиска = Новый Структура("ТоварнаяКатегория");
	Форма.ТоварныеКатегорииТоваров.Очистить();
	
	Если ТипЗнч(Форма.Объект.Ссылка)=Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		
		ВсеЗаказы=Форма.Объект.ТоварныеКатегории.Выгрузить();
		ВсеЗаказы.Свернуть("ЧастьКоллекции");
		
		ПоступлениеПоЗаказам = Форма.Объект.Ссылка.ПоступлениеПоЗаказам;
		
		Если ПоступлениеПоЗаказам Тогда
			
			Для Каждого СтрокаЗаказа ИЗ ВсеЗаказы Цикл
			
				ТаблицаКатегорий = РазложитьТоварыПоКатегориям(Форма.Объект.Товары, СтрокаЗаказа.ЧастьКоллекции);
				
				Для Каждого СтрокаКатегории ИЗ ТаблицаКатегорий Цикл
					ЗаполнитьЗначенияСвойств(Форма.ТоварныеКатегорииТоваров.Добавить(), СтрокаКатегории);
				КонецЦикла;
				
			КонецЦикла;
			
			КлючПоиска.Вставить("ЧастьКоллекции");	
		Иначе
			//если приобретение без заказа, проверяем только сумму и количество в ПроверитьСоставТаблиц
			Возврат;
		
		КонецЕсли; 
		
		
	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка)=Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		КлючПоиска.Вставить("ПредварительныйЗаказ");   //Вера
		ТаблицаКатегорий = РазложитьТоварыПоКатегориямЗаказПоставщику(Форма.Объект.Товары);
		Форма.ТоварныеКатегорииТоваров.Загрузить(ТаблицаКатегорий);
		
	Иначе 
		
		ТаблицаКатегорий = РазложитьТоварыПоКатегориям(Форма.Объект.Товары);
		Форма.ТоварныеКатегорииТоваров.Загрузить(ТаблицаКатегорий);
		
	КонецЕсли;
	
	Для Каждого СтрокаКатегорий ИЗ Форма.Объект.ТоварныеКатегории Цикл
		
		СуммаТоваров 	= 0;
		КоличествоТоваров = 0;
		СуммаИнвойсТовары = 0;
		
		ЗаполнитьЗначенияСвойств(КлючПоиска, СтрокаКатегорий);
		// Форма.Объект.ТоварныеКатегории.ПредварительныйЗаказ = Тип("Документ.ПредварительныйЗаказ"), 
		// КлючПоиска.ПредварительныйЗаказ = Тип("Строка")
		Если КлючПоиска.Свойство("ПредварительныйЗаказ") И ЗначениеЗаполнено(КлючПоиска.ПредварительныйЗаказ) Тогда
			
			ПредварительныйЗаказ = КлючПоиска.ПредварительныйЗаказ;
			КлючПоиска.ПредварительныйЗаказ = Строка(ПредварительныйЗаказ);
			
		КонецЕсли;
		ДанныеВТоварах 	= Форма.ТоварныеКатегорииТоваров.НайтиСтроки(КлючПоиска);
		
		Для Каждого СтрокаТовара ИЗ ДанныеВТоварах Цикл
			СуммаТоваров = СуммаТоваров + СтрокаТовара.Сумма;
			КоличествоТоваров = КоличествоТоваров + СтрокаТовара.КоличествоТоваров;
			СуммаИнвойсТовары = СуммаИнвойсТовары + СтрокаТовара.СуммаИнвойсТовары;

		КонецЦикла;
		
		Если НЕ СтрокаКатегорий.Отменено Тогда
			СтрокаКатегорий.СуммаТоваров 		= СуммаТоваров;
			СтрокаКатегорий.Разница 	 		= СтрокаКатегорий.Сумма - СуммаТоваров;
			СтрокаКатегорий.КоличествоТоваров 	= КоличествоТоваров;
			СтрокаКатегорий.РазницаТоваров 	 	= СтрокаКатегорий.Количество - КоличествоТоваров; 
			СтрокаКатегорий.СуммаИнвойсТовары	= СуммаИнвойсТовары;
			СтрокаКатегорий.РазницаСуммаИнвойс	= СтрокаКатегорий.СуммаИнвойс - СуммаИнвойсТовары;
			
		КонецЕсли;  	
		
	КонецЦикла;
	
КонецПроцедуры

Функция РазложитьТоварыПоКатегориям(Товары, ЧастьКоллекции = Неопределено)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	Товары.Отменено КАК Отменено,
	|	ВЫРАЗИТЬ(Товары.ЗаказПоставщику КАК Документ.ЗаказПоставщику) КАК ЗаказПоставщику,
	|	Товары.Сумма КАК Сумма,
	|	Товары.Количество КАК Количество,
	|	Товары.СуммаИнвойс КАК СуммаИнвойс
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	СУММА(Товары.Сумма) КАК Сумма,
	|	СУММА(Товары.Количество) КАК КоличествоТоваров,
	|	СУММА(Товары.СуммаИнвойс) КАК СуммаИнвойсТовары
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	Товары.Отменено = ЛОЖЬ
	|	И &УсловиеНаЧастьКоллекции
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура.ТоварнаяКатегория
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(КоличествоТоваров),
	|	СУММА(СуммаИнвойсТовары)
	|ПО
	|	ТоварнаяКатегория ИЕРАРХИЯ";

	УсловиеНаЧастьКоллекции = "ЕСТЬNULL(Товары.ЗаказПоставщику.ЧастьКоллекции, ЗНАЧЕНИЕ(Перечисление.ЧастьКоллекции.ПустаяСсылка)) = &ЧастьКоллекции";	
	
	Если ЧастьКоллекции = Неопределено Тогда //в предзаказах не требуется
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаЧастьКоллекции", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаЧастьКоллекции", УсловиеНаЧастьКоллекции);
	КонецЕсли; 
	 
	ТаблицаТоваров = Товары.Выгрузить();
	
	Если ТаблицаТоваров.Колонки.Найти("Отменено")=Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("Отменено", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	Если ТаблицаТоваров.Колонки.Найти("ЗаказПоставщику")=Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("ЗаказПоставщику", Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику"));
	КонецЕсли;
    
    Запрос.УстановитьПараметр("ЧастьКоллекции", ЧастьКоллекции);
    Запрос.УстановитьПараметр("Товары", ТаблицаТоваров);
	Запрос.УстановитьПараметр("СвойствоЧастьКоллекции", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Часть"));
	
	//ТаблицаКатегорий = Запрос.Выполнить().Выгрузить();
	ТаблицаКатегорий1 = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ТаблицаКатегорий = Новый ТаблицаЗначений();
	ТаблицаКатегорий.Колонки.Добавить("ТоварнаяКатегория", Новый ОписаниеТипов("СправочникСсылка.ТоварныеКатегории"));
	КЧ = Новый КвалификаторыЧисла(15,2);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	ТаблицаКатегорий.Колонки.Добавить("Сумма", ОписаниеТиповЧ);
	ТаблицаКатегорий.Колонки.Добавить("КоличествоТоваров", Новый ОписаниеТипов(Массив, , ,Новый КвалификаторыЧисла(15,0)));
	ТаблицаКатегорий.Колонки.Добавить("СуммаИнвойсТовары", ОписаниеТиповЧ);
	Для Каждого стр Из ТаблицаКатегорий1.Строки Цикл
		строка = ТаблицаКатегорий.Добавить();
		ЗаполнитьЗначенияСвойств(строка,стр);
	КонецЦикла;
	//\\

	Если ЧастьКоллекции<>Неопределено Тогда
		ТаблицаКатегорий.Колонки.Добавить("ЧастьКоллекции", Новый ОписаниеТипов("ПеречислениеСсылка.ЧастьКоллекции"));
		ТаблицаКатегорий.ЗаполнитьЗначения(ЧастьКоллекции, "ЧастьКоллекции");
	КонецЕсли;
	
	
	Возврат ТаблицаКатегорий;
	
КонецФункции

Процедура ОтразитьЗаказыПоставщикамТоварныеКатегории(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаЗаказыПоставщикам = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаказыПоставщикамТоварныеКатегории;
	
	Если Отказ ИЛИ ТаблицаЗаказыПоставщикам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗаказыПоставщикам = Движения.ЗаказыПоставщикамТоварныеКатегории;
	ДвиженияЗаказыПоставщикам.Записывать = Истина;
	ДвиженияЗаказыПоставщикам.Загрузить(ТаблицаЗаказыПоставщикам);
	
КонецПроцедуры

Функция ЗаполнитьПредоплатуПоДокументу(Объект, СуммаСНДС) Экспорт
	
	//ЭтапОплаты = Новый Структура("ДатаПлатежа, СуммаПредоплатыДоПоступления", Объект.Дата, 0);
	
	Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
		|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.Сдвиг КАК Сдвиг,
		|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.ВариантОплаты КАК ВариантОплаты
		|ИЗ
		|	Справочник.СоглашенияСПоставщиками.ЭтапыГрафикаОплаты КАК СоглашенияСПоставщикамиЭтапыГрафикаОплаты
		|ГДЕ
		|	СоглашенияСПоставщикамиЭтапыГрафикаОплаты.Ссылка = &Соглашение
		|	И СоглашенияСПоставщикамиЭтапыГрафикаОплаты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыПоставщику.КредитПослеПоступления)
		|";
		
		Запрос.УстановитьПараметр("Соглашение", Объект.Соглашение);
		
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаЗапроса.Следующий() Тогда
			
			БазаДата = ?(ЗначениеЗаполнено(Объект.ДатаВходящегоДокумента), Объект.ДатаВходящегоДокумента, Объект.Дата);
			
			///Вера
			стр = Объект.ЭтапыГрафикаОплаты.Добавить();
			стр.ВариантОплаты = ВыборкаЗапроса.ВариантОплаты;
			стр.СверхЗаказа = Ложь;
			стр.ДатаПлатежа = БазаДата+ВыборкаЗапроса.Сдвиг*24*60*60;
			стр.ПроцентПлатежа = ВыборкаЗапроса.ПроцентПлатежа;
			стр.СуммаПлатежа = СуммаСНДС*ВыборкаЗапроса.ПроцентПлатежа/100;
			
			//\\
			
			//ЭтапОплаты.СуммаПредоплатыДоПоступления = СуммаСНДС*ВыборкаЗапроса.ПроцентПлатежа/100;
			//ЭтапОплаты.ДатаПлатежа					= БазаДата+ВыборкаЗапроса.Сдвиг*24*60*60;
			
			//ЗаполнитьЗначенияСвойств(Объект, ЭтапОплаты);
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Процедура ЗаполнитьСуммуБезСкидкиПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

КонецПроцедуры

Процедура СоздатьПоступлениеПоПроформеОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ЗаказПоставщику.Ссылка КАК Ссылка,
		|	ЗаказПоставщику.Дата КАК Дата,
		|	ЗаказПоставщику.ЧастьКоллекции КАК ЧастьКоллекции
		|ПОМЕСТИТЬ ЗаказПоставщику
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ЗаказПоставщикуТоварныеКатегории
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|		ПО ЗаказПоставщикуТоварныеКатегории.Заказ = ЗаказПоставщику.Договор
		|ГДЕ
		|	ЗаказПоставщикуТоварныеКатегории.Ссылка = &ДанныеЗаполнения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПоставщикуТоварныеКатегории.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|	ЗаказПоставщику.ЧастьКоллекции КАК ЧастьКоллекции,
		|	ЗаказПоставщикуТоварныеКатегории.Пол КАК Пол,
		|	ЗаказПоставщикуТоварныеКатегории.Ссылка КАК Ссылка,
		|	ЗаказПоставщику.Дата КАК Дата
		|ПОМЕСТИТЬ Заказы
		|ИЗ
		|	Документ.ЗаказПоставщику.ТоварныеКатегории КАК ЗаказПоставщикуТоварныеКатегории
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказПоставщику КАК ЗаказПоставщику
		|		ПО ЗаказПоставщикуТоварныеКатегории.Ссылка = ЗаказПоставщику.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЧастьКоллекции,
		|	Пол,
		|	ТоварнаяКатегория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.ЧастьКоллекции КАК ЧастьКоллекции,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.Пол КАК Пол
		|ПОМЕСТИТЬ Заявки
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.ТоварныеКатегории КАК ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории
		|ГДЕ
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.Ссылка = &ДанныеЗаполнения
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЧастьКоллекции,
		|	Пол,
		|	ТоварнаяКатегория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Заказы.Ссылка КАК Ссылка,
		|	Заказы.Дата КАК Дата
		|ИЗ
		|	Заявки КАК Заявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Заказы КАК Заказы
		|		ПО Заявки.ЧастьКоллекции = Заказы.ЧастьКоллекции
		|			И Заявки.ТоварнаяКатегория = Заказы.ТоварнаяКатегория
		|			И Заявки.Пол = Заказы.Пол
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.НомерСтроки КАК НомерСтроки,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.ЧастьКоллекции КАК ЧастьКоллекции,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.Пол КАК Пол,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.ТоварнаяКатегория КАК ТоварнаяКатегория,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.Комментарий КАК Комментарий,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.Цена КАК Цена,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.СуммаПрайсЛист КАК Сумма,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.Отменено КАК Отменено,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.ПричинаОтмены КАК ПричинаОтмены,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.КодСтроки КАК КодСтроки,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.Количество КАК Количество,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.СтавкаНДС КАК СтавкаНДС,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.СуммаНДС КАК СуммаНДС,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.СуммаСНДС КАК СуммаСНДС,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.Упаковка КАК Упаковка,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.СуммаБезСкидки КАК СуммаБезСкидки,
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.Сумма КАК СуммаИнвойс
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.ТоварныеКатегории КАК ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории
		|ГДЕ
		|	ЗаявкаНаРасходованиеДенежныхСредствТоварныеКатегории.Ссылка = &ДанныеЗаполнения";
		
		Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
		ПакетЗапросов = Запрос.ВыполнитьПакет();
		
		ВыборкаЗаказов = ПакетЗапросов[ПакетЗапросов.ВГраница()-1].Выбрать();
		ВыборкаЗаказов.Следующий();
		
		ТаблицаКатегорий = ПакетЗапросов[ПакетЗапросов.ВГраница()].Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументОснование", ВыборкаЗаказов.Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказПоставщику.Сделка КАК Сделка,
		|	ЗаказПоставщику.Соглашение.РегистрироватьЦеныПоставщика КАК РегистрироватьЦеныПоставщика,
		|	ЗаказПоставщику.Партнер КАК Партнер,
		|	ЗаказПоставщику.Контрагент КАК Контрагент,
		|	ЗаказПоставщику.Договор КАК Договор,
		|	ЗаказПоставщику.Организация КАК Организация,
		|	ЗаказПоставщику.Соглашение КАК Соглашение,
		|	ЗаказПоставщику.Валюта КАК Валюта,
		|	ЗаказПоставщику.Валюта КАК ВалютаВзаиморасчетов,
		|	ВЫБОР
		|		КОГДА ЗаказПоставщику.Склад.ЭтоГруппа
		|				И ЗаказПоставщику.Склад.ВыборГруппы = ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|		ИНАЧЕ ЗаказПоставщику.Склад
		|	КОНЕЦ КАК Склад,
		|	ВЫБОР
		|		КОГДА ЗаказПоставщику.Склад.ЭтоГруппа
		|				И ЗаказПоставщику.Склад.ВыборГруппы = ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЗапрещеноВыбиратьГруппуСкладов,
		|	ЗаказПоставщику.ФормаОплаты КАК ФормаОплаты,
		|	ЗаказПоставщику.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		|	ЗаказПоставщику.НалогообложениеНДС КАК НалогообложениеНДС,
		|	ЗаказПоставщику.ЗакупкаПодДеятельность КАК ЗакупкаПодДеятельность,
		|	ЗаказПоставщику.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ЗаказПоставщику.Статус КАК СтатусДокумента,
		|	ЗаказПоставщику.Подразделение КАК Подразделение,
		|	ЗаказПоставщику.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
		|	ЗаказПоставщику.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
		|	ЗаказПоставщику.СрокВозвратаМногооборотнойТары КАК СрокВозвратаМногооборотнойТары,
		|	ЗаказПоставщику.ТребуетсяЗалогЗаТару КАК ТребуетсяЗалогЗаТару,
		|	ЕСТЬNULL(ЗаказПоставщику.Соглашение.РассчитыватьДатуВозвратаТарыПоКалендарю, ЛОЖЬ) КАК РассчитыватьДатуВозвратаТарыПоКалендарю,
		|	ЕСТЬNULL(ЗаказПоставщику.Соглашение.КалендарьВозвратаТары, ЗНАЧЕНИЕ(Справочник.ПроизводственныеКалендари.ПустаяСсылка)) КАК КалендарьВозвратаТары,
		|	НЕ ЗаказПоставщику.Проведен КАК ЕстьОшибкиПроведен,
		|	ВЫБОР
		|		КОГДА ЗаказПоставщику.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Подтвержден)
		|				ИЛИ ЗаказПоставщику.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиСтатус,
		|	ЗаказПоставщику.БанковскийСчет КАК БанковскийСчетОрганизации,
		|	ЗаказПоставщику.ПорядокРасчетов КАК ПорядокРасчетов,
		|	ЗаказПоставщику.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ЗаказПоставщику.Марка,
		|	ЗаказПоставщику.Коллекция,
		|	ЗаказПоставщику.ЧастьКоллекции,
		|	ЗаказПоставщику.Соглашение.УчетПоТоварнымКатегориям КАК УчетПоТоварнымКатегориям,
		|	ЗаказПоставщику.ПредварительныйЗаказ.ПроцентРучнойСкидки КАК СикдкаОтПоставщика
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|ГДЕ
		|	ЗаказПоставщику.Ссылка = &ДокументОснование";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		РеквизитыЗаказа = РезультатЗапроса[0].Выбрать();
		РеквизитыЗаказа.Следующий();
		
		ЗаполнитьЗначенияСвойств(Источник, РеквизитыЗаказа);
		
		Источник.ТоварныеКатегории.Загрузить(ТаблицаКатегорий);
		Источник.ЗаявкаНаРасходованиеДенежныхСредств = ДанныеЗаполнения;
		
		Если Источник.Договор.Инкотермс = перечисления.Инкотермс.DDP Тогда
			Источник.СпособДоставки = Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада;
		Иначе
			Источник.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада;
		КонецЕсли;
		
		Источник.Статус 				= Перечисления.СтатусыПоступленийТоваров.Отгружено;
		
		//Источник.ЗаполнитьЭтапыГрафикаОплаты(); //Вера
		Источник.ПоступлениеПоЗаказам 	= Истина;
		
	КонецЕсли;
	
	Источник.ПоступлениеПоЗаказам 	= Ложь;
	//Источник.ЗаполнитьЭтапыГрафикаОплаты();
	Источник.ПоступлениеПоЗаказам 	= Истина;
	
КонецПроцедуры


Процедура ПеренестиВзаиморасчетыНаДоговорОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетыСПоставщиками.Валюта КАК Валюта,
		|	АналитикаПоПартнерам.Партнер КАК Партнер,
		|	АналитикаПоПартнерам.Договор КАК ОбъектРасчетов,
		|	РасчетыСПоставщиками.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Остатки(&ДатаОстатков) КАК РасчетыСПоставщиками
		|		{ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
		|		ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.КлючАналитики}
		|ГДЕ
		|	АналитикаПоПартнерам.Партнер = &Партнер
		|	И АналитикаПоПартнерам.Договор <> &Договор
		|	И РасчетыСПоставщиками.СуммаОстаток > 0";
		
		Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(ТекущаяДатаСеанса()));
		Запрос.УстановитьПараметр("Партнер", ДанныеЗаполнения.Партнер);
		Запрос.УстановитьПараметр("Договор", ДанныеЗаполнения);
		
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаЗапроса.Следующий() Тогда
			ЗаполнитьВзаимозачетЗадолженности(Источник, ДанныеЗаполнения, ВыборкаЗапроса.Сумма, ВыборкаЗапроса.ОбъектРасчетов);	
		Иначе
			
			Запрос.УстановитьПараметр("Партнер", Справочники.Партнеры.НайтиПоНаименованию("Поставщик для 10.3"));
			ВыборкаЗапроса.Следующий();
			
			ЗаполнитьВзаимозачетЗадолженности(Источник, ДанныеЗаполнения, 0, ВыборкаЗапроса.ОбъектРасчетов);	
			
		Конецесли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере   
Процедура ЗаполнитьВзаимозачетЗадолженности(ДокументОбъект, Договор, Сумма, ОбъектРасчетов)
	
	ДокументОбъект.ДокументОснование = Договор;
	
	Если ЗначениеЗаполнено(Сумма)
		И Сумма>0 Тогда
		ДокументОбъект.ВидОперации  = Перечисления.ВидыОперацийВзаимозачетаЗадолженности.Поставщика;
		ТипКонтрагента 				= Перечисления.ТипыУчастниковВзаимозачета.Поставщик;
		КонтрагентДебитор			= Договор.Контрагент;
		ПартнерДебитор				= Договор.Партнер;
	Иначе
		ДокументОбъект.ВидОперации  = Перечисления.ВидыОперацийВзаимозачетаЗадолженности.МеждуПоставщиками;
		ТипКонтрагента 				= Перечисления.ТипыУчастниковВзаимозачета.Поставщик;
		КонтрагентДебитор			= Справочники.Контрагенты.НайтиПоНаименованию("Поставщик для 10.3");
		ПартнерДебитор				= Справочники.Партнеры.НайтиПоНаименованию("Поставщик для 10.3");
	КонецЕсли;
	
	ДокументОбъект.Организация    	  = Договор.Организация;
	ДокументОбъект.КонтрагентДебитор  = КонтрагентДебитор;
	ДокументОбъект.КонтрагентКредитор = Договор.Контрагент;
	ДокументОбъект.ТипДебитора        = ТипКонтрагента;
	ДокументОбъект.ТипКредитора       = ТипКонтрагента;
	//ДокументОбъект.Валюта             = Договор.ВалютаВзаиморасчетов;
	//ДокументОбъект.СуммаУпр     	  = Сумма;
	
	СтрокаЗачета = ДокументОбъект.КредиторскаяЗадолженность.Добавить();
	СтрокаАванса = ДокументОбъект.ДебиторскаяЗадолженность.Добавить();
	
	СтрокаАванса.ТипРасчетов		  = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	СтрокаАванса.Партнер              = ПартнерДебитор;
	СтрокаАванса.Заказ				  = ОбъектРасчетов;
	СтрокаАванса.Организация		  = Договор.Организация;
	СтрокаАванса.Сумма                = Сумма;
	СтрокаАванса.СуммаВзаиморасчетов  = Сумма;
	СтрокаАванса.ВалютаВзаиморасчетов = Договор.ВалютаВзаиморасчетов;
	
	СтрокаЗачета.ТипРасчетов		  = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	СтрокаЗачета.Партнер              = Договор.Партнер;
	СтрокаЗачета.Заказ				  = Договор;
	СтрокаЗачета.Организация		  = Договор.Организация;
	СтрокаЗачета.Сумма                = Сумма;
	СтрокаЗачета.СуммаВзаиморасчетов  = Сумма;
	СтрокаЗачета.ВалютаВзаиморасчетов = Договор.ВалютаВзаиморасчетов;
	
	
КонецПроцедуры


Процедура ЗаполнитьМаркуЗаявокНаРасходДенежныхСредствПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Попытка
		
		СтруктураМаркаКоллекция = Новый структура("Марка,Коллекция");
		
		ЗаполнитьЗначенияСвойств(СтруктураМаркаКоллекция, Источник.РасшифровкаПлатежа[0].Заказ);
		ЗаполнитьЗначенияСвойств(Источник, СтруктураМаркаКоллекция);
		
	Исключение
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

Процедура ПереписатьДокументыПоSS18ПриЗаписи(Источник, Отказ) Экспорт
	
	Попытка
		ИспользоватьОбработкуПоПерезаписиПредЗаказовПоSS18 = Бабочка.ПолучитьЗначениеДинамическихНастроек("ИспользоватьОбработкуПоПерезаписиПредЗаказовПоSS18", Истина);
		Если ВРег(Источник.Коллекция) = "SS18" 
			И ВРег(Источник.Партнер) <> ВРег("Поставщик для 10.3") 
			И ИспользоватьОбработкуПоПерезаписиПредЗаказовПоSS18 Тогда
			
			НовыеПараметры = Новый Структура("ВалютаВзаиморасчетов, Партнер, Контрагент, Соглашение, Договор, Организация, Валюта, ПорядокРасчетов", Источник.Валюта);
			
			ЗаполнитьЗначенияСвойств(НовыеПараметры, Источник);
			
			МассивСсылок = КритерииОтбора.СвязанныеДокументы.Найти(Источник.Ссылка);
			
			Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") 
				И ЗначениеЗаполнено(Источник.ПредварительныйЗаказ) Тогда
				МассивСсылок.Добавить(Источник.ПредварительныйЗаказ);
			Конецесли;
			
			Для Каждого Документссылка ИЗ МассивСсылок Цикл
				
				Если ТипЗнч(Документссылка) = Тип("ДокументСсылка.ЗаказПоставщику")  Тогда
					
					МассивСсылок2 = КритерииОтбора.СвязанныеДокументы.Найти(Документссылка);
					
					Для Каждого ПоступлениеСсылка ИЗ МассивСсылок2 Цикл
						МассивСсылок.Добавить(ПоступлениеСсылка);
					КонецЦикла;
					
				Конецесли;
				
			КонецЦикла;				
			
			Для Каждого Документссылка ИЗ МассивСсылок Цикл
				
				ПартнерДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документссылка, "Партнер");
				
				Если ПартнерДокумента = Источник.Партнер Тогда
					Продолжить;
				КонецЕсли;
				
				ДокументОбъект = Документссылка.ПолучитьОбъект();
				
				ЗаполнитьЗначенияСвойств(ДокументОбъект, НовыеПараметры);
				
				Если ДокументОбъект.Проведен Тогда
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Исключение
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры


Процедура ПересчитатьСуммуДокументаОтмененоПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.СуммаСНДС КАК СуммаСНДС,
	|	Товары.Отменено КАК Отменено
	|ПОМЕСТИТЬ
	|	Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Товары.СуммаСНДС),0) КАК СуммаСНДС
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	Товары.Отменено
	|");
	
	Запрос.УстановитьПараметр("Товары", Источник.Товары.Выгрузить(,"Номенклатура,СуммаСНДС,Отменено"));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	СуммаЗаказанныхСтрокОтменено = Выгрузка[0].СуммаСНДС;
	Источник.СуммаДокументаОтменено = СуммаЗаказанныхСтрокОтменено;
	
КонецПроцедуры

Функция УчетПоТоварнымКатегориям(Партнер, Соглашение, ХозяйственнаяОперация=Неопределено) Экспорт
	
	УчетПоТоварнымКатегориям = Ложь;
	
	Попытка
	
		Если ЗначениеЗаполнено(Соглашение) Тогда
			УчетПоТоварнымКатегориям = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Соглашение, "УчетПоТоварнымКатегориям")=Истина;
		Иначе
			УчетПоТоварнымКатегориям = Строка(Партнер) = "Поставщик для 10.3"
										И ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту;
		КонецЕсли;
		
	Исключение
		Возврат Ложь;
	Конецпопытки;
	
	Возврат УчетПоТоварнымКатегориям=Истина;
	
КонецФункции

Процедура ЗаписатьСостояниеЗаявкиПриЗаписи(Источник, Отказ) Экспорт
	
	МассивЗаявок 	= Новый Массив;
	УдалятьДвижения = Ложь;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		УдалятьДвижения = НЕ Источник.Проведен;
		МассивЗаявок.Добавить(Источник.Ссылка);
	КонецЕсли;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") 
		И ЗначениеЗаполнено(Источник.ЗаявкаНаРасходованиеДенежныхСредств) Тогда
		МассивЗаявок.Добавить(Источник.ЗаявкаНаРасходованиеДенежныхСредств);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		РегистрыСведений.СостоянияЗаявокНаРасходованиеСредств.ОтразитьСостояниеЗаявки(МассивЗаявок, Отказ, УдалятьДвижения);
	Исключение
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

Функция РазложитьТоварыПоКатегориямЗаказПоставщику(Товары, ЧастьКоллекции=Неопределено)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	Товары.Отменено КАК Отменено,
	|	ВЫРАЗИТЬ(Товары.ЗаказПоставщику КАК Документ.ЗаказПоставщику) КАК ЗаказПоставщику,
	|	ВЫРАЗИТЬ(Товары.ПредварительныйЗаказ КАК Документ.ПредварительныйЗаказ) КАК ПредварительныйЗаказ,
	|	Товары.Сумма КАК Сумма,
	|	Товары.Количество КАК Количество,
	|	Товары.СуммаИнвойс КАК СуммаИнвойс
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	Товары.ПредварительныйЗаказ КАК ПредварительныйЗаказ,
	|	СУММА(Товары.Сумма) КАК Сумма,
	|	СУММА(Товары.Количество) КАК КоличествоТоваров,
	|	СУММА(Товары.СуммаИнвойс) КАК СуммаИнвойсТовары
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	НЕ Товары.Отменено
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура.ТоварнаяКатегория,
	|	Товары.ПредварительныйЗаказ
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(КоличествоТоваров),
	|	СУММА(СуммаИнвойсТовары)
	|ПО
	|	ПредварительныйЗаказ,
	|	ТоварнаяКатегория ИЕРАРХИЯ";
	
	ТаблицаТоваров = Товары.Выгрузить();
	
	Если ТаблицаТоваров.Колонки.Найти("Отменено")=Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("Отменено", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	Если ТаблицаТоваров.Колонки.Найти("ЗаказПоставщику")=Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("ЗаказПоставщику", Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику"));
	КонецЕсли;
	
	Если ТаблицаТоваров.Колонки.Найти("ПредварительныйЗаказ")=Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("ПредварительныйЗаказ", Новый ОписаниеТипов("ДокументСсылка.ПредварительныйЗаказ"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЧастьКоллекции", ?(ЧастьКоллекции=Неопределено, Перечисления.ЧастьКоллекции.ПустаяСсылка(), ЧастьКоллекции));
	Запрос.УстановитьПараметр("Товары", ТаблицаТоваров);
	
	ТаблицаКатегорий = Запрос.Выполнить().Выгрузить(); //для колонок
	ТаблицаКатегорий.Очистить();
	
	ВыборкаТоварнаяКатегория = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТоварнаяКатегория.Следующий() Цикл
		
		ВыборкаПредварительныйЗаказ = ВыборкаТоварнаяКатегория.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
		Пока ВыборкаПредварительныйЗаказ.Следующий() Цикл
			строкаТЗ = ТаблицаКатегорий.Добавить();
			ЗаполнитьЗначенияСвойств(строкаТЗ,ВыборкаПредварительныйЗаказ);		
		КонецЦикла; 
		
	КонецЦикла;


	Если ЧастьКоллекции<>Неопределено Тогда
		ТаблицаКатегорий.Колонки.Добавить("ЧастьКоллекции", Новый ОписаниеТипов("ПеречислениеСсылка.ЧастьКоллекции"));
		ТаблицаКатегорий.ЗаполнитьЗначения(ЧастьКоллекции, "ЧастьКоллекции");
	КонецЕсли;
	
	
	Возврат ТаблицаКатегорий;
	
КонецФункции

#Область Проведение

Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт

	Параметры = ПроведениеДокументов.ПараметрыУчетногоМеханизма();

	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.ПреварительныеЗаказы);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.ЗаказыПоставщикамТоварныеКатегории);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.ПреварительныеЗаказыТоварныеКатегории);

	КонецЕсли;

	Возврат Параметры;

КонецФункции

Функция ТекстыЗапросовСторнирования(МетаданныеДокумента) Экспорт

	ТекстыЗапросов = Новый Соответствие();
	ДвиженияДокумента = МетаданныеДокумента.Движения;

	МетаданныеРегистра = Метаданные.РегистрыНакопления.ПреварительныеЗаказы;
	Если ДвиженияДокумента.Содержит(МетаданныеРегистра) Тогда
		ТекстыЗапросов.Вставить(МетаданныеРегистра.ПолноеИмя(),
			ПроведениеДокументов.ТекстСторнирующегоЗапроса(МетаданныеРегистра, МетаданныеДокумента));
	КонецЕсли;

	МетаданныеРегистра = Метаданные.РегистрыНакопления.ПреварительныеЗаказыТоварныеКатегории;
	Если ДвиженияДокумента.Содержит(МетаданныеРегистра) Тогда
		ТекстыЗапросов.Вставить(МетаданныеРегистра.ПолноеИмя(),
			ПроведениеДокументов.ТекстСторнирующегоЗапроса(МетаданныеРегистра, МетаданныеДокумента));
		КонецЕсли;
		
	МетаданныеРегистра = Метаданные.РегистрыНакопления.ЗаказыПоставщикамТоварныеКатегории;
	Если ДвиженияДокумента.Содержит(МетаданныеРегистра) Тогда
		ТекстыЗапросов.Вставить(МетаданныеРегистра.ПолноеИмя(),
			ПроведениеДокументов.ТекстСторнирующегоЗапроса(МетаданныеРегистра, МетаданныеДокумента));
	КонецЕсли;


	Возврат ТекстыЗапросов;

КонецФункции

Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "ПреварительныеЗаказы");
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "ЗаказыПоставщикамТоварныеКатегории");
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "ПреварительныеЗаказыТоварныеКатегории");

КонецПроцедуры 

Функция ТекстыЗапросовКонтрольДатыЗапретаПоТаблицеИзменений(Запрос) Экспорт

	СоответствиеТекстовЗапросов = Новый Соответствие();
	Возврат СоответствиеТекстовЗапросов;
	
КонецФункции


#КонецОбласти
