
#Область СлужебныеПроцедурыИФункции

Функция ВозможностьПостоплаты(Клиент)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Значение
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |ГДЕ
	               |	ДополнительныеСведения.Объект = &Объект
	               |	И ДополнительныеСведения.Свойство = &Свойство";
	Запрос.УстановитьПараметр("Объект", Клиент);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Разрешено отдавать в постоплату (Клиенты)"));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗначениеСвойства = Выборка.Значение;
	Иначе
		ЗначениеСвойства = Ложь;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ЗначениеСвойства;
КонецФункции



Функция НайтиШтрихкодУпаковкиВЗаказе(Номенклатура, Характеристика, ЗаказКлиента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркируемыеТоварыВЗаказеКлиента.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ИЗ
		|	РегистрСведений.МаркируемыеТоварыВЗаказеКлиента КАК МаркируемыеТоварыВЗаказеКлиента
		|ГДЕ
		|	МаркируемыеТоварыВЗаказеКлиента.Номенклатура = &Номенклатура
		|	И МаркируемыеТоварыВЗаказеКлиента.Характеристика = &Характеристика
		|	И МаркируемыеТоварыВЗаказеКлиента.ЗаказКлиента = &ЗаказКлиента";
	
	Запрос.УстановитьПараметр("Номенклатура"	, Номенклатура);	
	Запрос.УстановитьПараметр("Характеристика"	, Характеристика);	
	Запрос.УстановитьПараметр("ЗаказКлиента"	, ЗаказКлиента);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ШтрихкодУпаковки;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции 
Функция ПерезаполнитьВидыЗапасовДляКомиссионныхТоваров_Babochka(ПерезаполнитьВидыЗапасов, МенеджерВременныхТаблиц)
	
	Если (Статус <> Перечисления.СтатусыРеализацийТоваровУслуг.КПредоплате
			Или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию)
		И (Не Проведен
			Или ПерезаполнитьВидыЗапасов
			Или ПроверитьИзменениеРеквизитовДокумента(МенеджерВременныхТаблиц)
			Или ПроверитьИзменениеТоваров(МенеджерВременныхТаблиц))Тогда
	
		Для каждого СтрокаТЧ Из ВидыЗапасов Цикл
			
			РезультатЗапроса = ПолучитьКорректныйВидЗапасов(СтрокаТЧ.АналитикаУчетаНоменклатуры.Номенклатура, СтрокаТЧ.АналитикаУчетаНоменклатуры.Характеристика);	
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Следующий() Тогда
				СтрокаТЧ.ВидЗапасов = Выборка.Ссылка;	
			КонецЕсли; 
				
		КонецЦикла; 
	КонецЕсли;
	
КонецФункции  


//для комиссионных товаров автоматически вид запасов подбирается неправильный (собственный)
//запрос из справочника ВидыЗапаса при подборе по остаткам
Функция ПолучитьКорректныйВидЗапасов(Номенклатура, Характеристика)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ВидыЗапасов.Ссылка КАК Ссылка,
		|	ВидыЗапасов.РеализацияЗапасовДругойОрганизации КАК РеализацияЗапасовДругойОрганизации,
		|	ВидыЗапасов.ПометкаУдаления КАК ПометкаУдаления,
		|	ВидыЗапасов.Предопределенный КАК Предопределенный,
		|	ВидыЗапасов.Наименование КАК Наименование,
		|	ВидыЗапасов.ТипЗапасов КАК ТипЗапасов,
		|	ВидыЗапасов.НалогообложениеНДС КАК НалогообложениеНДС,
		|	ВидыЗапасов.ВладелецТовара КАК ВладелецТовара,
		|	ВидыЗапасов.Соглашение КАК Соглашение,
		|	ВидыЗапасов.Валюта КАК Валюта,
		|	ВидыЗапасов.Организация КАК Организация,
		|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Серия КАК Серия,
		|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад
		|ПОМЕСТИТЬ ВТВидыЗапасов
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций.ОстаткиИОбороты(&МоментВремени, &МоментВремени, Период, , ) КАК ТоварыОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
		|		ПО (ВидыЗапасов.Ссылка = ТоварыОрганизаций.ВидЗапасов)
		|ГДЕ
		|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
		|	И ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Характеристика = &Характеристика
		|	И ТоварыОрганизаций.АналитикаУчетаНоменклатуры.МестоХранения = &Склад
		|	И ВидыЗапасов.Организация = &Организация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	АналитикаУчетаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализованныеТовары.ВидЗапасов КАК ВидЗапасов,
		|	РеализованныеТовары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	РеализованныеТовары.Регистратор КАК ДокументРеализации,
		|	ЕСТЬNULL(РеализованныеТовары.КоличествоРасход, 0) КАК Продано
		|ПОМЕСТИТЬ ВТРеализованныеТовары
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			&ПоДокументуРеализации
		|				И (ВидЗапасов, АналитикаУчетаНоменклатуры) В
		|					(ВЫБРАТЬ
		|						Таблица.Ссылка КАК ВидЗапасов,
		|						Таблица.АналитикаУчетаНоменклатуры
		|					ИЗ
		|						ВТВидыЗапасов КАК Таблица)) КАК РеализованныеТовары
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидЗапасов,
		|	АналитикаУчетаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.ВидЗапасов КАК ВидЗапасов,
		|	Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК Остаток
		|ПОМЕСТИТЬ ВТОстатки
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций.Остатки(
		|			,
		|			(ВидЗапасов, АналитикаУчетаНоменклатуры) В
		|				(ВЫБРАТЬ
		|					Таблица.Ссылка КАК ВидЗапасов,
		|					Таблица.АналитикаУчетаНоменклатуры
		|				ИЗ
		|					ВТВидыЗапасов КАК Таблица)) КАК Остатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидЗапасов,
		|	АналитикаУчетаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВидыЗапасов.Ссылка КАК Ссылка,
		|	ВидыЗапасов.ПометкаУдаления КАК ПометкаУдаления,
		|	ВидыЗапасов.Предопределенный КАК Предопределенный,
		|	ВидыЗапасов.Наименование КАК Наименование,
		|	ВидыЗапасов.ТипЗапасов КАК ТипЗапасов,
		|	ВидыЗапасов.НалогообложениеНДС КАК НалогообложениеНДС,
		|	ВидыЗапасов.ВладелецТовара КАК ВладелецТовара,
		|	ВидыЗапасов.Соглашение КАК Соглашение,
		|	ВидыЗапасов.Валюта КАК Валюта,
		|	ВидыЗапасов.Организация КАК Организация,
		|	ВидыЗапасов.Номенклатура КАК Номенклатура,
		|	ВидыЗапасов.Характеристика КАК Характеристика,
		|	ВидыЗапасов.Серия КАК Серия,
		|	ВидыЗапасов.Склад КАК Склад,
		|	РеализованныеТовары.ДокументРеализации КАК ДокументРеализации,
		|	ЕСТЬNULL(Остатки.Остаток, 0) КАК Остаток,
		|	ЕСТЬNULL(РеализованныеТовары.Продано, 0) КАК Продано,
		|	ЕСТЬNULL(СправочникНоменклатура.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО) КАК ЕдиницаИзмерения
		|ИЗ
		|	ВТВидыЗапасов КАК ВидыЗапасов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО ВидыЗапасов.Номенклатура = СправочникНоменклатура.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРеализованныеТовары КАК РеализованныеТовары
		|		ПО ВидыЗапасов.Ссылка = РеализованныеТовары.ВидЗапасов
		|			И ВидыЗапасов.АналитикаУчетаНоменклатуры = РеализованныеТовары.АналитикаУчетаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК Остатки
		|		ПО ВидыЗапасов.Ссылка = Остатки.ВидЗапасов
		|			И ВидыЗапасов.АналитикаУчетаНоменклатуры = Остатки.АналитикаУчетаНоменклатуры
		|ГДЕ
		|	НЕ ВидыЗапасов.РеализацияЗапасовДругойОрганизации
		|	И НЕ ВидыЗапасов.ПометкаУдаления
		|	И ЕСТЬNULL(Остатки.Остаток, 0) > 0";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПоДокументуРеализации", Ложь);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	Возврат Запрос.Выполнить();

КонецФункции
   
Функция ПользователюРазрешеноИзменениеРеализаций()
    
    СписокГруппДоступа = Новый Массив;
    СписокГруппДоступа.Добавить(Справочники.ГруппыДоступа.НайтиПоКоду("000000132")); //Изменение заказов/реализаций клиента для бонусов
    СписокГруппДоступа.Добавить(Справочники.ГруппыДоступа.НайтиПоКоду("000000007")); //Администраторы
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ГруппыДоступаПользователи.Ссылка КАК Ссылка,
        |   ГруппыДоступаПользователи.Пользователь КАК Пользователь
        |ИЗ
        |   Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
        |ГДЕ
        |   ГруппыДоступаПользователи.Ссылка В(&СписокГруппДоступа)
        |   И ГруппыДоступаПользователи.Пользователь = &Пользователь";
    
    Запрос.УстановитьПараметр("СписокГруппДоступа", СписокГруппДоступа);
    Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если РезультатЗапроса.Пустой() Тогда
        Возврат Ложь;
    Иначе
        Возврат Истина;
    КонецЕсли; 
    
    
КонецФункции

&ИзменениеИКонтроль("ЗаполнитьДокументНаОснованииЗаказаКлиента")
Процедура ba_ЗаполнитьДокументНаОснованииЗаказаКлиента(Знач ДокументОснование, Знач СкладОтгрузки, ВариантОформления, РеквизитыЗаказа, ПараметрыОформления, ХозяйственнаяОперацияРеализации)

	ТипОснования = ТипЗнч(ДокументОснование);
	ЗаполнятьПоОстаткам = Ложь;
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	
	ВводитьНаОснованииНепроведенного = Ложь;
	Если Не ПараметрыОформления = Неопределено И ТипЗнч(ПараметрыОформления) = Тип("Структура") Тогда
		ПараметрыОформления.Свойство("ВводитьНаОснованииНепроведенного", ВводитьНаОснованииНепроведенного);
		ВводитьНаОснованииНепроведенного = ?(ВводитьНаОснованииНепроведенного = Неопределено, Ложь, ВводитьНаОснованииНепроведенного)
	КонецЕсли;
	
	#Вставка 
	Если ТипОснования = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		Если Не (возможностьпостоплаты(ДокументОснование.Партнер) и ЗначениеЗаполнено(ДокументОСнование.ОтветстветственныйЗаПостоплату)
			И ДокументОснование.ВидЗаказа = Перечисления.ВидыЗаказов.Постоплата) и ДокументОснование.ВидЗаказа <> Перечисления.ВидыЗаказов.МТМ 
			и ДокументОснование.ВидЗаказа <> Перечисления.ВидыЗаказов.Сотрудник и ДокументОснование.ВидЗаказа <> Перечисления.ВидыЗаказов.KUPIVIP Тогда
			
			ПроверитьОплатуПоЗаказуКлиента(ДокументОснование);
			//bg если клиенту не разрешена постоплата 
		ИначеЕсли ДокументОснование.ВидЗаказа = Перечисления.ВидыЗаказов.Постоплата И 
			(НЕ возможностьпостоплаты(ДокументОснование.Партнер) ИЛИ НЕ ЗначениеЗаполнено(ДокументОСнование.ОтветстветственныйЗаПостоплату)) Тогда
			
			
			//МТМ в постоплату
		ИначеЕсли ДокументОснование.ВидЗаказа = Перечисления.ВидыЗаказов.МТМ И ДокументОснование.Постоплата И
			(НЕ возможностьпостоплаты(ДокументОснование.Партнер) ИЛИ НЕ ЗначениеЗаполнено(ДокументОСнование.ОтветстветственныйЗаПостоплату)) Тогда
			
			Если НЕ ЗначениеЗаполнено(ДокументОСнование.ОтветстветственныйЗаПостоплату) Тогда
				ВызватьИсключение НСтр("ru='Для заказа не введен ответственный!'");
				Возврат;	
			КонецЕсли; 
			
			
			ПроверитьОплатуПоЗаказуКлиента(ДокументОснование);
			//если МТМ не отгружать без оплаты	
		ИначеЕсли ДокументОснование.ВидЗаказа = Перечисления.ВидыЗаказов.МТМ И НЕ ДокументОснование.Постоплата Тогда
			
			ПроверитьОплатуПоЗаказуКлиента(ДокументОснование);
		КонецЕсли;
		
	КонецЕсли;
	#КонецВставки

	Если ТипОснования = Тип("ДокументСсылка.ЗаказКлиента") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = Документы.РеализацияТоваровУслуг.ТекстЗапросаЗаполненияНаОснованииЗаказа();

		Запрос.УстановитьПараметр("ЗаказКлиента", ДокументОснование);
		Запрос.УстановитьПараметр("ИспользоватьСоглашенияСКлиентами", ИспользоватьСоглашенияСКлиентами);
		Запрос.УстановитьПараметр("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками",
		ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками"));
		Запрос.УстановитьПараметр("ВводитьНаОснованииНепроведенного", ВводитьНаОснованииНепроведенного);

		РезультатЗапроса = Запрос.ВыполнитьПакет();

		РеквизитыЗаказа = РезультатЗапроса[0].Выбрать();
		РеквизитыЗаказа.Следующий();

		ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОснованииПоОперации(ДокументОснование,
		"РеализацияТоваровУслуг",
		РеквизитыЗаказа.ХозяйственнаяОперация,
		ВариантОформления);

		Документы.ЗаказКлиента.ПроверитьВозможностьВводаНаОсновании(
		РеквизитыЗаказа.ЗаказКлиента,
		РеквизитыЗаказа.СтатусДокумента,
		РеквизитыЗаказа.ЕстьОшибкиПроведен);

		// Заполнение шапки
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыЗаказа);

		Если ЗначениеЗаполнено(ХозяйственнаяОперацияРеализации) Тогда
			ХозяйственнаяОперация = ХозяйственнаяОперацияРеализации;
		КонецЕсли;

		Если РеквизитыЗаказа.ЭтоЗаказКакСчет Тогда

			Если Не ЗначениеЗаполнено(Дата) Тогда
				Дата = ТекущаяДатаСеанса();
			КонецЕсли;

		КонецЕсли;

		ДатаВозвратаМногооборотнойТары = МногооборотнаяТараСервер.РассчитатьДатуВозвратаМногооборотнойТары(
		ЭтотОбъект,
		РеквизитыЗаказа.СрокВозвратаМногооборотнойТары,
		РеквизитыЗаказа.РассчитыватьДатуВозвратаТарыПоКалендарю,
		РеквизитыЗаказа.КалендарьВозвратаТары);

		Если РеквизитыЗаказа.ЗапрещеноВыбиратьГруппуСкладов Тогда
			МассивСкладов = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Склад");
		КонецЕсли;

	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявкаНаВозврат.Ссылка                КАК ЗаказКлиента,
		|	ЗаявкаНаВозврат.Партнер               КАК Партнер,
		|	ЗаявкаНаВозврат.Контрагент            КАК Контрагент,
		|	ЗаявкаНаВозврат.КонтактноеЛицо        КАК КонтактноеЛицо,
		|	ЗаявкаНаВозврат.Договор               КАК Договор,
		|	ЗаявкаНаВозврат.Организация           КАК Организация,
		|	ЗаявкаНаВозврат.ФормаОплаты           КАК ФормаОплаты,
		|	ЗаявкаНаВозврат.Соглашение            КАК Соглашение,
		|	ЗаявкаНаВозврат.Сделка                КАК Сделка,
		|	ЗаявкаНаВозврат.Валюта                КАК Валюта,
		|	ЗаявкаНаВозврат.Валюта                КАК ВалютаВзаиморасчетов,
		|	ЗаявкаНаВозврат.ГрафикОплаты          КАК ГрафикОплаты,
		|	ЗаявкаНаВозврат.ДатаОтгрузки          КАК ДатаОтгрузки,
		|	ЗаявкаНаВозврат.ЭтоЗаказКакСчет       КАК ЭтоЗаказКакСчет,
		|	ВЫБОР
		|		КОГДА ЗаявкаНаВозврат.Склад.ЭтоГруппа
		|			И ЗаявкаНаВозврат.Склад.ВыборГруппы = ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|		ИНАЧЕ ЗаявкаНаВозврат.Склад
		|	КОНЕЦ КАК Склад,
		|	ВЫБОР КОГДА ЗаявкаНаВозврат.Склад.ЭтоГруппа
		|		И ЗаявкаНаВозврат.Склад.ВыборГруппы = ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах)
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЗапрещеноВыбиратьГруппуСкладов,
		|	ЗаявкаНаВозврат.ЦенаВключаетНДС       КАК ЦенаВключаетНДС,
		|	ЗаявкаНаВозврат.НалогообложениеНДС    КАК НалогообложениеНДС,
		|	ВЫБОР
		|		КОГДА ЗаявкаНаВозврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента)
		|				ИЛИ ЗаявкаНаВозврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
		|		КОГДА ЗаявкаНаВозврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи)
		|	КОНЕЦ КАК ХозяйственнаяОперация,
		|	ЗаявкаНаВозврат.НеОтгружатьЧастями    КАК НеОтгружатьЧастями,
		|	ЗаявкаНаВозврат.АдресДоставки         КАК АдресДоставки,
		|	ЗаявкаНаВозврат.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке КАК ОрдернаяСхемаПриОтгрузке,
		|	ЗаявкаНаВозврат.ВернутьМногооборотнуюТару      КАК ВернутьМногооборотнуюТару,
		|	ЗаявкаНаВозврат.СрокВозвратаМногооборотнойТары КАК СрокВозвратаМногооборотнойТары,
		|	ЗаявкаНаВозврат.ТребуетсяЗалогЗаТару           КАК ТребуетсяЗалогЗаТару,
		|	ВЫБОР
		|		КОГДА &ИспользоватьСоглашенияСКлиентами 
		|			ТОГДА ЗаявкаНаВозврат.Соглашение.КалендарьВозвратаТары
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПроизводственныеКалендари.ПустаяСсылка)
		|	КОНЕЦ КАК КалендарьВозвратаТары,
		|	ВЫБОР
		|		КОГДА &ИспользоватьСоглашенияСКлиентами 
		|			ТОГДА ЗаявкаНаВозврат.Соглашение.РассчитыватьДатуВозвратаТарыПоКалендарю
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РассчитыватьДатуВозвратаТарыПоКалендарю,
		|	ЗаявкаНаВозврат.Статус               КАК СтатусДокумента,
		|	НЕ ЗаявкаНаВозврат.Проведен          КАК ЕстьОшибкиПроведен,
		|
		|	ЗаявкаНаВозврат.БанковскийСчет                 КАК БанковскийСчетОрганизации,
		|	ЗаявкаНаВозврат.БанковскийСчетКонтрагента      КАК БанковскийСчетКонтрагента,
		|	ЗаявкаНаВозврат.Грузоотправитель               КАК Грузоотправитель,
		|	ЗаявкаНаВозврат.Грузополучатель                КАК Грузополучатель,
		|	ЗаявкаНаВозврат.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
		|	ЗаявкаНаВозврат.БанковскийСчетГрузополучателя  КАК БанковскийСчетГрузополучателя,
		|
		|	ЗаявкаНаВозврат.СкидкиНаценки.(
		|		КлючСвязи,
		|		СкидкаНаценка,
		|		Сумма
		|	) КАК СкидкиНаценки,
		|	ЗаявкаНаВозврат.АдресДоставкиЗначенияПолей     КАК АдресДоставкиЗначенияПолей,
		|	ВЫБОР КОГДА НЕ &ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками
		|		И ЗаявкаНаВозврат.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика) ТОГДА
		|		ЗаявкаНаВозврат.СпособДоставки
		|	КОНЕЦ                                          КАК СпособДоставки,
		|
		|	ВЫБОР КОГДА ЗаявкаНаВозврат.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика) ТОГДА
		|		ЗаявкаНаВозврат.ПеревозчикПартнер
		|	КОНЕЦ                                          КАК ПеревозчикПартнер,
		|
		|	ВЫБОР КОГДА НЕ &ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками
		|		И ЗаявкаНаВозврат.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика) ТОГДА
		|		ЗаявкаНаВозврат.ДополнительнаяИнформацияПоДоставке
		|	КОНЕЦ                                          КАК ДополнительнаяИнформацияПоДоставке,
		|
		|	ЗаявкаНаВозврат.ПорядокРасчетов                КАК ПорядокРасчетов,
		|	ЗаявкаНаВозврат.НаправлениеДеятельности        КАК НаправлениеДеятельности
		|
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозврат
		|ГДЕ
		|	ЗаявкаНаВозврат.Ссылка = &ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаспоряженияНаОтгрузкуОтгружено.Склад КАК Склад
		|ИЗ
		|	#РаспоряженияНаОтгрузкуОборотыРазвернутая КАК РаспоряженияНаОтгрузкуОтгружено
		|ГДЕ
		|	РаспоряженияНаОтгрузкуОтгружено.КОтгрузкеКоличествоОборот
		|		- РаспоряженияНаОтгрузкуОтгружено.ОтгруженоКоличествоОборот > 0
		|";

		ПараметрыФормированияТаблицы = РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат.НовыйПараметрыФормированияРазвернутойТаблицы();
		ПараметрыФормированияТаблицы.ТекстУсловия = "
		|	Распоряжение = &ДокументОснование
		|";
		ПараметрыФормированияТаблицы.Группировка = "Склад";
		ПараметрыФормированияТаблицы.Показатели = "КОтгрузке, Отгружено";
		ПараметрыФормированияТаблицы.Ресурсы = "Количество";

		РаспоряженияНаОтгрузкуОборотыРазвернутая =
		РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат.ТекстЗапросаРазвернутаяТаблица(
		ПараметрыФормированияТаблицы);

		Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"#РаспоряженияНаОтгрузкуОборотыРазвернутая",
		РаспоряженияНаОтгрузкуОборотыРазвернутая);

		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		Запрос.УстановитьПараметр("ИспользоватьСоглашенияСКлиентами", ИспользоватьСоглашенияСКлиентами);
		Запрос.УстановитьПараметр("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками",
		ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками"));

		РезультатЗапроса = Запрос.ВыполнитьПакет();

		РеквизитыЗаказа = РезультатЗапроса[0].Выбрать();
		РеквизитыЗаказа.Следующий();

		ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОснованииПоОперации(ДокументОснование,
		"РеализацияТоваровУслуг",
		РеквизитыЗаказа.ХозяйственнаяОперация,
		ВариантОформления);

		Документы.ЗаявкаНаВозвратТоваровОтКлиента.ПроверитьВозможностьВводаНаОсновании(
		РеквизитыЗаказа.ЗаказКлиента,
		РеквизитыЗаказа.СтатусДокумента,
		РеквизитыЗаказа.ЕстьОшибкиПроведен);

		// Заполнение шапки.
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыЗаказа);
		Если РеквизитыЗаказа.ЭтоЗаказКакСчет Тогда
			Если НЕ ЗначениеЗаполнено(Дата) Тогда
				Дата = ТекущаяДатаСеанса();
			КонецЕсли;
		КонецЕсли;
		ДатаВозвратаМногооборотнойТары = МногооборотнаяТараСервер.РассчитатьДатуВозвратаМногооборотнойТары(
		ЭтотОбъект,
		РеквизитыЗаказа.СрокВозвратаМногооборотнойТары,
		РеквизитыЗаказа.РассчитыватьДатуВозвратаТарыПоКалендарю,
		РеквизитыЗаказа.КалендарьВозвратаТары);

		Если РеквизитыЗаказа.ЗапрещеноВыбиратьГруппуСкладов Тогда
			МассивСкладов = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Склад");
		КонецЕсли;

	ИначеЕсли ТипОснования = Тип("Массив") Тогда

		// Заполнение шапки.
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыЗаказа);

		Если ЗначениеЗаполнено(ХозяйственнаяОперацияРеализации) Тогда
			ХозяйственнаяОперация = ХозяйственнаяОперацияРеализации;
		КонецЕсли;

		Валюта = ВалютаВзаиморасчетов;
		БанковскийСчетОрганизации = РеквизитыЗаказа.БанковскийСчет;
		ДатаВозвратаМногооборотнойТары = МногооборотнаяТараСервер.РассчитатьДатуВозвратаМногооборотнойТары(
		ЭтотОбъект,
		РеквизитыЗаказа.СрокВозвратаМногооборотнойТары,
		РеквизитыЗаказа.РассчитыватьДатуВозвратаТарыПоКалендарю,
		РеквизитыЗаказа.КалендарьВозвратаТары);

		ПродажиСервер.ЗаполнитьБанковскиеСчетаПоДоговору(Договор, БанковскийСчетОрганизации, БанковскийСчетКонтрагента);
		Если Не ЗначениеЗаполнено(БанковскийСчетОрганизации) Тогда
			СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
			СтруктураПараметров.Организация    		= Организация;
			СтруктураПараметров.БанковскийСчет		= БанковскийСчетОрганизации;
			БанковскийСчетОрганизации = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(БанковскийСчетКонтрагента) Тогда
			БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(Контрагент, , БанковскийСчетКонтрагента);
		КонецЕсли;

		Если РеквизитыЗаказа.ЗапрещеноВыбиратьГруппуСкладов Тогда

			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("МассивДокументов", ДокументОснование);
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РаспоряженияНаОтгрузкуОтгружено.Склад КАК Склад
			|ИЗ
			|	#РаспоряженияНаОтгрузкуОборотыРазвернутая КАК РаспоряженияНаОтгрузкуОтгружено
			|ГДЕ
			|	РаспоряженияНаОтгрузкуОтгружено.КОтгрузкеКоличествоОборот
			|		- РаспоряженияНаОтгрузкуОтгружено.ОтгруженоКоличествоОборот > 0
			|";

			ПараметрыФормированияТаблицы = РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат.НовыйПараметрыФормированияРазвернутойТаблицы();
			ПараметрыФормированияТаблицы.ТекстУсловия = "
			|	Распоряжение В (&МассивДокументов)
			|";
			ПараметрыФормированияТаблицы.Группировка = "Склад";
			ПараметрыФормированияТаблицы.Показатели = "КОтгрузке, Отгружено";
			ПараметрыФормированияТаблицы.Ресурсы = "Количество";

			РаспоряженияНаОтгрузкуОборотыРазвернутая =
			РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат.ТекстЗапросаРазвернутаяТаблица(
			ПараметрыФормированияТаблицы);

			Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"#РаспоряженияНаОтгрузкуОборотыРазвернутая",
			РаспоряженияНаОтгрузкуОборотыРазвернутая);

			РезультатЗапросаПоСкладам = Запрос.Выполнить();
			МассивСкладов = РезультатЗапросаПоСкладам.Выгрузить().ВыгрузитьКолонку("Склад");
			Склад = РеквизитыЗаказа.СкладОтгрузки;

		КонецЕсли;

	КонецЕсли;

	Если ХозяйственнаяОперацияРеализации = Перечисления.ХозяйственныеОперации.ПереходПраваСобственности
		И ИспользоватьСоглашенияСКлиентами
		И ЗначениеЗаполнено(Соглашение) Тогда

		РеквизитыСоглашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соглашение,
		"ВозможнаРеализацияБезПереходаПраваСобственности, ИспользуютсяДоговорыКонтрагентов, Представление");

		Если Не РеквизитыСоглашения.ВозможнаРеализацияБезПереходаПраваСобственности Тогда

			ТекстИсключения = НСтр("ru = 'По соглашению ""%1"" невозможна отгрузка товаров без перехода права собственности.'");
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстИсключения,
			РеквизитыСоглашения.Представление);

			ВызватьИсключение ТекстИсключения;

		КонецЕсли;

		Если Не РеквизитыСоглашения.ИспользуютсяДоговорыКонтрагентов Тогда

			ТекстИсключения = НСтр("ru = 'В соглашении ""%1"" не используются договоры с контрагентами. Использование договоров является обязательным для реализации товаров с отложенным переходом права собственности.'");
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстИсключения,
			РеквизитыСоглашения.Представление);

			ВызватьИсключение ТекстИсключения;

		КонецЕсли;

	КонецЕсли;

	РеализацияПоЗаказам = Истина;

	Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
		Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Соглашение) Тогда
			УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(Соглашение);
			ФормаОплаты   = УсловияПродаж.ФормаОплаты;

			СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияКассыОрганизацииПоУмолчанию();
			СтруктураПараметров.Организация    			= Организация;
			СтруктураПараметров.НаправлениеДеятельности	= НаправлениеДеятельности;
			СтруктураПараметров.ФормаОплаты				= ФормаОплаты;
			СтруктураПараметров.ФизическоеЛицо			= Курьер;

			Касса = ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию(СтруктураПараметров);
		КонецЕсли;
	КонецЕсли;

	// Заполнение т.ч. товары.
	Если ХозяйственнаяОперацияРеализации = Перечисления.ХозяйственныеОперации.ПереходПраваСобственности Тогда

		ЗаполнятьПоОстаткам = Истина;
		Склад = Справочники.Склады.ПустаяСсылка();
		СкладОтгрузки = Справочники.Склады.ПустаяСсылка();

	ИначеЕсли Не ЗначениеЗаполнено(СкладОтгрузки) Тогда
		Если РеквизитыЗаказа.ЗапрещеноВыбиратьГруппуСкладов Тогда
			// Только услуги
			Если МассивСкладов.Количество() = 0 Тогда
				ЗаполнятьПоОстаткам = Истина;
				// Услуги или товары
			ИначеЕсли МассивСкладов.Количество() >= 1 Тогда
				СкладОтгрузки = МассивСкладов[0];
				Склад = СкладОтгрузки;
				ЗаполнятьПоОстаткам = Истина;
			КонецЕсли;
		Иначе
			ЗаполнятьПоОстаткам = Истина;
			СкладОтгрузки = Склад;
		КонецЕсли;
	Иначе
		Если РеквизитыЗаказа.ЗапрещеноВыбиратьГруппуСкладов Тогда
			Склад = СкладОтгрузки;
		КонецЕсли;
		ЗаполнятьПоОстаткам = Истина;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
	КонецЕсли;

	Если ВводитьНаОснованииНепроведенного Тогда
		ЗаполнятьПоОстаткам = Ложь;
	КонецЕсли;

	Если ЗаполнятьПоОстаткам Тогда

		Если ТипОснования = Тип("Массив") Тогда
			МассивЗаказов = ДокументОснование;
		Иначе
			МассивЗаказов = Новый Массив();
			МассивЗаказов.Добавить(ЗаказКлиента);
		КонецЕсли;

		ВариантОформленияПродажи = ?(ЗначениеЗаполнено(ВариантОформления), 
		ВариантОформления,
		Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг);

		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ВариантОформления", ВариантОформленияПродажи);
		ПараметрыЗаполнения.Вставить("ПараметрыОформления", ПараметрыОформления);
		ПараметрыЗаполнения.Вставить("ИспользоватьРасширенныеВозможностиЗаказаКлиента", Не РеквизитыЗаказа.ЭтоЗаказКакСчет);

		Если ПараметрыОформления <> Неопределено 
			И ПараметрыОформления.Свойство("ПроверитьСклады") Тогда
			ПараметрыЗаполнения.Вставить("ПроверитьСклады", ПараметрыОформления.ПроверитьСклады);
		КонецЕсли;

		РеализацияТоваровУслугЛокализация.ДополнитьПараметрыЗаполнения(ПараметрыЗаполнения, РеквизитыЗаказа);

		Документы.РеализацияТоваровУслуг.ЗаполнитьПоОстаткамЗаказов(
		ЭтотОбъект,
		Товары,
		СкидкиНаценки,
		НачислениеБонусныхБаллов,
		?(СкладОтгрузки=Неопределено, Справочники.Склады.ПустаяСсылка(), СкладОтгрузки),
		МассивЗаказов,
		ПараметрыЗаполнения,
		ШтрихкодыУпаковок);
		Штрихкоды = ШтрихкодыУпаковок.Выгрузить();
		Штрихкоды.Свернуть("ШтрихкодУпаковки");
		ШтрихкодыУпаковок.Загрузить(Штрихкоды);

		ЗаказыСервер.ЗаполнитьЗаказВШапкеПоЗаказамВТабличнойЧасти(ЗаказКлиента, Товары, "ЗаказКлиента");

		Если НЕ ЗначениеЗаполнено(ЗаказКлиента)
			И МассивЗаказов.Количество() = 1
			И ТипЗнч(МассивЗаказов[0]) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			ЗаказКлиента = МассивЗаказов[0];
		КонецЕсли;

		СкидкиРассчитаны = Истина;

		ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.РеализацияТоваровУслуг);
		НоменклатураСервер.ЗаполнитьСерииПоFEFO(ЭтотОбъект,ПараметрыУказанияСерий, Ложь);

	КонецЕсли;

	СтруктураОснование = Документы.РеализацияТоваровУслуг.СтруктураОснованияДляПечати(ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураОснование);
	
	#Вставка  
	ОсобенностиУчетаНоменклатуры = Перечисления.ОсобенностиУчетаНоменклатуры;
	
	ОбувнаяПродукция = ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция;
	Духи = ОсобенностиУчетаНоменклатуры.Духи; 
	ЛегкаяПромышленность = ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность;
	
	МассивШтрихкодовУпаковок = Новый Массив;
	
	для каждого стр из товары цикл
		
		Параметры = Новый Структура("Склад, Номенклатура, Характеристика", стр.Склад, стр.Номенклатура, стр.Характеристика);
		//стр.Помещение = СкладыСервер.ПомещениеДляНоменклатуры(Параметры);
		
		НоменклатураВСтроке = стр.Номенклатура;
		ОсобенностьУчета = НоменклатураВСтроке.ОсобенностьУчета;
		
		Если ОсобенностьУчета = ОбувнаяПродукция
			ИЛИ ОсобенностьУчета = Духи
			ИЛИ ОсобенностьУчета = ЛегкаяПромышленность Тогда
			
			ШтрихкодУпаковки = НайтиШтрихкодУпаковкиВЗаказе(Стр.Номенклатура, стр.Характеристика, ДокументОснование);
			Если ШтрихкодУпаковки <> Неопределено Тогда
				СтрокаТЧ = ШтрихкодыУпаковок.Добавить();
				СтрокаТЧ.ШтрихкодУпаковки = ШтрихкодУпаковки;
			КонецЕсли;
			
		КонецЕсли;
		
		КонецЦикла;
	#КонецВставки

КонецПроцедуры                       

Процедура ПроверитьОплатуПоЗаказуКлиента(ДокументОснование) 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	РасчетыСКлиентамиОстатки.КОплатеОстаток КАК КОплатеОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(, ОбъектРасчетов.Объект = &ЗаказКлиента) КАК РасчетыСКлиентамиОстатки";
	Запрос.УстановитьПараметр("ЗаказКлиента", ДокументОснование);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.КОплатеОстаток > 0 Тогда
			ВызватьИсключение НСтр("ru='Для этого заказа еще не введена оплата'");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

