
&Перед("ОбработкаПроведения")
Процедура ba_ОбработкаПроведения(Отказ, РежимПроведения)
	Если Склад.АдресныйСклад
		И Склад.ДатаНачалаВеденияУчетаПоЯчейкам < Дата Тогда
		
		АдресноеХранениеBabochka.ОтразитьТоварыВЯчейкахРО(Ссылка, Движения, Отказ, "Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары");
		Если СтатусАдресноеХранение <> Перечисления.СтатусыОтборовРазмещенийТоваровBabochka.Выполнено Тогда
			Возврат;
		КонецЕсли;
	
	КонецЕсли;
	
	ЗапрещатьПроведениеРасходногоОрдераБезМаркировки = Бабочка.ПолучитьЗначениеДинамическихНастроек("ЗапрещатьПроведениеРасходногоОрдераБезМаркировки", Ложь);
	
	// Вынесено в отдельную переменную для читаемости условия.
	ЭтоПолныеПрава = РольДоступна("ПолныеПрава");
	
	Если ЗапрещатьПроведениеРасходногоОрдераБезМаркировки
		И Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен
		И Дата > Дата("20250619")
		И НЕ ЭтоПолныеПрава Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен) КАК СтатусОтгружен,
			|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
			|	ЕСТЬNULL(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ПеремещениеПоЗаказуИМ, ЛОЖЬ) КАК ПеремещениеПоЗаказуИМ
			|ИЗ
			|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
			|ГДЕ
			|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = &Ссылка
			|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			
			Если Выборка.ПеремещениеПоЗаказуИМ Тогда
						
				Результат = РазрешительныйРежимМаркировка.ПроверитьДокументНаКорректноВнесеннуюМаркировку(Ссылка);
				Если Результат.ЕстьОшибки Тогда
					Отказ = Истина;
					ВызватьИсключение Результат.ТекстОшибки;
				КонецЕсли;
			КонецЕсли;
				
		КонецЕсли;
				
	КонецЕсли;

КонецПроцедуры
