
Функция ДанныеДляПечатиЦенников(МассивДокументов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслугТовары.Номенклатура   КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	|
	|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Ссылка.Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.РозничныйМагазин) ТОГДА
	|		ЦеныНоменклатуры.Упаковка
	|	ИНАЧЕ
	|		ПриобретениеТоваровУслугТовары.Упаковка
	|	КОНЕЦ КАК Упаковка,
	|
	|	МИНИМУМ(ПриобретениеТоваровУслугТовары.НомерСтроки) КАК Порядок,
	|	СУММА(
	|		ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Ссылка.Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.РозничныйМагазин) ТОГДА
	|			ПриобретениеТоваровУслугТовары.КоличествоУпаковок * (ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1))
	|		ИНАЧЕ
	|			ПриобретениеТоваровУслугТовары.КоличествоУпаковок
	|		КОНЕЦ) КАК Количество
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ПриобретениеТоваровУслугТовары
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатуры
	|		ПО ЦеныНоменклатуры.Номенклатура   = ПриобретениеТоваровУслугТовары.Номенклатура
	|		 И ЦеныНоменклатуры.Характеристика = ПриобретениеТоваровУслугТовары.Характеристика
	|		 И ЦеныНоменклатуры.ВидЦены        = ПриобретениеТоваровУслугТовары.Ссылка.Склад.РозничныйВидЦены
	|	
	|ГДЕ
	|	ПриобретениеТоваровУслугТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслугТовары.Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика,
	|	ВЫБОР КОГДА ПриобретениеТоваровУслугТовары.Ссылка.Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.РозничныйМагазин) ТОГДА
	|		ЦеныНоменклатуры.Упаковка
	|	ИНАЧЕ
	|		ПриобретениеТоваровУслугТовары.Упаковка
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриобретениеТоваровУслуг.Организация            КАК Организация,
	|	ПриобретениеТоваровУслуг.Склад                  КАК Склад,
	|	ПриобретениеТоваровУслуг.Склад.РозничныйВидЦены КАК ВидЦены
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Ссылка В(&МассивДокументов)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки1",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ПриобретениеТоваровУслугТовары.Упаковка",
			"ПриобретениеТоваровУслугТовары.Номенклатура"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки2",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныНоменклатуры.Упаковка",
			"ЦеныНоменклатуры.Номенклатура"));
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаРеквизитыДокументов = МассивРезультатов[1].Выгрузить();
	МассивОрганизаций = ОбщегоНазначенияУТ.УникальныеЗначенияИзКолонкиТаблицы(ТаблицаРеквизитыДокументов, "Организация");
	МассивСкладов     = ОбщегоНазначенияУТ.УникальныеЗначенияИзКолонкиТаблицы(ТаблицаРеквизитыДокументов, "Склад");
	МассивВидовЦен    = ОбщегоНазначенияУТ.УникальныеЗначенияИзКолонкиТаблицы(ТаблицаРеквизитыДокументов, "ВидЦены");
	
	// Подготовка структуры действий для обработки печати ценников и этикеток
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьОрганизацию", ?(МассивОрганизаций.Количество() = 1, МассивОрганизаций[0], Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьСклад",       ?(МассивСкладов.Количество() = 1,     МассивСкладов[0],     МассивСкладов));
	СтруктураДействий.Вставить("ЗаполнитьВидЦены",     ?(МассивВидовЦен.Количество() = 1,    МассивВидовЦен[0],    Неопределено));
	СтруктураДействий.Вставить("ПоказыватьКолонкуКоличествоВДокументе", Истина);
	СтруктураДействий.Вставить("УстановитьРежимПечатиИзДокумента");
	СтруктураДействий.Вставить("УстановитьРежим", "ПечатьЦенников");
	СтруктураДействий.Вставить("ЗаполнитьКоличествоЦенниковПоДокументу");
	СтруктураДействий.Вставить("ЗаполнитьТаблицуТоваров");
	
	// Подготовка данных для заполенения табличной части обработки печати ценников и этикеток
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Товары", МассивРезультатов[0].Выгрузить());
	СтруктураРезультат.Вставить("СтруктураДействий", СтруктураДействий);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультат);
	
КонецФункции	      


Функция ТекстЗапросаТаблицаЗаказыПоставщикамТоварныеКатегории(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ЗаказыПоставщикамТоварныеКатегории";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	1                                                                 КАК Порядок,
	|	ТаблицаТовары.НомерСтроки                                         КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                            КАК ВидДвижения,
	|	&Период                                                           КАК Период,
	|	ТаблицаТовары.Ссылка.Договор                                              КАК ЗаказПоставщику,
	|	ТаблицаТовары.Ссылка.ЧастьКоллекции                                          КАК ЧастьКоллекции,
	|	ТаблицаТовары.ТоварнаяКатегория                                        КАК ТоварнаяКатегория,
	|	ТаблицаТовары.Пол                                      КАК Пол,
	|	ТаблицаТовары.КодСтроки                                           КАК КодСтроки,
	|	ТаблицаТовары.Ссылка.Склад                                               КАК Склад,
	|	ВЫБОР КОГДА  &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Подтвержден),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)) ТОГДА
	|			ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                             КАК КОформлению,
	|	ВЫБОР КОГДА  &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Подтвержден),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)) ТОГДА
	|			ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                             КАК КОформлениюПринято,
	|	ВЫБОР КОГДА  &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Подтвержден),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)) ТОГДА
	|			ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                             КАК КОтгрузке,
	|	ТаблицаТовары.Количество                                          КАК Заказано,
	|	НЕОПРЕДЕЛЕНО                                                      КАК ПричинаОтмены
	|ИЗ
	|	Документ.ЗаказПоставщику.ТоварныеКатегории КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка И ТаблицаТовары.Ссылка.Соглашение.УчетПоТоварнымКатегориям=ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2                                                                 КАК Порядок,
	|	ТаблицаТовары.НомерСтроки                                         КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                            КАК ВидДвижения,
	|	&Период                                                           КАК Период,
	|	ТаблицаТовары.Ссылка.Договор                                              КАК ЗаказПоставщику,
	|	ТаблицаТовары.Ссылка.ЧастьКоллекции                                          КАК ЧастьКоллекции,
	|	ТаблицаТовары.ТоварнаяКатегория                                        КАК ТоварнаяКатегория,
	|	ТаблицаТовары.Пол                                      КАК Пол,
	|	ТаблицаТовары.КодСтроки                                           КАК КодСтроки,
	|	ТаблицаТовары.Ссылка.Склад                                        КАК Склад,
	|	ВЫБОР КОГДА  &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Подтвержден),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)) ТОГДА
	|			-Товары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                             КАК КОформлению,
	|	ВЫБОР КОГДА  &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Подтвержден),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)) ТОГДА
	|			-Товары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                             КАК КОформлениюПринято,
	|	ВЫБОР КОГДА  &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Подтвержден),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)) ТОГДА
	|			-Товары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                             КАК КОтгрузке,
	|	-Товары.Количество                                          КАК Заказано,
	|	ТаблицаТовары.ПричинаОтмены                                       КАК ПричинаОтмены
	|ИЗ
	|	Документ.ЗаказПоставщику.ТоварныеКатегории КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК Товары
	|		ПО ТаблицаТовары.Ссылка = Товары.Ссылка
	|			И (Товары.Отменено)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Ссылка.Соглашение.УчетПоТоварнымКатегориям=ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции  


//++babochka
Функция ТекстЗапросаТаблицаПреварительныеЗаказы(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ПреварительныеЗаказы";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	1 КАК Порядок,
	               |	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	               |	&Период КАК Период,
	               |	ТаблицаТовары.ПредварительныйЗаказ КАК ПредварительныйЗаказ,
	               |	ТаблицаТовары.Номенклатура.ТоварнаяКатегория КАК ТоварнаяКатегория,
	               |	ТаблицаТовары.Номенклатура.Пол КАК Пол,
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ТаблицаТовары.Характеристика КАК Характеристика,
	               |	ТаблицаТовары.КодСтроки КАК КодСтроки,
	               |	ВЫБОР
	               |		КОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	               |			ТОГДА ТаблицаТовары.Склад
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК Склад,
	               |	ТаблицаТовары.Количество КАК КОформлению,
	               |	ТаблицаТовары.Количество КАК Заказано,
	               |	ТаблицаТовары.Сумма КАК СуммаКОформлению,
	               |	ТаблицаТовары.Сумма КАК СуммаЗаказано,
	               |	НЕОПРЕДЕЛЕНО КАК ПричинаОтмены,
	               |	ТаблицаТовары.СуммаИнвойс КАК СуммаКОформлениюИнвойс,
	               |	ТаблицаТовары.СуммаИнвойс КАК СуммаЗаказаноИнвойс
	               |ИЗ
	               |	Документ.ЗаказПоставщику.Товары КАК ТаблицаТовары
	               |ГДЕ
	               |	ТаблицаТовары.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок,
	               |	НомерСтроки";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции      


Функция ТекстЗапросаТаблицаПреварительныеЗаказыТоварныеКатегории(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ПреварительныеЗаказыТоварныеКатегории";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	ТаблицаТовары.ПредварительныйЗаказ КАК ПредварительныйЗаказ,
	|	ТаблицаТовары.ТоварнаяКатегория КАК ТоварнаяКатегория,
	|	ТаблицаТовары.Пол КАК Пол,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ТаблицаТовары.КодСтроки КАК КодСтроки,
	|	ТаблицаТовары.Ссылка.Склад КАК Склад,
	|	ТаблицаТовары.Количество КАК КОформлению,
	|	ТаблицаТовары.Количество КАК Заказано,
	|	ТаблицаТовары.СуммаСНДС КАК СуммаКОформлению,
	|	ТаблицаТовары.СуммаСНДС КАК СуммаЗаказано,
	|	НЕОПРЕДЕЛЕНО КАК ПричинаОтмены,
	|	ТаблицаТовары.СуммаИнвойс КАК СуммаКОформлениюИнвойс,
	|	ТаблицаТовары.СуммаИнвойс КАК СуммаЗаказаноИнвойс
	|ИЗ
	|	Документ.ЗаказПоставщику.ТоварныеКатегории КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Ссылка.Соглашение.УчетПоТоварнымКатегориям = ИСТИНА
	|	И ТаблицаТовары.ПредварительныйЗаказ <> ЗНАЧЕНИЕ(Документ.ПредварительныйЗаказ.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	ТаблицаТовары.НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	&Период,
	|	ТаблицаТовары.ПредварительныйЗаказ,
	|	ТаблицаТовары.ТоварнаяКатегория,
	|	ТаблицаТовары.Пол,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	ТаблицаТовары.КодСтроки,
	|	ТаблицаТовары.Ссылка.Склад,
	|	ВЫБОР
	|		КОГДА &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительныхЗаказов.КПоступлению), ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительныхЗаказов.Закрыт))
	|			ТОГДА -Товары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	-Товары.Количество,
	|	ВЫБОР
	|		КОГДА &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительныхЗаказов.КПоступлению), ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительныхЗаказов.Закрыт))
	|			ТОГДА -Товары.СуммаСНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	-Товары.СуммаСНДС,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительныхЗаказов.КПоступлению), ЗНАЧЕНИЕ(Перечисление.СтатусыПредварительныхЗаказов.Закрыт))
	|			ТОГДА -Товары.СуммаИнвойс
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	-Товары.СуммаИнвойс
	|ИЗ
	|	Документ.ЗаказПоставщику.ТоварныеКатегории КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК Товары
	|		ПО ТаблицаТовары.Ссылка = Товары.Ссылка
	|			И (Товары.Отменено)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.НомерСтроки = 1
	|	И ТаблицаТовары.Ссылка.Соглашение.УчетПоТоварнымКатегориям = ИСТИНА
	|	И ТаблицаТовары.ПредварительныйЗаказ <> ЗНАЧЕНИЕ(Документ.ПредварительныйЗаказ.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

&После("ЗарегистрироватьУчетныеМеханизмы")
Процедура ba_ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента)
	МеханизмыДокумента.Добавить("ПредварительныеЗаказы");
КонецПроцедуры

&ИзменениеИКонтроль("ДанныеДокументаДляПроведения")
Функция ba_ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры)

	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;

	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
		ДокументОбъект = Документ;
		ДокументСсылка = Документ.Ссылка;
	ИначеЕсли Документ = Неопределено Тогда
		ДокументОбъект = Неопределено;
		ДокументСсылка = ПустаяСсылка();
	Иначе
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументСсылка = Документ;
	КонецЕсли;

	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;

	ПолучитьДанныеДокумента(Запрос, ДокументСсылка);

	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений

		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);

		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		СформироватьСуммыДокументаВВалютахУчета(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		#Вставка 
		ТекстЗапросаТаблицаЗаказыПоставщикамТоварныеКатегории(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаПреварительныеЗаказы(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаПреварительныеЗаказыТоварныеКатегории(Запрос, ТекстыЗапроса, Регистры);
		#КонецВставки
		ТекстЗапросаТаблицаЗаказыПоставщикам(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаЦеныНоменклатурыПоставщиков(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
		ТекстЗапросаТаблицаРеестрДокументов(Запрос, ТекстыЗапроса, Регистры);
	КонецЕсли;

	ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры);
	ДобавитьТекстыОтраженияВзаиморасчетов(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);
	ЗапланироватьПоступлениеТоваров(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект);

	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений


	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);

КонецФункции



