
&Перед("ОбработкаПроверкиЗаполнения")
Процедура ba_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//++babochka
	Если ПроверяемыеРеквизиты.найти("АдресДоставки") <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.найти("АдресДоставки"));
	КонецЕсли;
	Если ПроверяемыеРеквизиты.найти("ПеревозчикПартнер") <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.найти("ПеревозчикПартнер"));
	КонецЕсли;
	//--babochka
	//ПредварительныеЗаказыСервер.ПроверитьТоварныеКатегорииОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты); 
КонецПроцедуры


&Вместо("ПолучитьКоличествоЗаказанныхСтрок")
Функция ba_ПолучитьКоличествоЗаказанныхСтрок()
	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("Отменено", Ложь));
	//++babochka
	Возврат НайденныеСтроки.Количество() + ТоварныеКатегории.НайтиСтроки(Новый Структура("Отменено", Ложь)).Количество();
	//--babochka
КонецФункции


&ИзменениеИКонтроль("ПолучитьСуммуЗаказанныхСтрок")
Функция ba_ПолучитьСуммуЗаказанныхСтрок(ТолькоЗалогЗаТару)

	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.СуммаСНДС КАК СуммаСНДС,
	|	Товары.Отменено КАК Отменено
	|ПОМЕСТИТЬ
	|	Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Товары.СуммаСНДС),0) КАК СуммаСНДС
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	НЕ Товары.Отменено
	|	И ((Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИЛИ (НЕ &ВернутьМногооборотнуюТару) ИЛИ &ТребуетсяЗалогЗаТару)
	|			И НЕ &ТолькоЗалогЗаТару)
	|		ИЛИ (Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			И &ВернутьМногооборотнуюТару
	|			И &ТребуетсяЗалогЗаТару
	|			И &ТолькоЗалогЗаТару)
	|");

	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(,"Номенклатура,СуммаСНДС,Отменено"));
	Запрос.УстановитьПараметр("ВернутьМногооборотнуюТару", ВернутьМногооборотнуюТару);
	Запрос.УстановитьПараметр("ТребуетсяЗалогЗаТару", ТребуетсяЗалогЗаТару);
	Запрос.УстановитьПараметр("ТолькоЗалогЗаТару", ТолькоЗалогЗаТару);

	Выгрузка = Запрос.Выполнить().Выгрузить();
	СуммаЗаказанныхСтрок = Выгрузка[0].СуммаСНДС; 
	
	#Вставка
	//++babochka
	УчетПоТоварнымКатегориям = ПредварительныеЗаказыСервер.УчетПоТоварнымКатегориям(Партнер, Соглашение, ХозяйственнаяОперация);
	
	Если НЕ ТолькоЗалогЗаТару
		И УчетПоТоварнымКатегориям Тогда
		
		СуммаОтменено 			= товары.Итог("СуммаСНДС") - СуммаЗаказанныхСтрок;
		СуммаЗаказанныхСтрок    = ТоварныеКатегории.Итог("СуммаСНДС") - СуммаОтменено;
		
	КонецЕсли;
	//--babochka
	#КонецВставки 
	
	Возврат СуммаЗаказанныхСтрок;
	
КонецФункции
 