
&НаСервере
&Вместо("ЗаполнитьЦеныПоСоглашениюСервер")
Функция BG_ЗаполнитьЦеныПоСоглашениюСервер(ПоВсемСтрокам, ТекстОшибки)
	
	// Андрей Ринг
	Если Объект.ТоварныеКатегории.Количество() Тогда
		Возврат Истина;
	КонецЕсли;
	// Андрей Ринг
	
	Если ПоВсемСтрокам Тогда
		МассивСтрок = Неопределено;
	Иначе
		МассивСтрок = Новый Массив;
		Для Каждого Строка Из Элементы.Товары.ВыделенныеСтроки Цикл
			МассивСтрок.Добавить(Объект.Товары.НайтиПоИдентификатору(Строка));
		КонецЦикла;
	КонецЕсли;
	
	СтруктураПересчетаСуммы = ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ();
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС",СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС",СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("ПересчитыватьСуммуРучнойСкидки", Ложь));
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, СтавкаНДС, ВидЦеныПоставщика");
	ПараметрыЗаполнения.Вставить("Дата", Объект.Дата);
	ПараметрыЗаполнения.Вставить("Валюта", Объект.Валюта);
	ПараметрыЗаполнения.Вставить("Соглашение", Объект.Соглашение);
	ПараметрыЗаполнения.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	
	ЦеныРассчитаны = ЗакупкиСервер.ЗаполнитьЦены(
		Объект.Товары,
		МассивСтрок, // Массив строк
		ПараметрыЗаполнения,
		СтруктураДействий);
	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	Возврат ЦеныРассчитаны;
	
КонецФункции

&НаКлиенте
Процедура BG_ГруппаСтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	// Андрей Ринг
	Если ТекущаяСтраница.Имя = "ГруппаТоварныеКатегории" Тогда
		ЗагрузитьТоварныеКатегории();
	КонецЕсли;
	// Андрей Ринг
КонецПроцедуры

&НаКлиенте
Процедура BG_НадписьЭтапыОплатыНажатиеПеред(Элемент, СтандартнаяОбработка)
	// Андрей Ринг
	Если ЭтаФорма.УчетПоТоварнымКатегориям Тогда
		СуммаЗаказано = Объект.ТоварныеКатегории.Итог("Сумма")-Объект.Товары.Итог("СуммаОтменено");
	КонецЕсли;
	// Андрей Ринг
КонецПроцедуры

&НаКлиенте
Процедура BG_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	// Андрей Ринг	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ФормированиеАссортимента.Форма.Форма" Тогда
		
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		Модифицированность = Истина;
	КонецЕсли;	
	// Андрей Ринг
КонецПроцедуры
&НаСервере
&Вместо("ОбработкаВыбораПодборНаСервере")
Процедура BG_ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		ТекущаяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара, "НоменклатураПартнера, Номенклатура, Характеристика, Упаковка, Склад, ВидЦеныПоставщика, Цена, КоличествоУпаковок, ПроцентРучнойСкидки");
		
		Если Объект.ПоступлениеОднойДатой Тогда
			ТекущаяСтрока.ДатаПоступления = Объект.ДатаПоступления;
		КонецЕсли;
		
		ТекущаяСтрока.Склад = Объект.Склад;
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", Объект.НалогообложениеНДС, Объект.Дата));
		СтруктураДействий.Вставить("ЗаполнитьПризнакАналитикаРасходовОбязательна");
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		НаправленияДеятельностиКлиентСервер.СтруктураДействийВставитьПриДобавленииСтроки(ЭтаФорма, СтруктураДействий);
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ЭтаФорма);
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
	КонецЦикла;
	
	Если КонтролироватьАссортимент Тогда
		АссортиментСервер.ПроверитьАссортиментТаблицыПодобранныхТоваров(Объект, "Склад", ТаблицаТоваров);
	КонецЕсли;
	
	
	СтруктураХарактеристикиНоменклатуры = Новый Структура;
	СтруктураХарактеристикиНоменклатуры.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Товары, СтруктураХарактеристикиНоменклатуры);
	
	ЗаполнитьПризнакСписанияНаРасходыДляУслуг();
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	ПриИзмененииСкладаВТабличнойЧастиСервер();
	МногооборотнаяТараСервер.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);

КонецПроцедуры

&НаСервере
&Перед("ПриИзмененииСоглашенияСервер")
Процедура BG_ПриИзмененииСоглашенияСервер(ПересчитатьЦены)
	// Андрей Ринг цены по присланным заказам
	ПересчитатьЦены = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура BG_ПриОткрытииПеред(Отказ)
	// Андрей Ринг
	Если ОткрыватьПомощникСоздания Тогда
		Отказ = Истина;
		ОткрытьФорму("Обработка.ФормированиеЗаказовПоставщикуПоПредварительномуЗаказу.Форма", Новый Структура("ПредварительныйЗаказ", Объект.ПредварительныйЗаказ));
	КонецЕсли;
	// Андрей Ринг
КонецПроцедуры

&НаСервере
Процедура BG_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Параметры.Свойство("Основание")
			И ТипЗнч(Параметры.Основание)=Тип("ДокументСсылка.ПредварительныйЗаказ") Тогда
			ОткрыватьПомощникСоздания = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// Андрей Ринг
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОснование", "Видимость", Истина);
	ОбновитьИнформациюПоПредЗаказам(); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
&После("РассчитатьИтоговыеПоказателиЗаказа")
Процедура BG_РассчитатьИтоговыеПоказателиЗаказа(Форма)
	// Андрей Ринг
	Если Форма.УчетПоТоварнымКатегориям Тогда
		Форма.СуммаЗаказано 				= Форма.Объект.ТоварныеКатегории.Итог("Сумма")-Форма.Объект.Товары.Итог("СуммаОтменено");
		Форма.СуммаРучнойСкидки 			= Форма.Объект.ТоварныеКатегории.Итог("СуммаРучнойСкидки")-Форма.Объект.Товары.Итог("СуммаРучнойСкидкиОтменено");
		Форма.СуммаЗаказаноСЗалоговойТарой  = Форма.Объект.ТоварныеКатегории.Итог("Сумма")-Форма.Объект.Товары.Итог("СуммаОтменено");
	КонецЕсли;
	// Андрей Ринг
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ()
	
	СтруктураЗаполненияЦены = Новый Структура;
	СтруктураЗаполненияЦены.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект,"НалогообложениеНДС") Тогда
		СтруктураЗаполненияЦены.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	КонецЕсли;
	
	Возврат СтруктураЗаполненияЦены;
	
КонецФункции

Процедура ЗагрузитьТоварныеКатегории()
	ПредварительныеЗаказыСервер.ЗагрузитьТоварныеКатегории(ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура BG_ЗаполнитьДополнительныеРеквизитыПосле(Команда)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьДополнительныеРеквизитыЗавершение", ЭтотОбъект), "Для вызова обработки необходимо записать документ. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьДополнительныеРеквизитыФрагмент();
	Конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДополнительныеРеквизитыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	Если Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
		ЗаполнитьДополнительныеРеквизитыФрагмент();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДополнительныеРеквизитыФрагмент()
	
	ПараметрыОбработки = Новый Структура("Документ", Объект.Ссылка);
	
	ОткрытьФорму("Обработка.ЗаполнениеДополнительныхРеквизитовНовый.Форма", ПараметрыОбработки, ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура BG_ЗаполнитьПеремещаемПосле(Команда)
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	Если Объект.Товары.Количество() = 0 Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'В список ""Товары"" не введено ни одной строки.'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Склады.ФормаВыбора", , ЭтаФорма,,,,Новый ОписаниеОповещения("ЗаполнитьПеремещаемЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПеремещаемЗавершение(Перемещаем, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Перемещаем) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НомерСтроки Из Элементы.товары.ВыделенныеСтроки Цикл
		СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
		СтрокаТЧ.Перемещаем  = Перемещаем;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура BG_ЗаполнитьТоварыПоПредварительномуЗаказуПосле(Команда)
	ПредварительныйЗаказПриИзмененииСервер(Ложь,,Ложь);
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
КонецПроцедуры

// Андрей Ринг
&НаКлиенте
Процедура ОбработкаФормированияАссортимента(ВыбранноеЗначение) Экспорт
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ПодборТоваровИзЗаказа()
	
	МассивКодовСтрок = Новый Массив;
	МассивКодовСтрок.Добавить(Новый Структура("КодСтроки,ЗаказПоставщику", 0, Объект.ПредварительныйЗаказ));
	
	ПараметрыПодбора = Новый Структура(
		"ЗаказПоставщику,
		|ВалютаДокумента,
		|Склад,
		|МассивКодовСтрок,
		|Партнер,
		|Контрагент,
		|Договор,
		|Организация,
		|ХозяйственнаяОперация,
		|Соглашение,
		|ВалютаВзаиморасчетов,
		|НалогообложениеНДС,
		|ЦенаВключаетНДС,
		|ПорядокРасчетов,
		|ВернутьМногооборотнуюТару,
		|НаправлениеДеятельности",
		Объект.Ссылка,
		Объект.Валюта,
		Объект.Склад,
		МассивКодовСтрок,
		Объект.Партнер,
		Объект.Контрагент,
		Объект.Договор,
		Объект.Организация,
		Объект.ХозяйственнаяОперация,
		Объект.Соглашение,
		Объект.Валюта,
		Объект.НалогообложениеНДС,
		Объект.ЦенаВключаетНДС,
		Объект.ПорядокРасчетов,
		Объект.ВернутьМногооборотнуюТару,
		Объект.НаправлениеДеятельности);
	
	ОткрытьФорму(
		"Документ.ЗаказПоставщику.Форма.ФормаПодбораТоваровИзЗаказа",
		ПараметрыПодбора,
		ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТоварыИзЗаказа(Команда)
	
	ПодборТоваровИзЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура BG_ПредварительныйЗаказ1ПриИзмененииПосле(Элемент)
	ПредварительныйЗаказПриИзмененииСервер();
	СоглашениеПриИзмененииСервер(ЗначениеЗаполнено(Объект.Соглашение) И Объект.Товары.Количество() > 0);
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПредварительныйЗаказПриИзмененииСервер(ЗаполнитьТоварныеКатегории=Истина, ЗаполнитьТовары=Истина, ЗаполнитьРеквизиты = Истина)
	
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	ПредварительныеЗаказыСервер.ЗаполнитьЗаказПоПредварительномуЗаказу(
		Объект,
		?(Объект.ПредварительныйЗаказ = Документы.ПредварительныйЗаказ.ПустаяСсылка(), ПолучитьСписокПредварительныхЗаказов(), Объект.ПредварительныйЗаказ),
		ЗаполнитьРеквизиты,
		ЗаполнитьТоварныеКатегории,
		ЗаполнитьТовары);
	
	ВидЦеныПоставщика = Объект.Соглашение.ВидЦеныПоставщика;
	
	Для каждого ТекущаяСтрока Из Объект.Товары Цикл
		
		Если Объект.ПоступлениеОднойДатой Тогда
			ТекущаяСтрока.ДатаПоступления = Объект.ДатаПоступления;
		КонецЕсли;
		
		ТекущаяСтрока.ВидЦеныПоставщика = ВидЦеныПоставщика;
		
		СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
		
		СтруктураДействий = Новый Структура;
		
		ПараметрыЗаполненияСтавкиНДС = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект, Истина);
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПараметрыЗаполненияСтавкиНДС);
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
		СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатуры",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
	КонецЦикла;
	
	СкладГруппа = Справочники.Склады.ЭтоГруппаИСкладыИспользуютсяВТЧДокументовЗакупки(Объект.Склад);
	СкладыСервер.ЗаполнитьСкладыВТабличнойЧасти(Объект.Склад, СкладГруппа, Объект.Товары, Ложь);
		
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(
		Объект.Товары,
		Новый Структура(
			"ЗаполнитьПризнакХарактеристикиИспользуются",
			Новый Структура("Номенклатура", "ХарактеристикиИспользуются")));
	
	ЗаполнитьПризнакСписанияНаРасходыДляУслуг();
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	ПриИзмененииСкладаВТабличнойЧастиСервер();
	МногооборотнаяТараСервер.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);
	
КонецПроцедуры

&НаКлиенте
Процедура BG_СформироватьАссортиментПосле(Команда)
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(
		"Документ.ПредварительныйЗаказ.ФормаДокумента.Команда.ПодобратьТовары");
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		ОчиститьСообщения();
		СообщитьОбОшибкахОткрытияПодбора(Отказ);
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ",        		Объект.Ссылка);
	ПараметрыФормы.Вставить("Партнер",         		Объект.Партнер);
	ПараметрыФормы.Вставить("Соглашение",      		Объект.Соглашение);
	ПараметрыФормы.Вставить("ЦенаВключаетНДС", 		Объект.ЦенаВключаетНДС);
	ПараметрыФормы.Вставить("ПроцентРучнойСкидки",  ?(Объект.ТоварныеКатегории.Количество(), Объект.ТоварныеКатегории[0].ПроцентРучнойСкидки, 0));
	ПараметрыФормы.Вставить("Марка",      			Объект.Марка);
	ПараметрыФормы.Вставить("Коллекция", 			Объект.Коллекция);
	
	ПараметрыФормы.Вставить("Склад",       			Объект.Склад);
	ПараметрыФормы.Вставить("Валюта",      			Объект.Валюта);
	
	ПараметрыФормы.Вставить("РегистрироватьЦеныПоУсловиям", ПолучитьРегистрироватьЦеныПоУсловиям());
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Истина);
	Если Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПриемНаКомиссию") Тогда
		ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", Новый ФиксированныйМассив(НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре(Ложь)));
		ПараметрыФормы.Вставить("СкрыватьРучныеСкидки", Истина);
	Иначе
		ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", Новый ФиксированныйМассив(НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТареУслугеРаботе(Ложь)));
	КонецЕсли;
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	
	ОткрытьФорму("Обработка.ФормированиеАссортимента.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);

КонецПроцедуры


&НаКлиенте
Процедура BG_ТоварныеКатегорииКоличествоУпаковокПриИзмененииПосле(Элемент)
	
	СтруктураПересчетаСуммы = ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ();
	
	ТекущаяСтрока = Элементы.ТоварныеКатегории.ТекущиеДанные;
	СтруктураДействий = Новый Структура;	
	
	ТекущаяСтрока.Количество = ТекущаяСтрока.КоличествоУпаковок;
		
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	ТекущаяСтрока.СуммаРучнойСкидки = ТекущаяСтрока.СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки / 100;
	ТекущаяСтрока.СуммаИнвойс = ТекущаяСтрока.СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
	ТекущаяСтрока.ЦенаИнвойс = ?(ТекущаяСтрока.Количество = 0, ТекущаяСтрока.СуммаИнвойс, ТекущаяСтрока.СуммаИнвойс / ТекущаяСтрока.Количество);
	ТекущаяСтрока.Цена = ?(ТекущаяСтрока.Количество = 0, ТекущаяСтрока.Сумма, ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество);

	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура BG_ТоварныеКатегорииПослеУдаленияПосле(Элемент)
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура BG_ТоварныеКатегорииПриИзмененииПосле(Элемент)
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	Для Каждого СтрокаКатегорий ИЗ Объект.ТоварныеКатегории Цикл
		
		СуммаТоваров 	= 0;
		ДанныеВТоварах 	= ТоварныеКатегорииТоваров.НайтиСтроки(Новый Структура("ТоварнаяКатегория", СтрокаКатегорий.ТоварнаяКатегория));
		
		Для Каждого СтрокаТовара ИЗ ДанныеВТоварах Цикл
			СуммаТоваров = СуммаТоваров + СтрокаТовара.Сумма;
		КонецЦикла;
		
		Если НЕ СтрокаКатегорий.Отменено Тогда
			СтрокаКатегорий.СуммаТоваров = СуммаТоваров;
			СтрокаКатегорий.Разница 	 = СтрокаКатегорий.Сумма - СуммаТоваров;
		КонецЕсли;
		
		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура BG_ТоварныеКатегорииПриНачалеРедактированияПосле(Элемент, НоваяСтрока, Копирование)
	ТекущаяСтрока = Элементы.ТоварныеКатегории.ТекущиеДанные;
	ТекущаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
КонецПроцедуры


&НаКлиенте
Процедура BG_ТоварныеКатегорииПроцентРучнойСкидкиПриИзмененииПосле(Элемент)
	СтруктураПересчетаСуммы = ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ();
	ТекущаяСтрока = Элементы.ТоварныеКатегории.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	
	ТекущаяСтрока.СуммаРучнойСкидки = ТекущаяСтрока.СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки / 100;
	ТекущаяСтрока.СуммаИнвойс = ТекущаяСтрока.СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки; 
	ТекущаяСтрока.ЦенаИнвойс = ТекущаяСтрока.СуммаИнвойс / ТекущаяСтрока.Количество;
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура BG_ТоварныеКатегорииСуммаБезСкидкиПриИзмененииПосле(Элемент)
	
	ТекущаяСтрока 			= Элементы.ТоварныеКатегории.ТекущиеДанные;
	
	ТекущаяСтрока.СуммаРучнойСкидки = ТекущаяСтрока.СуммаБезСкидки * ТекущаяСтрока.ПроцентРучнойСкидки / 100;
	ТекущаяСтрока.СуммаИнвойс = ТекущаяСтрока.СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
	ТекущаяСтрока.ЦенаИнвойс = ТекущаяСтрока.СуммаИнвойс / ТекущаяСтрока.Количество;

	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура BG_ТоварныеКатегорииСуммаПриИзмененииПосле(Элемент)
	СтруктураПересчетаСуммы = ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ();
	ТекущаяСтрока = Элементы.ТоварныеКатегории.ТекущиеДанные;
	
	СтруктураЗаполненияЦены = Новый Структура;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВЗакупках", СтруктураЗаполненияЦены);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура BG_ТоварныеКатегорииСуммаРучнойСкидкиПриИзмененииПосле(Элемент)
	ТекущаяСтрока = Элементы.ТоварныеКатегории.ТекущиеДанные;

	Если ТекущаяСтрока.СуммаБезСкидки <> 0 Тогда
		ТекущаяСтрока.ПроцентРучнойСкидки = ТекущаяСтрока.СуммаРучнойСкидки * 100 / ТекущаяСтрока.СуммаБезСкидки;
	КонецЕсли;
	ТекущаяСтрока.СуммаИнвойс = ТекущаяСтрока.СуммаБезСкидки - ТекущаяСтрока.СуммаРучнойСкидки;
	ТекущаяСтрока.ЦенаИнвойс = ТекущаяСтрока.СуммаИнвойс / ТекущаяСтрока.Количество;

	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура BG_ТоварныеКатегорииЦенаПриИзмененииПосле(Элемент)
	СтруктураПересчетаСуммы = ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ();
	ТекущаяСтрока = Элементы.ТоварныеКатегории.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура BG_НадписьЗаголовокПредзаказыНажатиеПосле(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму(
		"ОбщаяФорма.ПросмотрСпискаДокументов",
		Новый Структура("СписокДокументов, Заголовок",
			ПолучитьСписокПредварительныхЗаказов(),
			НСтр("ru='Предварительные заказы (%КоличествоДокументов%)'")
		),
		ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

Функция НужноОткрытьПомощникСоздания()

	Возврат Не ЗначениеЗаполнено(Объект.Ссылка)
		И Параметры.Свойство("Основание")
		И ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ПредварительныйЗаказ");

КонецФункции

Функция ПолучитьРегистрироватьЦеныПоУсловиям()

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, "РегистрироватьЦеныПоУсловиям") Тогда
		Возврат ЭтаФорма.РегистрироватьЦеныПоУсловиям;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

Функция ПолучитьСписокПредварительныхЗаказов()

	СписокЗаказов = Новый СписокЗначений;

	Для Каждого СтрокаТоварнойКатегории Из Объект.ТоварныеКатегории Цикл
		Если ЗначениеЗаполнено(СтрокаТоварнойКатегории.ПредварительныйЗаказ)
			И СписокЗаказов.НайтиПоЗначению(СтрокаТоварнойКатегории.ПредварительныйЗаказ) = Неопределено Тогда
			СписокЗаказов.Добавить(СтрокаТоварнойКатегории.ПредварительныйЗаказ);
		КонецЕсли;
	КонецЦикла;

	Возврат СписокЗаказов;

КонецФункции

Процедура ОбновитьИнформациюПоПредЗаказам()

	СписокЗаказов = ПолучитьСписокПредварительныхЗаказов();

	Если СписокЗаказов.Количество() > 1 Тогда
		НадписьЗаголовокПредзаказы = НСтр("ru = 'Всего предварительных заказов'");
		НадписьЗаголовокПредзаказы = НадписьЗаголовокПредзаказы + ": " + СписокЗаказов.Количество();
	КонецЕсли;
	Если СписокЗаказов.Количество() > 1 Тогда
		Элементы.СтраницыПредзаказ.ТекущаяСтраница = Элементы.СтраницаПредзаказы;
		Если Объект.ПредварительныйЗаказ <> Документы.ПредварительныйЗаказ.ПустаяСсылка() Тогда 
			Объект.ПредварительныйЗаказ = Документы.ПредварительныйЗаказ.ПустаяСсылка();
		КонецЕсли;
	Иначе
		Элементы.СтраницыПредзаказ.ТекущаяСтраница = Элементы.СтраницаПредзаказ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварныеКатегорииПредварительныйЗаказПриИзмененииПосле(Элемент)
	ОбновитьИнформациюПоПредЗаказам();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСуммыИнвойсаПоЗаказу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Количество КАК Количество,
		|	Товары.ПредварительныйЗаказ КАК ПредварительныйЗаказ,
		|	Товары.КодСтроки КАК КодСтроки,
		|	Товары.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.КодСтроки КАК КодСтроки,
		|	ЕСТЬNULL(ПредварительныйЗаказТовары.ЦенаИнвойс, 0) КАК ЦенаИнвойс,
		|	ЕСТЬNULL(ПредварительныйЗаказТовары.ЦенаИнвойс, 0) * ВТТовары.Количество КАК СуммаИнвойс
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПредварительныйЗаказ.Товары КАК ПредварительныйЗаказТовары
		|		ПО ВТТовары.Номенклатура = ПредварительныйЗаказТовары.Номенклатура
		|			И ВТТовары.ПредварительныйЗаказ = ПредварительныйЗаказТовары.Ссылка
		|			И ВТТовары.Характеристика = ПредварительныйЗаказТовары.Характеристика";
	
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить(,"Номенклатура,Характеристика,ПредварительныйЗаказ,Количество,КодСтроки"));
	
	ТЗЦеныПредЗаказа = Запрос.Выполнить().Выгрузить();
	ТЗЦеныПредЗаказа.Индексы.Добавить("КодСтроки");
	
	Для каждого СтрокаТЧ Из Объект.Товары Цикл   
		
		НайденнаяСтрока = ТЗЦеныПредЗаказа.Найти(СтрокаТЧ.КодСтроки, "КодСтроки");
		Если НайденнаяСтрока <> Неопределено Тогда
			СтрокаТЧ.ЦенаИнвойс  = НайденнаяСтрока.ЦенаИнвойс;		
			СтрокаТЧ.СуммаИнвойс = НайденнаяСтрока.СуммаИнвойс;
		КонецЕсли;
			
	КонецЦикла; 
	
КонецФункции

&НаКлиенте
Процедура BG_ЗаполнитьСуммуИнвойсПосле(Команда)
	
	ЗаполнитьСуммыИнвойсаПоЗаказу(); 

КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварыЦенаИнвойсПриИзмененииПосле(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;  
	Сумма = ТекущаяСтрока.ЦенаИнвойс * ТекущаяСтрока.Количество;
	ТекущаяСтрока.СуммаРучнойСкидки = Сумма * ТекущаяСтрока.ПроцентРучнойСкидки / 100;
	ТекущаяСтрока.СуммаИнвойс = Сумма - ТекущаяСтрока.СуммаРучнойСкидки;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварыПроцентРучнойСкидкиПриИзмененииПосле(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	Сумма = ТекущаяСтрока.ЦенаИнвойс * ТекущаяСтрока.Количество;
	ТекущаяСтрока.СуммаРучнойСкидки = Сумма * ТекущаяСтрока.ПроцентРучнойСкидки / 100;
	ТекущаяСтрока.СуммаИнвойс = Сумма  - ТекущаяСтрока.СуммаРучнойСкидки;
	
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Сумма = ТекущаяСтрока.ЦенаИнвойс * ТекущаяСтрока.Количество;
	ТекущаяСтрока.СуммаРучнойСкидки = Сумма * ТекущаяСтрока.ПроцентРучнойСкидки / 100;
	ТекущаяСтрока.СуммаИнвойс = Сумма - ТекущаяСтрока.СуммаРучнойСкидки; 
	
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварыСуммаРучнойСкидкиПриИзмененииПосле(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	Сумма = ТекущаяСтрока.ЦенаИнвойс * ТекущаяСтрока.Количество;
	
	ТекущаяСтрока.СуммаИнвойс = Сумма - ТекущаяСтрока.СуммаРучнойСкидки;
	Если Сумма <> 0 Тогда
		ТекущаяСтрока.ПроцентРучнойСкидки =  ТекущаяСтрока.СуммаРучнойСкидки * 100 / Сумма;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура BG_ТоварыСуммаИнвойсПриИзмененииПосле(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока.ЦенаИнвойс = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Сумма = ТекущаяСтрока.ЦенаИнвойс * ТекущаяСтрока.Количество;
	
	ТекущаяСтрока.СуммаРучнойСкидки = Сумма - ТекущаяСтрока.СуммаИнвойс;

    Если Сумма <> 0 Тогда
		ТекущаяСтрока.ПроцентРучнойСкидки =  ТекущаяСтрока.СуммаРучнойСкидки * 100 / Сумма;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НазначитьРучнуюСкидкуДляВыделенныхСтрокИнвойс(Команда)

	Если Не СкидкиНаценкиКлиент.ВозможноНазначениеРучнойСкидкиНаценки(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		Возврат;
	КонецЕсли;

	АдресВоВременномХранилище = АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилищеИнвойс(Истина);
	
	Оповещение = Новый ОписаниеОповещения(
		"НазначитьРучнуюСкидкуДляВыделенныхСтрокЗавершениеИнвойс", 
		ЭтотОбъект, 
		Новый Структура("АдресВоВременномХранилище", АдресВоВременномХранилище));
	
	СкидкиНаценкиКлиент.ОткрытьФормуНазначенияРучныхСкидок(
		АдресВоВременномХранилище,
		Объект.Валюта,
		Оповещение,
		Истина);

		Модифицированность = Истина;
		
КонецПроцедуры

&НаСервере
Функция АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилищеИнвойс(ТолькоВыделенныеСтроки)
	
	Возврат Б_РегламентныеЗаданияСервер.АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилищеЗакупкиИнвойс(ЭтаФорма, "Товары", УникальныйИдентификатор, ТолькоВыделенныеСтроки);
	
КонецФункции

&НаКлиенте
Процедура НазначитьРучнуюСкидкуДляВыделенныхСтрокЗавершениеИнвойс(СуммаРучнойСкидкиНаценки, ДополнительныеПараметры) Экспорт 
	
	АдресВоВременномХранилище = ДополнительныеПараметры.АдресВоВременномХранилище;
	
	Если СуммаРучнойСкидкиНаценки <> Неопределено Тогда
		
		НазначитьРучнуюСкидкуНаСервереИнвойс(СуммаРучнойСкидкиНаценки, Элементы.Товары.ВыделенныеСтроки, АдресВоВременномХранилище);
		
        СкидкиНаценкиКлиент.ОповеститьОбОкончанииНазначенияРучныхСкидокНаценок(СуммаРучнойСкидкиНаценки, Объект.Валюта);
			
	КонецЕсли;

КонецПроцедуры          

&НаСервере
Процедура НазначитьРучнуюСкидкуНаСервереИнвойс(СуммаСкидкиНаценки, Знач ВыделенныеСтроки, АдресВоВременномХранилище)
	
	ПараметрыСкидки = Новый Структура();
	ПараметрыСкидки.Вставить("ИспользуютсяАвтоматическиеСкидки", Ложь);
	ПараметрыСкидки.Вставить("РассчитыватьСуммуСНДС", Истина);
	ПараметрыСкидки.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	ПараметрыСкидки.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
	
	Б_РегламентныеЗаданияСервер.НазначитьРучнуюСкидкуИнвойс(Объект, "Товары", СуммаСкидкиНаценки, ПараметрыСкидки);
	
КонецПроцедуры


&НаКлиенте
Процедура BG_ОтменитьРучныеСкидкиИнвойсПосле(Команда)
	
	Если Не СкидкиНаценкиКлиент.ВозможнаОтменаРучныхСкидокНаценок(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		
		СтрокаТЧ.ПроцентРучнойСкидки = 0;
		СтрокаТЧ.СуммаРучнойСкидки = 0;
		СтрокаТЧ.СуммаИнвойс = СтрокаТЧ.ЦенаИнвойс * СтрокаТЧ.Количество;
		
	КонецЦикла; 
	
	СкидкиНаценкиКлиент.ОповеститьОбОкончанииНазначенияРучныхСкидокНаценок();
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);	
    Модифицированность = Истина;
	
КонецПроцедуры




